[Survived] StringLiteral
src/model-image-capability.ts:56:47
-         stack.push({ value: block.system, kind: "block" }, { value: block.responsesRequest, kind: "request" });
+         stack.push({ value: block.system, kind: "" }, { value: block.responsesRequest, kind: "request" });
Tests ran:
    POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding responses images never call a known text-only upstream
  and 80 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:60:48
-         stack.push({ value: block.content, kind: "block" });
+         stack.push({ value: block.content, kind: "" });
Tests ran:
    POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding responses images never call a known text-only upstream
  and 75 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:61:90
-         if (block.type === "function_call_output") stack.push({ value: block.output, kind: "block" });
+         if (block.type === "function_call_output") stack.push({ value: block.output, kind: "" });
Tests ran:
    CQA-04 image references and multiplicity retains file images and inspects Responses output, system and internal envelope
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
  and 36 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:65:86
-         for (const key of ["content", "output"]) stack.push({ value: block[key], kind: "block" });
+         for (const key of ["content", "output"]) stack.push({ value: block[key], kind: "" });
Tests ran:
    POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding responses images never call a known text-only upstream
  and 70 more tests!

[Survived] StringLiteral
src/upstream-error-evidence.ts:51:60
-     const imageMessage = normalized.replace(/(\d)\.(?=\d)/g, "$1");
+     const imageMessage = normalized.replace(/(\d)\.(?=\d)/g, "");
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 47 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:61:9
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (true && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 11 more tests!
