[NoCoverage] StringLiteral
src/model-image-capability.ts:49:91
-         for (const value of item.value) stack.push({ value, kind: item.kind === "request" ? "message" : item.kind });
+         for (const value of item.value) stack.push({ value, kind: item.kind === "request" ? "" : item.kind });

[Survived] ConditionalExpression
src/model-image-capability.ts:34:20
-     if (converted && block.type === "file" && typeof block.file_id === "string") return `file:${block.file_id}`;
+     if (converted && true && typeof block.file_id === "string") return `file:${block.file_id}`;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 61 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:34:45
-     if (converted && block.type === "file" && typeof block.file_id === "string") return `file:${block.file_id}`;
+     if (converted && block.type === "file" && true) return `file:${block.file_id}`;
Tests ran:
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
    CQA-04 image references and multiplicity retains file images and inspects Responses output, system and internal envelope

[Survived] ConditionalExpression
src/model-image-capability.ts:49:65
-         for (const value of item.value) stack.push({ value, kind: item.kind === "request" ? "message" : item.kind });
+         for (const value of item.value) stack.push({ value, kind: true ? "message" : item.kind });
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 72 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:49:65
-         for (const value of item.value) stack.push({ value, kind: item.kind === "request" ? "message" : item.kind });
+         for (const value of item.value) stack.push({ value, kind: false ? "message" : item.kind });
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 72 more tests!

[Survived] EqualityOperator
src/model-image-capability.ts:49:65
-         for (const value of item.value) stack.push({ value, kind: item.kind === "request" ? "message" : item.kind });
+         for (const value of item.value) stack.push({ value, kind: item.kind !== "request" ? "message" : item.kind });
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 72 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:49:79
-         for (const value of item.value) stack.push({ value, kind: item.kind === "request" ? "message" : item.kind });
+         for (const value of item.value) stack.push({ value, kind: item.kind === "" ? "message" : item.kind });
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 72 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:59:9
-       if (item.kind === "message") {
+       if (true) {
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 72 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:61:11
-         if (block.type === "function_call_output") stack.push({ value: block.output, kind: "block" });
+         if (true) stack.push({ value: block.output, kind: "block" });
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 72 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:64:11
-         if (block.type === "tool_use" || block.type === "function_call") continue;
+         if (false) continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 69 more tests!

[Survived] LogicalOperator
src/model-image-capability.ts:64:11
-         if (block.type === "tool_use" || block.type === "function_call") continue;
+         if (block.type === "tool_use" && block.type === "function_call") continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 69 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:64:11
-         if (block.type === "tool_use" || block.type === "function_call") continue;
+         if (false || block.type === "function_call") continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 69 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:64:26
-         if (block.type === "tool_use" || block.type === "function_call") continue;
+         if (block.type === "" || block.type === "function_call") continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 69 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:64:40
-         if (block.type === "tool_use" || block.type === "function_call") continue;
+         if (block.type === "tool_use" || false) continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 68 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:64:55
-         if (block.type === "tool_use" || block.type === "function_call") continue;
+         if (block.type === "tool_use" || block.type === "") continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 68 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:65:37
-         for (const key of ["content", "output"]) stack.push({ value: block[key], kind: "block" });
+         for (const key of ["content", ""]) stack.push({ value: block[key], kind: "block" });
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 68 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:52:7
-     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(imageMessage)
+     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n](?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(imageMessage)
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 43 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:61:9
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (true) return "INVALID_PARAMETER";
Tests ran:
    upstream error evidence 安全 canonical hash 锁定消息规范化和 Provider 枚举
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
  and 9 more tests!

[Survived] LogicalOperator
src/upstream-error-evidence.ts:61:9
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (code !== null || ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
Tests ran:
    upstream error evidence 安全 canonical hash 锁定消息规范化和 Provider 枚举
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
  and 9 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:62:9
-       if (/(?:参数|字段)[^。\n]{0,40}(?:有误|非法|无效|错误|缺失)/.test(message)) return "INVALID_PARAMETER";
+       if (true) return "INVALID_PARAMETER";
Tests ran:
    upstream error evidence 安全 canonical hash 锁定消息规范化和 Provider 枚举
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
  and 2 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:64:7
-     if (/(context|token).*(length|limit|maximum)|maximum context/.test(normalized)) {
+     if (/(context|token).(length|limit|maximum)|maximum context/.test(normalized)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!
