[Killed] StringLiteral
src/model-image-capability.ts:6:78
  * No prefix matching: glm-5.3-flash / future models must not inherit text-only facts.
  * Unknown capability stays unknown; absence of a vision flag is not proof of no vision.
  */
-const ZHIPU_TEXT_MODELS = new Set(["glm-4.6", "glm-4.7", "glm-5", "glm-5.2", "glm-5.3"]);
+const ZHIPU_TEXT_MODELS = new Set(["glm-4.6", "glm-4.7", "glm-5", "glm-5.2", ""]);
 
 export function modelSupportsImages(providerCode: string, upstreamModel: string): false | null {
killedBy: POOL20-054 image admission and lossless forwarding known text model glm-5.3 is gated, unrelated models remain unknown
statusReason: expected null to be false // Object.is equality

[Killed] BlockStatement
src/model-image-capability.ts:8:96
  */
 const ZHIPU_TEXT_MODELS = new Set(["glm-4.6", "glm-4.7", "glm-5", "glm-5.2", "glm-5.3"]);
 
-export function modelSupportsImages(providerCode: string, upstreamModel: string): false | null {
-  return providerCode === "zhipu" && ZHIPU_TEXT_MODELS.has(upstreamModel) ? false : null;
-}
+export function modelSupportsImages(providerCode: string, upstreamModel: string): false | null {}
 
 export const MODEL_IMAGE_UNSUPPORTED = "model_image_unsupported";
killedBy: POOL20-054 image admission and lossless forwarding known text model glm-4.6 is gated, unrelated models remain unknown
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/model-image-capability.ts:9:10
 const ZHIPU_TEXT_MODELS = new Set(["glm-4.6", "glm-4.7", "glm-5", "glm-5.2", "glm-5.3"]);
 
 export function modelSupportsImages(providerCode: string, upstreamModel: string): false | null {
-  return providerCode === "zhipu" && ZHIPU_TEXT_MODELS.has(upstreamModel) ? false : null;
+  return false ? false : null;
 }
 
killedBy: POOL20-054 image admission and lossless forwarding known text model glm-4.6 is gated, unrelated models remain unknown
statusReason: expected null to be false // Object.is equality

[Killed] ConditionalExpression
src/model-image-capability.ts:9:10
 const ZHIPU_TEXT_MODELS = new Set(["glm-4.6", "glm-4.7", "glm-5", "glm-5.2", "glm-5.3"]);
 
 export function modelSupportsImages(providerCode: string, upstreamModel: string): false | null {
-  return providerCode === "zhipu" && ZHIPU_TEXT_MODELS.has(upstreamModel) ? false : null;
+  return true ? false : null;
 }
 
killedBy: OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
statusReason: expected { status: 400, committed: false, …(2) } to match object { status: 200, committed: true }
(7 matching properties omitted from actual)

[Survived] BooleanLiteral
src/model-image-capability.ts:16:53
 export const IMAGE_INPUT_UNSUPPORTED = "image_input_unsupported";
 
 /** Inspect structured content only, never prompt text or tool schemas. References stay in memory. */
-function imageReferences(body: unknown, converted = false): Array<string | null> {
+function imageReferences(body: unknown, converted = true): Array<string | null> {
   const refs: Array<string | null> = [];
   const stack: unknown[] = [body];

[Killed] ConditionalExpression
src/model-image-capability.ts:19:10
 function imageReferences(body: unknown, converted = false): Array<string | null> {
   const refs: Array<string | null> = [];
   const stack: unknown[] = [body];
-  while (stack.length) {
+  while (false) {
     const value = stack.pop();
     if (Array.isArray(value)) { for (const child of value) stack.push(child); continue; }
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/model-image-capability.ts:21:9
   const stack: unknown[] = [body];
   while (stack.length) {
     const value = stack.pop();
-    if (Array.isArray(value)) { for (const child of value) stack.push(child); continue; }
+    if (false) { for (const child of value) stack.push(child); continue; }
     if (typeof value !== "object" || value === null) continue;
     const block = value as Record<string, unknown>;
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BlockStatement
src/model-image-capability.ts:21:31
   const stack: unknown[] = [body];
   while (stack.length) {
     const value = stack.pop();
-    if (Array.isArray(value)) { for (const child of value) stack.push(child); continue; }
+    if (Array.isArray(value)) {}
     if (typeof value !== "object" || value === null) continue;
     const block = value as Record<string, unknown>;
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
src/model-image-capability.ts:22:9
   while (stack.length) {
     const value = stack.pop();
     if (Array.isArray(value)) { for (const child of value) stack.push(child); continue; }
-    if (typeof value !== "object" || value === null) continue;
+    if (typeof value === "object" || value === null) continue;
     const block = value as Record<string, unknown>;
     // Tool arguments are application data, not multimodal message content.
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
src/model-image-capability.ts:22:38
   while (stack.length) {
     const value = stack.pop();
     if (Array.isArray(value)) { for (const child of value) stack.push(child); continue; }
-    if (typeof value !== "object" || value === null) continue;
+    if (typeof value !== "object" || value !== null) continue;
     const block = value as Record<string, unknown>;
     // Tool arguments are application data, not multimodal message content.
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/model-image-capability.ts:25:9
     if (typeof value !== "object" || value === null) continue;
     const block = value as Record<string, unknown>;
     // Tool arguments are application data, not multimodal message content.
-    if (block.type === "tool_use" || block.type === "function_call") continue;
+    if (true) continue;
     const object = (v: unknown): Record<string, unknown> =>
       typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
src/model-image-capability.ts:25:9
     if (typeof value !== "object" || value === null) continue;
     const block = value as Record<string, unknown>;
     // Tool arguments are application data, not multimodal message content.
-    if (block.type === "tool_use" || block.type === "function_call") continue;
+    if (block.type !== "tool_use" || block.type === "function_call") continue;
     const object = (v: unknown): Record<string, unknown> =>
       typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ArrowFunction
src/model-image-capability.ts:26:20
     const block = value as Record<string, unknown>;
     // Tool arguments are application data, not multimodal message content.
     if (block.type === "tool_use" || block.type === "function_call") continue;
-    const object = (v: unknown): Record<string, unknown> =>
-      typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
+    const object = () => undefined;
     if (block.type === "image_url") {
       const url = object(block.image_url).url;
killedBy: OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
statusReason: Cannot read properties of undefined (reading 'url')

[Killed] ConditionalExpression
src/model-image-capability.ts:27:7
     // Tool arguments are application data, not multimodal message content.
     if (block.type === "tool_use" || block.type === "function_call") continue;
     const object = (v: unknown): Record<string, unknown> =>
-      typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
+      false ? v as Record<string, unknown> : {};
     if (block.type === "image_url") {
       const url = object(block.image_url).url;
killedBy: OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
statusReason: expected { status: 400, committed: false, …(2) } to match object { status: 200, committed: true }
(7 matching properties omitted from actual)

[Killed] EqualityOperator
src/model-image-capability.ts:27:7
     // Tool arguments are application data, not multimodal message content.
     if (block.type === "tool_use" || block.type === "function_call") continue;
     const object = (v: unknown): Record<string, unknown> =>
-      typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
+      typeof v !== "object" && v !== null ? v as Record<string, unknown> : {};
     if (block.type === "image_url") {
       const url = object(block.image_url).url;
killedBy: POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/model-image-capability.ts:28:37
     if (block.type === "tool_use" || block.type === "function_call") continue;
     const object = (v: unknown): Record<string, unknown> =>
       typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
-    if (block.type === "image_url") {
-      const url = object(block.image_url).url;
-      refs.push(typeof url === "string" ? `url:${url}` : null);
-    } else if (block.type === "input_image") {
+    if (block.type === "image_url") {} else if (block.type === "input_image") {
       refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
         : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/model-image-capability.ts:28:9
     if (block.type === "tool_use" || block.type === "function_call") continue;
     const object = (v: unknown): Record<string, unknown> =>
       typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
-    if (block.type === "image_url") {
+    if (false) {
       const url = object(block.image_url).url;
       refs.push(typeof url === "string" ? `url:${url}` : null);
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/model-image-capability.ts:30:17
       typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
     if (block.type === "image_url") {
       const url = object(block.image_url).url;
-      refs.push(typeof url === "string" ? `url:${url}` : null);
+      refs.push(false ? `url:${url}` : null);
     } else if (block.type === "input_image") {
       refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
killedBy: POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/model-image-capability.ts:30:17
       typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
     if (block.type === "image_url") {
       const url = object(block.image_url).url;
-      refs.push(typeof url === "string" ? `url:${url}` : null);
+      refs.push(typeof url !== "string" ? `url:${url}` : null);
     } else if (block.type === "input_image") {
       refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
killedBy: POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/model-image-capability.ts:31:16
     if (block.type === "image_url") {
       const url = object(block.image_url).url;
       refs.push(typeof url === "string" ? `url:${url}` : null);
-    } else if (block.type === "input_image") {
+    } else if (false) {
       refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
         : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
killedBy: POOL20-054 image admission and lossless forwarding responses images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/model-image-capability.ts:31:16
     if (block.type === "image_url") {
       const url = object(block.image_url).url;
       refs.push(typeof url === "string" ? `url:${url}` : null);
-    } else if (block.type === "input_image") {
+    } else if (true) {
       refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
         : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
killedBy: POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/model-image-capability.ts:32:17
       const url = object(block.image_url).url;
       refs.push(typeof url === "string" ? `url:${url}` : null);
     } else if (block.type === "input_image") {
-      refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
+      refs.push(true ? `url:${block.image_url}`
         : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
     } else if (block.type === "image") {
killedBy: POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/model-image-capability.ts:32:17
       const url = object(block.image_url).url;
       refs.push(typeof url === "string" ? `url:${url}` : null);
     } else if (block.type === "input_image") {
-      refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
+      refs.push(false ? `url:${block.image_url}`
         : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
     } else if (block.type === "image") {
killedBy: POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/model-image-capability.ts:33:11
       refs.push(typeof url === "string" ? `url:${url}` : null);
     } else if (block.type === "input_image") {
       refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
-        : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
+        : typeof block.file_id !== "string" ? `file:${block.file_id}` : null);
     } else if (block.type === "image") {
       const source = object(block.source);
killedBy: POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/model-image-capability.ts:33:11
       refs.push(typeof url === "string" ? `url:${url}` : null);
     } else if (block.type === "input_image") {
       refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
-        : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
+        : false ? `file:${block.file_id}` : null);
     } else if (block.type === "image") {
       const source = object(block.source);
killedBy: POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/model-image-capability.ts:34:40
     } else if (block.type === "input_image") {
       refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
         : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
-    } else if (block.type === "image") {
-      const source = object(block.source);
-      refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
-        ? `url:data:${source.media_type};base64,${source.data}`
-        : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
-        : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
-    } else if (converted && block.type === "file" && typeof block.file_id === "string") {
+    } else if (block.type === "image") {} else if (converted && block.type === "file" && typeof block.file_id === "string") {
       refs.push(`file:${block.file_id}`);
     }
killedBy: POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/model-image-capability.ts:34:16
     } else if (block.type === "input_image") {
       refs.push(typeof block.image_url === "string" ? `url:${block.image_url}`
         : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
-    } else if (block.type === "image") {
+    } else if (true) {
       const source = object(block.source);
       refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
killedBy: POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/model-image-capability.ts:36:17
         : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
     } else if (block.type === "image") {
       const source = object(block.source);
-      refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
+      refs.push(true
         ? `url:data:${source.media_type};base64,${source.data}`
         : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
killedBy: POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/model-image-capability.ts:36:86
         : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
     } else if (block.type === "image") {
       const source = object(block.source);
-      refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
+      refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data !== "string"
         ? `url:data:${source.media_type};base64,${source.data}`
         : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
killedBy: POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/model-image-capability.ts:38:11
       const source = object(block.source);
       refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
         ? `url:data:${source.media_type};base64,${source.data}`
-        : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
+        : false ? `url:${source.url}`
         : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
     } else if (converted && block.type === "file" && typeof block.file_id === "string") {
killedBy: POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/model-image-capability.ts:38:36
       const source = object(block.source);
       refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
         ? `url:data:${source.media_type};base64,${source.data}`
-        : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
+        : source.type === "url" && typeof source.url !== "string" ? `url:${source.url}`
         : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
     } else if (converted && block.type === "file" && typeof block.file_id === "string") {
killedBy: POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[NoCoverage] ConditionalExpression
src/model-image-capability.ts:39:11
       refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
         ? `url:data:${source.media_type};base64,${source.data}`
         : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
-        : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+        : false ? `file:${source.file_id}` : null);
     } else if (converted && block.type === "file" && typeof block.file_id === "string") {
       refs.push(`file:${block.file_id}`);

[NoCoverage] EqualityOperator
src/model-image-capability.ts:39:11
       refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
         ? `url:data:${source.media_type};base64,${source.data}`
         : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
-        : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+        : source.type !== "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
     } else if (converted && block.type === "file" && typeof block.file_id === "string") {
       refs.push(`file:${block.file_id}`);

[Killed] ConditionalExpression
src/model-image-capability.ts:40:16
         ? `url:data:${source.media_type};base64,${source.data}`
         : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
         : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
-    } else if (converted && block.type === "file" && typeof block.file_id === "string") {
+    } else if (true) {
       refs.push(`file:${block.file_id}`);
     }
killedBy: POOL20-054 image admission and lossless forwarding tool arguments that look like image blocks are not multimodal input
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/model-image-capability.ts:40:54
         ? `url:data:${source.media_type};base64,${source.data}`
         : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
         : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
-    } else if (converted && block.type === "file" && typeof block.file_id === "string") {
+    } else if (converted && block.type === "file" && typeof block.file_id !== "string") {
       refs.push(`file:${block.file_id}`);
     }
killedBy: POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/model-image-capability.ts:43:97
     } else if (converted && block.type === "file" && typeof block.file_id === "string") {
       refs.push(`file:${block.file_id}`);
     }
-    for (const key of ["messages", "input", "content", "output", "system", "responsesRequest"]) {
-      if (typeof block[key] === "object" && block[key] !== null) stack.push(block[key]);
-    }
+    for (const key of ["messages", "input", "content", "output", "system", "responsesRequest"]) {}
   }
   return refs;
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] StringLiteral
src/model-image-capability.ts:43:24
     } else if (converted && block.type === "file" && typeof block.file_id === "string") {
       refs.push(`file:${block.file_id}`);
     }
-    for (const key of ["messages", "input", "content", "output", "system", "responsesRequest"]) {
+    for (const key of ["", "input", "content", "output", "system", "responsesRequest"]) {
       if (typeof block[key] === "object" && block[key] !== null) stack.push(block[key]);
     }
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
src/model-image-capability.ts:44:45
       refs.push(`file:${block.file_id}`);
     }
     for (const key of ["messages", "input", "content", "output", "system", "responsesRequest"]) {
-      if (typeof block[key] === "object" && block[key] !== null) stack.push(block[key]);
+      if (typeof block[key] === "object" && block[key] === null) stack.push(block[key]);
     }
   }
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/model-image-capability.ts:44:11
       refs.push(`file:${block.file_id}`);
     }
     for (const key of ["messages", "input", "content", "output", "system", "responsesRequest"]) {
-      if (typeof block[key] === "object" && block[key] !== null) stack.push(block[key]);
+      if (false) stack.push(block[key]);
     }
   }
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/model-image-capability.ts:50:64
   return refs;
 }
 
-export function hasImageInput(body: unknown): boolean { return imageReferences(body).length > 0; }
+export function hasImageInput(body: unknown): boolean { return false; }
 
 /** Fail explicitly if conversion cannot represent any image; never silently send the text alone. */
killedBy: POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
src/model-image-capability.ts:50:64
   return refs;
 }
 
-export function hasImageInput(body: unknown): boolean { return imageReferences(body).length > 0; }
+export function hasImageInput(body: unknown): boolean { return imageReferences(body).length >= 0; }
 
 /** Fail explicitly if conversion cannot represent any image; never silently send the text alone. */
killedBy: POOL20-054 image admission and lossless forwarding tool arguments that look like image blocks are not multimodal input
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/model-image-capability.ts:53:86
 export function hasImageInput(body: unknown): boolean { return imageReferences(body).length > 0; }
 
 /** Fail explicitly if conversion cannot represent any image; never silently send the text alone. */
-export function preservesImageInputs(original: unknown, converted: unknown): boolean {
-  const available = new Map<string | null, number>();
-  for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) + 1);
-  for (const ref of imageReferences(original)) {
-    const count = available.get(ref) ?? 0;
-    if (ref === null || count === 0) return false;
-    available.set(ref, count - 1);
-  }
-  return true;
-}
+export function preservesImageInputs(original: unknown, converted: unknown): boolean {}
 
killedBy: POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times
