[Killed] BooleanLiteral
src/model-image-capability.ts:55:48
 /** Fail explicitly if conversion cannot represent any image; never silently send the text alone. */
 export function preservesImageInputs(original: unknown, converted: unknown): boolean {
   const available = new Map<string | null, number>();
-  for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) + 1);
+  for (const ref of imageReferences(converted, false)) available.set(ref, (available.get(ref) ?? 0) + 1);
   for (const ref of imageReferences(original)) {
     const count = available.get(ref) ?? 0;
killedBy: POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] LogicalOperator
src/model-image-capability.ts:55:75
 /** Fail explicitly if conversion cannot represent any image; never silently send the text alone. */
 export function preservesImageInputs(original: unknown, converted: unknown): boolean {
   const available = new Map<string | null, number>();
-  for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) + 1);
+  for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) && 0) + 1);
   for (const ref of imageReferences(original)) {
     const count = available.get(ref) ?? 0;

[Killed] BlockStatement
src/model-image-capability.ts:56:48
 export function preservesImageInputs(original: unknown, converted: unknown): boolean {
   const available = new Map<string | null, number>();
   for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) + 1);
-  for (const ref of imageReferences(original)) {
-    const count = available.get(ref) ?? 0;
-    if (ref === null || count === 0) return false;
-    available.set(ref, count - 1);
-  }
+  for (const ref of imageReferences(original)) {}
   return true;
 }
killedBy: POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] LogicalOperator
src/model-image-capability.ts:57:19
   const available = new Map<string | null, number>();
   for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) + 1);
   for (const ref of imageReferences(original)) {
-    const count = available.get(ref) ?? 0;
+    const count = available.get(ref) && 0;
     if (ref === null || count === 0) return false;
     available.set(ref, count - 1);
killedBy: POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/model-image-capability.ts:58:45
   for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) + 1);
   for (const ref of imageReferences(original)) {
     const count = available.get(ref) ?? 0;
-    if (ref === null || count === 0) return false;
+    if (ref === null || count === 0) return true;
     available.set(ref, count - 1);
   }
killedBy: POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
src/model-image-capability.ts:58:25
   for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) + 1);
   for (const ref of imageReferences(original)) {
     const count = available.get(ref) ?? 0;
-    if (ref === null || count === 0) return false;
+    if (ref === null || count !== 0) return false;
     available.set(ref, count - 1);
   }
killedBy: POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] ArithmeticOperator
src/model-image-capability.ts:59:24
   for (const ref of imageReferences(original)) {
     const count = available.get(ref) ?? 0;
     if (ref === null || count === 0) return false;
-    available.set(ref, count - 1);
+    available.set(ref, count + 1);
   }
   return true;
