[NoCoverage] ConditionalExpression
src/model-image-capability.ts:39:11
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : true ? `file:${source.file_id}` : null);

[NoCoverage] ConditionalExpression
src/model-image-capability.ts:39:11
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : false ? `file:${source.file_id}` : null);

[NoCoverage] LogicalOperator
src/model-image-capability.ts:39:11
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : source.type === "file" || typeof source.file_id === "string" ? `file:${source.file_id}` : null);

[NoCoverage] ConditionalExpression
src/model-image-capability.ts:39:11
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : true && typeof source.file_id === "string" ? `file:${source.file_id}` : null);

[NoCoverage] EqualityOperator
src/model-image-capability.ts:39:11
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : source.type !== "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);

[NoCoverage] StringLiteral
src/model-image-capability.ts:39:27
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : source.type === "" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);

[NoCoverage] ConditionalExpression
src/model-image-capability.ts:39:37
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : source.type === "file" && true ? `file:${source.file_id}` : null);

[NoCoverage] EqualityOperator
src/model-image-capability.ts:39:37
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : source.type === "file" && typeof source.file_id !== "string" ? `file:${source.file_id}` : null);

[NoCoverage] StringLiteral
src/model-image-capability.ts:39:63
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : source.type === "file" && typeof source.file_id === "" ? `file:${source.file_id}` : null);

[NoCoverage] StringLiteral
src/model-image-capability.ts:39:74
-           : source.type === "file" && typeof source.file_id === "string" ? `file:${source.file_id}` : null);
+           : source.type === "file" && typeof source.file_id === "string" ? `` : null);

[Survived] BooleanLiteral
src/model-image-capability.ts:16:53
-   function imageReferences(body: unknown, converted = false): Array<string | null> {
+   function imageReferences(body: unknown, converted = true): Array<string | null> {
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:22:9
-       if (typeof value !== "object" || value === null) continue;
+       if (false) continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] LogicalOperator
src/model-image-capability.ts:22:9
-       if (typeof value !== "object" || value === null) continue;
+       if (typeof value !== "object" && value === null) continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:22:9
-       if (typeof value !== "object" || value === null) continue;
+       if (false || value === null) continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:22:38
-       if (typeof value !== "object" || value === null) continue;
+       if (typeof value !== "object" || false) continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:25:38
-       if (block.type === "tool_use" || block.type === "function_call") continue;
+       if (block.type === "tool_use" || false) continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:25:53
-       if (block.type === "tool_use" || block.type === "function_call") continue;
+       if (block.type === "tool_use" || block.type === "") continue;
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:27:7
-         typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
+         true ? v as Record<string, unknown> : {};
Tests ran:
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
    POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
  and 4 more tests!

[Survived] LogicalOperator
src/model-image-capability.ts:27:7
-         typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
+         typeof v === "object" || v !== null ? v as Record<string, unknown> : {};
Tests ran:
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
    POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
  and 4 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:27:7
-         typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
+         true && v !== null ? v as Record<string, unknown> : {};
Tests ran:
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
    POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
  and 4 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:27:32
-         typeof v === "object" && v !== null ? v as Record<string, unknown> : {};
+         typeof v === "object" && true ? v as Record<string, unknown> : {};
Tests ran:
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
    POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
  and 4 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:30:17
-         refs.push(typeof url === "string" ? `url:${url}` : null);
+         refs.push(true ? `url:${url}` : null);
Tests ran:
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
    POOL20-054 image admission and lossless forwarding chat images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
  and 2 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:33:11
-           : typeof block.file_id === "string" ? `file:${block.file_id}` : null);
+           : true ? `file:${block.file_id}` : null);
Tests ran:
    POOL20-054 image admission and lossless forwarding responses images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only

[Survived] LogicalOperator
src/model-image-capability.ts:36:17
-         refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
+         refs.push(source.type === "base64" && typeof source.media_type === "string" || typeof source.data === "string"
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it

[Survived] ConditionalExpression
src/model-image-capability.ts:36:17
-         refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
+         refs.push(true && typeof source.data === "string"
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it

[Survived] LogicalOperator
src/model-image-capability.ts:36:17
-         refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
+         refs.push(source.type === "base64" || typeof source.media_type === "string" && typeof source.data === "string"
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it

[Survived] ConditionalExpression
src/model-image-capability.ts:36:17
-         refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
+         refs.push(true && typeof source.media_type === "string" && typeof source.data === "string"
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it

[Survived] ConditionalExpression
src/model-image-capability.ts:36:45
-         refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
+         refs.push(source.type === "base64" && true && typeof source.data === "string"
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only

[Survived] ConditionalExpression
src/model-image-capability.ts:36:86
-         refs.push(source.type === "base64" && typeof source.media_type === "string" && typeof source.data === "string"
+         refs.push(source.type === "base64" && typeof source.media_type === "string" && true
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only

[Survived] ConditionalExpression
src/model-image-capability.ts:38:11
-           : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
+           : true ? `url:${source.url}`
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it

[Survived] LogicalOperator
src/model-image-capability.ts:38:11
-           : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
+           : source.type === "url" || typeof source.url === "string" ? `url:${source.url}`
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it

[Survived] ConditionalExpression
src/model-image-capability.ts:38:11
-           : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
+           : true && typeof source.url === "string" ? `url:${source.url}`
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it

[Survived] ConditionalExpression
src/model-image-capability.ts:38:36
-           : source.type === "url" && typeof source.url === "string" ? `url:${source.url}`
+           : source.type === "url" && true ? `url:${source.url}`
Tests ran:
    POOL20-054 image admission and lossless forwarding messages images never call a known text-only upstream
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding unrepresentable image in a tool result fails explicitly rather than dropping it

[Survived] LogicalOperator
src/model-image-capability.ts:40:16
-       } else if (converted && block.type === "file" && typeof block.file_id === "string") {
+       } else if (converted && block.type === "file" || typeof block.file_id === "string") {
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:40:16
-       } else if (converted && block.type === "file" && typeof block.file_id === "string") {
+       } else if (true && typeof block.file_id === "string") {
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] LogicalOperator
src/model-image-capability.ts:40:16
-       } else if (converted && block.type === "file" && typeof block.file_id === "string") {
+       } else if (converted || block.type === "file" && typeof block.file_id === "string") {
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:40:29
-       } else if (converted && block.type === "file" && typeof block.file_id === "string") {
+       } else if (converted && true && typeof block.file_id === "string") {
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 42 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:40:54
-       } else if (converted && block.type === "file" && typeof block.file_id === "string") {
+       } else if (converted && block.type === "file" && true) {
Tests ran:
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only

[Survived] StringLiteral
src/model-image-capability.ts:43:56
-       for (const key of ["messages", "input", "content", "output", "system", "responsesRequest"]) {
+       for (const key of ["messages", "input", "content", "", "system", "responsesRequest"]) {
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:43:66
-       for (const key of ["messages", "input", "content", "output", "system", "responsesRequest"]) {
+       for (const key of ["messages", "input", "content", "output", "", "responsesRequest"]) {
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] StringLiteral
src/model-image-capability.ts:43:76
-       for (const key of ["messages", "input", "content", "output", "system", "responsesRequest"]) {
+       for (const key of ["messages", "input", "content", "output", "system", ""]) {
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:44:11
-         if (typeof block[key] === "object" && block[key] !== null) stack.push(block[key]);
+         if (true) stack.push(block[key]);
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] LogicalOperator
src/model-image-capability.ts:44:11
-         if (typeof block[key] === "object" && block[key] !== null) stack.push(block[key]);
+         if (typeof block[key] === "object" || block[key] !== null) stack.push(block[key]);
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:44:11
-         if (typeof block[key] === "object" && block[key] !== null) stack.push(block[key]);
+         if (true && block[key] !== null) stack.push(block[key]);
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ConditionalExpression
src/model-image-capability.ts:44:45
-         if (typeof block[key] === "object" && block[key] !== null) stack.push(block[key]);
+         if (typeof block[key] === "object" && true) stack.push(block[key]);
Tests ran:
    OpenAI-compatible HTTP caller 非流式非法 JSON 与流式空 body 分别归一化为协议失败
    OpenAI-compatible HTTP caller 非流式真实 HTTP 载荷使用资源模型和凭证，并把 tool_calls/usage 转回 Responses
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
  and 47 more tests!

[Survived] ArithmeticOperator
src/model-image-capability.ts:55:74
-     for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) + 1);
+     for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) - 1);
Tests ran:
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
  and 1 more test!

[Survived] LogicalOperator
src/model-image-capability.ts:55:75
-     for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) ?? 0) + 1);
+     for (const ref of imageReferences(converted, true)) available.set(ref, (available.get(ref) && 0) + 1);
Tests ran:
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
  and 1 more test!

[Survived] ConditionalExpression
src/model-image-capability.ts:58:9
-       if (ref === null || count === 0) return false;
+       if (false || count === 0) return false;
Tests ran:
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
  and 2 more tests!

[Survived] ArithmeticOperator
src/model-image-capability.ts:59:24
-       available.set(ref, count - 1);
+       available.set(ref, count + 1);
Tests ran:
    OpenAI-compatible HTTP caller Kimi K3 回归：保留 reasoning_effort、图片和工具，剔除不支持的 thinking/tool_stream
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
  and 1 more test!

[NoCoverage] StringLiteral
src/upstream-error-evidence.ts:56:72
-       if (/(?:上下文|token)[^。\n]{0,40}(?:超出|超过|上限)/i.test(message)) return "CONTEXT_LENGTH_EXCEEDED";
+       if (/(?:上下文|token)[^。\n]{0,40}(?:超出|超过|上限)/i.test(message)) return "";

[NoCoverage] StringLiteral
src/upstream-error-evidence.ts:60:73
-       if (/(?:参数|字段)[^。\n]{0,40}(?:有误|非法|无效|错误|缺失)/.test(message)) return "INVALID_PARAMETER";
+       if (/(?:参数|字段)[^。\n]{0,40}(?:有误|非法|无效|错误|缺失)/.test(message)) return "";

[NoCoverage] BlockStatement
src/upstream-error-evidence.ts:62:83
-     if (/(context|token).*(length|limit|maximum)|maximum context/.test(normalized)) {
-       return "CONTEXT_LENGTH_EXCEEDED";
-     }
+     if (/(context|token).*(length|limit|maximum)|maximum context/.test(normalized)) {}

[NoCoverage] StringLiteral
src/upstream-error-evidence.ts:63:12
-       return "CONTEXT_LENGTH_EXCEEDED";
+       return "";

[NoCoverage] BlockStatement
src/upstream-error-evidence.ts:68:103
-     if (/(message|content|image|attachment).*(invalid|unsupported|expected|required)/.test(normalized)) {
-       return "INVALID_MESSAGE_CONTENT";
-     }
+     if (/(message|content|image|attachment).*(invalid|unsupported|expected|required)/.test(normalized)) {}

[NoCoverage] StringLiteral
src/upstream-error-evidence.ts:69:12
-       return "INVALID_MESSAGE_CONTENT";
+       return "";

[NoCoverage] BlockStatement
src/upstream-error-evidence.ts:71:84
-     if (/unsupported.*(parameter|field)|unknown (parameter|field)/.test(normalized)) {
-       return "UNSUPPORTED_PARAMETER";
-     }
+     if (/unsupported.*(parameter|field)|unknown (parameter|field)/.test(normalized)) {}

[NoCoverage] StringLiteral
src/upstream-error-evidence.ts:72:12
-       return "UNSUPPORTED_PARAMETER";
+       return "";

[NoCoverage] BlockStatement
src/upstream-error-evidence.ts:77:87
-     if (/(model).*(not found|unavailable|unsupported|does not exist)/.test(normalized)) {
-       return "MODEL_UNAVAILABLE";
-     }
+     if (/(model).*(not found|unavailable|unsupported|does not exist)/.test(normalized)) {}

[NoCoverage] StringLiteral
src/upstream-error-evidence.ts:78:12
-       return "MODEL_UNAVAILABLE";
+       return "";

[Survived] Regex
src/upstream-error-evidence.ts:50:7
-     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
+     if (/model[^.。\n](?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:50:7
-     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
+     if (/model[.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:50:7
-     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
+     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n](?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:50:7
-     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
+     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!
