[Survived] Regex
src/upstream-error-evidence.ts:50:7
-     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
+     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n](?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:50:7
-     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
+     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:50:7
-     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
+     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]model/.test(normalized)
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:50:7
-     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[^.。\n]{0,60}model/.test(normalized)
+     if (/model[^.。\n]{0,100}(?:does not support|doesn't support|cannot (?:process|accept))[^.。\n]{0,50}(?:image|vision)|(?:image|vision)[^.。\n]{0,60}(?:not supported|unsupported)[.。\n]{0,60}model/.test(normalized)
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:51:8
-       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[^。\n]{0,30}模型/.test(message)) {
+       || /模型[。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[^。\n]{0,30}模型/.test(message)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:51:8
-       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[^。\n]{0,30}模型/.test(message)) {
+       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[^。\n]{0,30}模型/.test(message)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:51:8
-       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[^。\n]{0,30}模型/.test(message)) {
+       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]不支持[^。\n]{0,30}模型/.test(message)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:51:8
-       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[^。\n]{0,30}模型/.test(message)) {
+       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[。\n]{0,30}不支持[^。\n]{0,30}模型/.test(message)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:51:8
-       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[^。\n]{0,30}模型/.test(message)) {
+       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[^。\n]模型/.test(message)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:51:8
-       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[^。\n]{0,30}模型/.test(message)) {
+       || /模型[^。\n]{0,60}(?:不支持|无法处理|不能处理)[^。\n]{0,30}(?:图片|图像|视觉)|(?:图片|图像)[^。\n]{0,30}不支持[。\n]{0,30}模型/.test(message)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 18 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:54:7
-     if (providerCode === "zhipu") {
+     if (true) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 12 more tests!

[Survived] LogicalOperator
src/upstream-error-evidence.ts:55:9
-       if (/模型[^。\n]{0,30}(?:不存在|不可用)/.test(message) || code === "1211") return "MODEL_UNAVAILABLE";
+       if (/模型[^。\n]{0,30}(?:不存在|不可用)/.test(message) && code === "1211") return "MODEL_UNAVAILABLE";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 5 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:55:9
-       if (/模型[^。\n]{0,30}(?:不存在|不可用)/.test(message) || code === "1211") return "MODEL_UNAVAILABLE";
+       if (/模型[^。\n](?:不存在|不可用)/.test(message) || code === "1211") return "MODEL_UNAVAILABLE";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 5 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:55:9
-       if (/模型[^。\n]{0,30}(?:不存在|不可用)/.test(message) || code === "1211") return "MODEL_UNAVAILABLE";
+       if (/模型[。\n]{0,30}(?:不存在|不可用)/.test(message) || code === "1211") return "MODEL_UNAVAILABLE";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 5 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:55:54
-       if (/模型[^。\n]{0,30}(?:不存在|不可用)/.test(message) || code === "1211") return "MODEL_UNAVAILABLE";
+       if (/模型[^。\n]{0,30}(?:不存在|不可用)/.test(message) || false) return "MODEL_UNAVAILABLE";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 4 more tests!

[Survived] StringLiteral
src/upstream-error-evidence.ts:55:63
-       if (/模型[^。\n]{0,30}(?:不存在|不可用)/.test(message) || code === "1211") return "MODEL_UNAVAILABLE";
+       if (/模型[^。\n]{0,30}(?:不存在|不可用)/.test(message) || code === "") return "MODEL_UNAVAILABLE";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 4 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:56:9
-       if (/(?:上下文|token)[^。\n]{0,40}(?:超出|超过|上限)/i.test(message)) return "CONTEXT_LENGTH_EXCEEDED";
+       if (false) return "CONTEXT_LENGTH_EXCEEDED";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 4 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:56:9
-       if (/(?:上下文|token)[^。\n]{0,40}(?:超出|超过|上限)/i.test(message)) return "CONTEXT_LENGTH_EXCEEDED";
+       if (/(?:上下文|token)[^。\n](?:超出|超过|上限)/i.test(message)) return "CONTEXT_LENGTH_EXCEEDED";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 4 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:56:9
-       if (/(?:上下文|token)[^。\n]{0,40}(?:超出|超过|上限)/i.test(message)) return "CONTEXT_LENGTH_EXCEEDED";
+       if (/(?:上下文|token)[。\n]{0,40}(?:超出|超过|上限)/i.test(message)) return "CONTEXT_LENGTH_EXCEEDED";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 4 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:59:9
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (true) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 3 more tests!

[Survived] LogicalOperator
src/upstream-error-evidence.ts:59:9
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (code !== null || ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 3 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:59:9
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (true && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 3 more tests!

[Survived] StringLiteral
src/upstream-error-evidence.ts:59:27
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (code !== null && ["", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 2 more tests!

[Survived] StringLiteral
src/upstream-error-evidence.ts:59:43
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (code !== null && ["1210", "1212", "", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 2 more tests!

[Survived] StringLiteral
src/upstream-error-evidence.ts:59:51
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (code !== null && ["1210", "1212", "1213", "", "1215"].includes(code)) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 2 more tests!

[Survived] StringLiteral
src/upstream-error-evidence.ts:59:59
-       if (code !== null && ["1210", "1212", "1213", "1214", "1215"].includes(code)) return "INVALID_PARAMETER";
+       if (code !== null && ["1210", "1212", "1213", "1214", ""].includes(code)) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 2 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:60:9
-       if (/(?:参数|字段)[^。\n]{0,40}(?:有误|非法|无效|错误|缺失)/.test(message)) return "INVALID_PARAMETER";
+       if (true) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 1 more test!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:60:9
-       if (/(?:参数|字段)[^。\n]{0,40}(?:有误|非法|无效|错误|缺失)/.test(message)) return "INVALID_PARAMETER";
+       if (false) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 1 more test!

[Survived] Regex
src/upstream-error-evidence.ts:60:9
-       if (/(?:参数|字段)[^。\n]{0,40}(?:有误|非法|无效|错误|缺失)/.test(message)) return "INVALID_PARAMETER";
+       if (/(?:参数|字段)[^。\n](?:有误|非法|无效|错误|缺失)/.test(message)) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 1 more test!

[Survived] Regex
src/upstream-error-evidence.ts:60:9
-       if (/(?:参数|字段)[^。\n]{0,40}(?:有误|非法|无效|错误|缺失)/.test(message)) return "INVALID_PARAMETER";
+       if (/(?:参数|字段)[。\n]{0,40}(?:有误|非法|无效|错误|缺失)/.test(message)) return "INVALID_PARAMETER";
Tests ran:
    POOL20-054 image admission and lossless forwarding chat unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding messages unknown model retains its images instead of being rejected as text-only
    POOL20-054 image admission and lossless forwarding responses unknown model retains its images instead of being rejected as text-only
  and 1 more test!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:62:7
-     if (/(context|token).*(length|limit|maximum)|maximum context/.test(normalized)) {
+     if (false) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 8 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:62:7
-     if (/(context|token).*(length|limit|maximum)|maximum context/.test(normalized)) {
+     if (/(context|token).(length|limit|maximum)|maximum context/.test(normalized)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 8 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:65:7
-     if (/(tool|function).*(schema|parameters?|definition)|invalid.*(tool|function)/.test(normalized)) {
+     if (/(tool|function).(schema|parameters?|definition)|invalid.*(tool|function)/.test(normalized)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 8 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:65:7
-     if (/(tool|function).*(schema|parameters?|definition)|invalid.*(tool|function)/.test(normalized)) {
+     if (/(tool|function).*(schema|parameters|definition)|invalid.*(tool|function)/.test(normalized)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 8 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:65:7
-     if (/(tool|function).*(schema|parameters?|definition)|invalid.*(tool|function)/.test(normalized)) {
+     if (/(tool|function).*(schema|parameters?|definition)|invalid.(tool|function)/.test(normalized)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 8 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:68:7
-     if (/(message|content|image|attachment).*(invalid|unsupported|expected|required)/.test(normalized)) {
+     if (false) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 7 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:68:7
-     if (/(message|content|image|attachment).*(invalid|unsupported|expected|required)/.test(normalized)) {
+     if (/(message|content|image|attachment).(invalid|unsupported|expected|required)/.test(normalized)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 7 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:71:7
-     if (/unsupported.*(parameter|field)|unknown (parameter|field)/.test(normalized)) {
+     if (false) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 7 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:71:7
-     if (/unsupported.*(parameter|field)|unknown (parameter|field)/.test(normalized)) {
+     if (/unsupported.(parameter|field)|unknown (parameter|field)/.test(normalized)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 7 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:74:7
-     if (/invalid (value|parameter|field)|expected .* (for|at)/.test(normalized)) {
+     if (/invalid (value|parameter|field)|expected . (for|at)/.test(normalized)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 7 more tests!

[Survived] ConditionalExpression
src/upstream-error-evidence.ts:77:7
-     if (/(model).*(not found|unavailable|unsupported|does not exist)/.test(normalized)) {
+     if (false) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 4 more tests!

[Survived] Regex
src/upstream-error-evidence.ts:77:7
-     if (/(model).*(not found|unavailable|unsupported|does not exist)/.test(normalized)) {
+     if (/(model).(not found|unavailable|unsupported|does not exist)/.test(normalized)) {
Tests ran:
    OpenAI-compatible HTTP caller 400 诊断不记录推理正文，并只反映实际发往 DeepSeek 的顶层字段
    OpenAI-compatible HTTP caller POOL20-048：Messages 转换后的 400 生成脱敏证据与工具 Schema issue
    OpenAI-compatible HTTP caller POOL20-048：非 JSON 400 生成通用诊断，未知 code/type 不落 Outcome
  and 4 more tests!
