[Killed] ConditionalExpression
src/pipeline/attempt-usage-settlement.ts:200:7
   input: FinalizeFailedRequestFromPersistedFactsInput,
 ): Promise<boolean> {
   const lines = await input.ledgerRepo.listLedgerLines(input.requestId);
-  if (lines.length === 0) return false;
+  if (true) return false;
   const attempts = await input.ledgerRepo.listAttempts(input.requestId);
   const pricing = summarizePricingEvidence(lines);
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/pipeline/attempt-usage-settlement.ts:200:7
   input: FinalizeFailedRequestFromPersistedFactsInput,
 ): Promise<boolean> {
   const lines = await input.ledgerRepo.listLedgerLines(input.requestId);
-  if (lines.length === 0) return false;
+  if (lines.length !== 0) return false;
   const attempts = await input.ledgerRepo.listAttempts(input.requestId);
   const pricing = summarizePricingEvidence(lines);
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/pipeline/attempt-usage-settlement.ts:203:59
   if (lines.length === 0) return false;
   const attempts = await input.ledgerRepo.listAttempts(input.requestId);
   const pricing = summarizePricingEvidence(lines);
-  await input.ledgerRepo.finalizeLedgerSettlementIfAbsent({
-    ai_request_id: input.requestId,
-    enterprise_id: input.enterpriseId,
-    principal_id: input.principalId,
-    total_input_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_input_tokens), 0n),
-    total_output_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_output_tokens), 0n),
-    total_cache_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_cache_tokens), 0n),
-    total_reasoning_tokens: lines.reduce(
-      (sum, line) => sum + BigInt(line.raw_reasoning_tokens), 0n,
-    ),
-    total_deducted_quota: lines.reduce(
-      (sum, line) => sum + BigInt(line.deducted_quota ?? 0), 0n,
-    ),
-    total_api_cost: pricing.actualCost ?? "0.00000000",
-    usage_quality: summarizeLedgerUsageQuality(lines),
-    attempt_count: attempts.length,
-    overage: input.overage ?? false,
-    request_status: "FAILED",
-    error_classification: input.errorClassification,
-    error_code: input.errorCode,
-    quota_settlements: input.quotaSettlements,
-    release_lease_ids: input.releaseLeaseIds,
-  });
+  await input.ledgerRepo.finalizeLedgerSettlementIfAbsent({});
   return true;
 }
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ArithmeticOperator
src/pipeline/attempt-usage-settlement.ts:207:53
     ai_request_id: input.requestId,
     enterprise_id: input.enterpriseId,
     principal_id: input.principalId,
-    total_input_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_input_tokens), 0n),
+    total_input_tokens: lines.reduce((sum, line) => sum - BigInt(line.raw_input_tokens), 0n),
     total_output_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_output_tokens), 0n),
     total_cache_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_cache_tokens), 0n),
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ArrowFunction
src/pipeline/attempt-usage-settlement.ts:207:38
     ai_request_id: input.requestId,
     enterprise_id: input.enterpriseId,
     principal_id: input.principalId,
-    total_input_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_input_tokens), 0n),
+    total_input_tokens: lines.reduce(() => undefined, 0n),
     total_output_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_output_tokens), 0n),
     total_cache_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_cache_tokens), 0n),
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ArrowFunction
src/pipeline/attempt-usage-settlement.ts:208:39
     enterprise_id: input.enterpriseId,
     principal_id: input.principalId,
     total_input_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_input_tokens), 0n),
-    total_output_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_output_tokens), 0n),
+    total_output_tokens: lines.reduce(() => undefined, 0n),
     total_cache_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_cache_tokens), 0n),
     total_reasoning_tokens: lines.reduce(
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ArithmeticOperator
src/pipeline/attempt-usage-settlement.ts:208:54
     enterprise_id: input.enterpriseId,
     principal_id: input.principalId,
     total_input_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_input_tokens), 0n),
-    total_output_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_output_tokens), 0n),
+    total_output_tokens: lines.reduce((sum, line) => sum - BigInt(line.raw_output_tokens), 0n),
     total_cache_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_cache_tokens), 0n),
     total_reasoning_tokens: lines.reduce(
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ArithmeticOperator
src/pipeline/attempt-usage-settlement.ts:209:53
     principal_id: input.principalId,
     total_input_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_input_tokens), 0n),
     total_output_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_output_tokens), 0n),
-    total_cache_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_cache_tokens), 0n),
+    total_cache_tokens: lines.reduce((sum, line) => sum - BigInt(line.raw_cache_tokens), 0n),
     total_reasoning_tokens: lines.reduce(
       (sum, line) => sum + BigInt(line.raw_reasoning_tokens), 0n,
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

@@ -1,17 +1,19 @@
  [

[Killed] ArrowFunction
src/pipeline/attempt-usage-settlement.ts:209:38
     principal_id: input.principalId,
     total_input_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_input_tokens), 0n),
     total_output_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_output_tokens), 0n),
-    total_cache_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_cache_tokens), 0n),
+    total_cache_tokens: lines.reduce(() => undefined, 0n),
     total_reasoning_tokens: lines.reduce(
       (sum, line) => sum + BigInt(line.raw_reasoning_tokens), 0n,
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

@@ -1,17 +1,19 @@
  [

[Killed] ArithmeticOperator
src/pipeline/attempt-usage-settlement.ts:211:22
     total_output_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_output_tokens), 0n),
     total_cache_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_cache_tokens), 0n),
     total_reasoning_tokens: lines.reduce(
-      (sum, line) => sum + BigInt(line.raw_reasoning_tokens), 0n,
+      (sum, line) => sum - BigInt(line.raw_reasoning_tokens), 0n,
     ),
     total_deducted_quota: lines.reduce(
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ArrowFunction
src/pipeline/attempt-usage-settlement.ts:211:7
     total_output_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_output_tokens), 0n),
     total_cache_tokens: lines.reduce((sum, line) => sum + BigInt(line.raw_cache_tokens), 0n),
     total_reasoning_tokens: lines.reduce(
-      (sum, line) => sum + BigInt(line.raw_reasoning_tokens), 0n,
+      () => undefined, 0n,
     ),
     total_deducted_quota: lines.reduce(
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] ArithmeticOperator
src/pipeline/attempt-usage-settlement.ts:214:22
       (sum, line) => sum + BigInt(line.raw_reasoning_tokens), 0n,
     ),
     total_deducted_quota: lines.reduce(
-      (sum, line) => sum + BigInt(line.deducted_quota ?? 0), 0n,
+      (sum, line) => sum - BigInt(line.deducted_quota ?? 0), 0n,
     ),
     total_api_cost: pricing.actualCost ?? "0.00000000",
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

@@ -1,18 +1,20 @@
  [

[Killed] LogicalOperator
src/pipeline/attempt-usage-settlement.ts:214:35
       (sum, line) => sum + BigInt(line.raw_reasoning_tokens), 0n,
     ),
     total_deducted_quota: lines.reduce(
-      (sum, line) => sum + BigInt(line.deducted_quota ?? 0), 0n,
+      (sum, line) => sum + BigInt(line.deducted_quota && 0), 0n,
     ),
     total_api_cost: pricing.actualCost ?? "0.00000000",
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: promise rejected "TypeError: Cannot convert null to a BigInt" instead of resolving

[Killed] LogicalOperator
src/pipeline/attempt-usage-settlement.ts:216:21
     total_deducted_quota: lines.reduce(
       (sum, line) => sum + BigInt(line.deducted_quota ?? 0), 0n,
     ),
-    total_api_cost: pricing.actualCost ?? "0.00000000",
+    total_api_cost: pricing.actualCost && "0.00000000",
     usage_quality: summarizeLedgerUsageQuality(lines),
     attempt_count: attempts.length,
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

@@ -1,16 +1,18 @@
  [

[Killed] StringLiteral
src/pipeline/attempt-usage-settlement.ts:216:43
     total_deducted_quota: lines.reduce(
       (sum, line) => sum + BigInt(line.deducted_quota ?? 0), 0n,
     ),
-    total_api_cost: pricing.actualCost ?? "0.00000000",
+    total_api_cost: pricing.actualCost ?? "",
     usage_quality: summarizeLedgerUsageQuality(lines),
     attempt_count: attempts.length,
killedBy: POOL-043 上游前撤权结算 仅有套餐零事实时 API 成本回落为零且默认不标记超额
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
src/pipeline/attempt-usage-settlement.ts:219:14
     total_api_cost: pricing.actualCost ?? "0.00000000",
     usage_quality: summarizeLedgerUsageQuality(lines),
     attempt_count: attempts.length,
-    overage: input.overage ?? false,
+    overage: input.overage && false,
     request_status: "FAILED",
     error_classification: input.errorClassification,
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

@@ -1,12 +1,14 @@
  [

[Killed] BooleanLiteral
src/pipeline/attempt-usage-settlement.ts:219:31
     total_api_cost: pricing.actualCost ?? "0.00000000",
     usage_quality: summarizeLedgerUsageQuality(lines),
     attempt_count: attempts.length,
-    overage: input.overage ?? false,
+    overage: input.overage ?? true,
     request_status: "FAILED",
     error_classification: input.errorClassification,
killedBy: POOL-043 上游前撤权结算 仅有套餐零事实时 API 成本回落为零且默认不标记超额
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/pipeline/attempt-usage-settlement.ts:226:10
     quota_settlements: input.quotaSettlements,
     release_lease_ids: input.releaseLeaseIds,
   });
-  return true;
+  return false;
 }
 
killedBy: POOL-043 上游前撤权结算 failover 已有结算事实时聚合发布 FAILED，且不重复结算已释放资源
statusReason: expected false to be true // Object.is equality
