[Killed] StringLiteral
src/repositories/dashboard-overages.ts:10:17
   db: Kysely<Database>, enterpriseId: string,
 ): Promise<OverageItem[]> {
   const rows = await db
-    .selectFrom("quota_counter")
+    .selectFrom("")
     .innerJoin("principal_grant", "principal_grant.id", "quota_counter.grant_id")
     .innerJoin("principal", "principal.id", "principal_grant.principal_id")
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:12:16
   const rows = await db
     .selectFrom("quota_counter")
     .innerJoin("principal_grant", "principal_grant.id", "quota_counter.grant_id")
-    .innerJoin("principal", "principal.id", "principal_grant.principal_id")
+    .innerJoin("", "principal.id", "principal_grant.principal_id")
     .where("principal_grant.enterprise_id", "=", enterpriseId)
     .where("principal_grant.status", "=", "ACTIVE")
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:14:43
     .innerJoin("principal_grant", "principal_grant.id", "quota_counter.grant_id")
     .innerJoin("principal", "principal.id", "principal_grant.principal_id")
     .where("principal_grant.enterprise_id", "=", enterpriseId)
-    .where("principal_grant.status", "=", "ACTIVE")
+    .where("principal_grant.status", "=", "")
     .where("principal.status", "=", "ACTIVE")
     .where("principal.archived_at", "is", null)
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:14:12
     .innerJoin("principal_grant", "principal_grant.id", "quota_counter.grant_id")
     .innerJoin("principal", "principal.id", "principal_grant.principal_id")
     .where("principal_grant.enterprise_id", "=", enterpriseId)
-    .where("principal_grant.status", "=", "ACTIVE")
+    .where("", "=", "ACTIVE")
     .where("principal.status", "=", "ACTIVE")
     .where("principal.archived_at", "is", null)
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:15:12
     .innerJoin("principal", "principal.id", "principal_grant.principal_id")
     .where("principal_grant.enterprise_id", "=", enterpriseId)
     .where("principal_grant.status", "=", "ACTIVE")
-    .where("principal.status", "=", "ACTIVE")
+    .where("", "=", "ACTIVE")
     .where("principal.archived_at", "is", null)
     .where("quota_counter.overage_value", ">", 0n)
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:15:37
     .innerJoin("principal", "principal.id", "principal_grant.principal_id")
     .where("principal_grant.enterprise_id", "=", enterpriseId)
     .where("principal_grant.status", "=", "ACTIVE")
-    .where("principal.status", "=", "ACTIVE")
+    .where("principal.status", "=", "")
     .where("principal.archived_at", "is", null)
     .where("quota_counter.overage_value", ">", 0n)
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:16:37
     .where("principal_grant.enterprise_id", "=", enterpriseId)
     .where("principal_grant.status", "=", "ACTIVE")
     .where("principal.status", "=", "ACTIVE")
-    .where("principal.archived_at", "is", null)
+    .where("principal.archived_at", "", null)
     .where("quota_counter.overage_value", ">", 0n)
     .orderBy("quota_counter.overage_value", "desc")
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:16:12
     .where("principal_grant.enterprise_id", "=", enterpriseId)
     .where("principal_grant.status", "=", "ACTIVE")
     .where("principal.status", "=", "ACTIVE")
-    .where("principal.archived_at", "is", null)
+    .where("", "is", null)
     .where("quota_counter.overage_value", ">", 0n)
     .orderBy("quota_counter.overage_value", "desc")
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:18:14
     .where("principal.status", "=", "ACTIVE")
     .where("principal.archived_at", "is", null)
     .where("quota_counter.overage_value", ">", 0n)
-    .orderBy("quota_counter.overage_value", "desc")
+    .orderBy("", "desc")
     .select([
       "principal.id as principal_id",
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:25:7
       "principal.type as principal_type",
       "principal_grant.provider",
       "principal_grant.model_alias",
-      "principal_grant.quota_value",
+      "",
       "quota_counter.used_value",
       "quota_counter.overage_value",
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] StringLiteral
src/repositories/dashboard-overages.ts:26:7
       "principal_grant.provider",
       "principal_grant.model_alias",
       "principal_grant.quota_value",
-      "quota_counter.used_value",
+      "",
       "quota_counter.overage_value",
     ])
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: promise rejected "Error: empty query token" instead of resolving

[Killed] BlockStatement
src/repositories/dashboard-overages.ts:30:28
       "quota_counter.overage_value",
     ])
     .execute();
-  return rows.map((row) => {
-    const quota = BigInt(row.quota_value);
-    const used = BigInt(row.used_value);
-    const overage = BigInt(row.overage_value);
-    return {
-      principalId: row.principal_id,
-      principalName: row.principal_name,
-      principalType: row.principal_type,
-      provider: row.provider,
-      modelAlias: row.model_alias,
-      quotaValue: quota.toString(),
-      usedValue: used.toString(),
-      overageValue: overage.toString(),
-      overageRatio: quota > 0n ? (Number(overage * 10000n / quota) / 10000).toString() : "0",
-    };
-  });
+  return rows.map((row) => {});
 }
 
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: expected [ undefined ] to deeply equal [ { principalId: 'principal', …(8) } ]

[Killed] ObjectLiteral
src/repositories/dashboard-overages.ts:34:12
     const quota = BigInt(row.quota_value);
     const used = BigInt(row.used_value);
     const overage = BigInt(row.overage_value);
-    return {
-      principalId: row.principal_id,
-      principalName: row.principal_name,
-      principalType: row.principal_type,
-      provider: row.provider,
-      modelAlias: row.model_alias,
-      quotaValue: quota.toString(),
-      usedValue: used.toString(),
-      overageValue: overage.toString(),
-      overageRatio: quota > 0n ? (Number(overage * 10000n / quota) / 10000).toString() : "0",
-    };
+    return {};
   });
 }
killedBy: dashboard overage query mutation contract filters the enterprise query and computes a positive overage ratio
statusReason: expected [ {} ] to deeply equal [ { principalId: 'principal', …(8) } ]

[Killed] ConditionalExpression
src/repositories/dashboard-overages.ts:43:21
       quotaValue: quota.toString(),
       usedValue: used.toString(),
       overageValue: overage.toString(),
-      overageRatio: quota > 0n ? (Number(overage * 10000n / quota) / 10000).toString() : "0",
+      overageRatio: true ? (Number(overage * 10000n / quota) / 10000).toString() : "0",
     };
   });
killedBy: dashboard overage query mutation contract returns a zero ratio when the grant quota is zero
statusReason: promise rejected "RangeError: Division by zero" instead of resolving

[Killed] EqualityOperator
src/repositories/dashboard-overages.ts:43:21
       quotaValue: quota.toString(),
       usedValue: used.toString(),
       overageValue: overage.toString(),
-      overageRatio: quota > 0n ? (Number(overage * 10000n / quota) / 10000).toString() : "0",
+      overageRatio: quota >= 0n ? (Number(overage * 10000n / quota) / 10000).toString() : "0",
     };
   });
killedBy: dashboard overage query mutation contract returns a zero ratio when the grant quota is zero
statusReason: promise rejected "RangeError: Division by zero" instead of resolving
