[Killed] BlockStatement
src/repositories/principal-access-locks.ts:17:51
 
 export type LockedPrincipalGrant = Selectable<PrincipalGrantTable>;
 
-function stableUnique(values: string[]): string[] {
-  return [...new Set(values)].sort((left, right) => left.localeCompare(right, "en"));
-}
+function stableUnique(values: string[]): string[] {}
 
 /** 先按稳定主体顺序锁定每个主体唯一的 ACTIVE Key。缺失 Key 不在这里报业务错。 */
killedBy: POOL-039 repository incremental mutation contract uses stable principal/provider order and preserves only existing lock rows
statusReason: stableUnique is not a function or its return value is not iterable

[Killed] ArrowFunction
src/repositories/principal-access-locks.ts:18:36
 export type LockedPrincipalGrant = Selectable<PrincipalGrantTable>;
 
 function stableUnique(values: string[]): string[] {
-  return [...new Set(values)].sort((left, right) => left.localeCompare(right, "en"));
+  return [...new Set(values)].sort(() => undefined);
 }
 
killedBy: POOL-039 repository incremental mutation contract uses stable principal/provider order and preserves only existing lock rows
statusReason: expected [ 'principal-b:zeta', …(1) ] to deeply equal [ 'principal-a:zeta', …(1) ]

[Killed] MethodExpression
src/repositories/principal-access-locks.ts:18:10
 export type LockedPrincipalGrant = Selectable<PrincipalGrantTable>;
 
 function stableUnique(values: string[]): string[] {
-  return [...new Set(values)].sort((left, right) => left.localeCompare(right, "en"));
+  return [...new Set(values)];
 }
 
killedBy: POOL-039 repository incremental mutation contract uses stable principal/provider order and preserves only existing lock rows
statusReason: expected [ 'principal-b:zeta', …(1) ] to deeply equal [ 'principal-a:zeta', …(1) ]

[Killed] BlockStatement
src/repositories/principal-access-locks.ts:26:33
   trx: Transaction<Database>,
   enterpriseId: string,
   principalIds: string[],
-): Promise<Map<string, string>> {
-  const locked = new Map<string, string>();
-  for (const principalId of stableUnique(principalIds)) {
-    const key = await trx.selectFrom("principal_key")
-      .select("id")
-      .where("enterprise_id", "=", enterpriseId)
-      .where("principal_id", "=", principalId)
-      .where("status", "=", "ACTIVE")
-      .forUpdate()
-      .executeTakeFirst();
-    if (key) locked.set(principalId, key.id);
-  }
-  return locked;
-}
+): Promise<Map<string, string>> {}
 
 /** 最后按稳定主体／厂商顺序锁定现有 ACTIVE 池；不存在的池由调用方在锁序之后创建。 */
killedBy: POOL-039 repository incremental mutation contract uses stable principal/provider order and preserves only existing lock rows
statusReason: Cannot read properties of undefined (reading 'keys')

[Killed] BlockStatement
src/repositories/principal-access-locks.ts:28:57
   principalIds: string[],
 ): Promise<Map<string, string>> {
   const locked = new Map<string, string>();
-  for (const principalId of stableUnique(principalIds)) {
-    const key = await trx.selectFrom("principal_key")
-      .select("id")
-      .where("enterprise_id", "=", enterpriseId)
-      .where("principal_id", "=", principalId)
-      .where("status", "=", "ACTIVE")
-      .forUpdate()
-      .executeTakeFirst();
-    if (key) locked.set(principalId, key.id);
-  }
+  for (const principalId of stableUnique(principalIds)) {}
   return locked;
 }
killedBy: POOL-039 repository incremental mutation contract uses stable principal/provider order and preserves only existing lock rows
statusReason: expected [] to deeply equal [ 'principal-a' ]

[Killed] StringLiteral
src/repositories/principal-access-locks.ts:30:15
   const locked = new Map<string, string>();
   for (const principalId of stableUnique(principalIds)) {
     const key = await trx.selectFrom("principal_key")
-      .select("id")
+      .select("")
       .where("enterprise_id", "=", enterpriseId)
       .where("principal_id", "=", principalId)
killedBy: POOL-039 主体接入锁顺序辅助函数 主体 Key 去重并按稳定顺序加锁
statusReason: expected [] to deeply equal [ Array(2) ]

[Killed] StringLiteral
src/repositories/principal-access-locks.ts:32:14
     const key = await trx.selectFrom("principal_key")
       .select("id")
       .where("enterprise_id", "=", enterpriseId)
-      .where("principal_id", "=", principalId)
+      .where("", "=", principalId)
       .where("status", "=", "ACTIVE")
       .forUpdate()
killedBy: POOL-039 主体接入锁顺序辅助函数 主体 Key 去重并按稳定顺序加锁
statusReason: expected [] to deeply equal [ Array(2) ]

[Killed] StringLiteral
src/repositories/principal-access-locks.ts:33:24
       .select("id")
       .where("enterprise_id", "=", enterpriseId)
       .where("principal_id", "=", principalId)
-      .where("status", "=", "ACTIVE")
+      .where("status", "", "ACTIVE")
       .forUpdate()
       .executeTakeFirst();
killedBy: POOL-039 主体接入锁顺序辅助函数 主体 Key 去重并按稳定顺序加锁
statusReason: expected [] to deeply equal [ Array(2) ]

[Killed] StringLiteral
src/repositories/principal-access-locks.ts:33:29
       .select("id")
       .where("enterprise_id", "=", enterpriseId)
       .where("principal_id", "=", principalId)
-      .where("status", "=", "ACTIVE")
+      .where("status", "=", "")
       .forUpdate()
       .executeTakeFirst();
killedBy: POOL-039 主体接入锁顺序辅助函数 主体 Key 去重并按稳定顺序加锁
statusReason: expected [] to deeply equal [ Array(2) ]

[Killed] ConditionalExpression
src/repositories/principal-access-locks.ts:36:9
       .where("status", "=", "ACTIVE")
       .forUpdate()
       .executeTakeFirst();
-    if (key) locked.set(principalId, key.id);
+    if (true) locked.set(principalId, key.id);
   }
   return locked;
killedBy: POOL-039 主体接入锁顺序辅助函数 缺失 Key 或池行时不伪造锁定结果
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/repositories/principal-access-locks.ts:36:9
       .where("status", "=", "ACTIVE")
       .forUpdate()
       .executeTakeFirst();
-    if (key) locked.set(principalId, key.id);
+    if (false) locked.set(principalId, key.id);
   }
   return locked;
killedBy: POOL-039 主体接入锁顺序辅助函数 主体 Key 去重并按稳定顺序加锁
statusReason: expected [] to deeply equal [ [ 'principal-a', …(1) ], …(1) ]

[Killed] BlockStatement
src/repositories/principal-access-locks.ts:47:47
   enterpriseId: string,
   principalIds: string[],
   providerCodes: string[],
-): Promise<Map<string, LockedPrincipalGrant>> {
-  const locked = new Map<string, LockedPrincipalGrant>();
-  for (const principalId of stableUnique(principalIds)) {
-    for (const providerCode of stableUnique(providerCodes)) {
-      const pool = await trx.selectFrom("principal_grant")
-        .selectAll()
-        .where("enterprise_id", "=", enterpriseId)
-        .where("principal_id", "=", principalId)
-        .where("provider", "=", providerCode)
-        .where("pool_model_alias", "=", "*")
-        .where("status", "=", "ACTIVE")
-        .forUpdate()
-        .executeTakeFirst();
-      if (pool) locked.set(`${principalId}:${providerCode}`, pool);
-    }
-  }
-  return locked;
-}
+): Promise<Map<string, LockedPrincipalGrant>> {}
 
killedBy: POOL-039 主体接入锁顺序辅助函数 主体与厂商池按双重稳定顺序加锁并返回行
statusReason: expected [] to deeply equal [ 'pool:principal-a:alpha', …(3) ]

[Killed] BlockStatement
src/repositories/principal-access-locks.ts:49:57
   providerCodes: string[],
 ): Promise<Map<string, LockedPrincipalGrant>> {
   const locked = new Map<string, LockedPrincipalGrant>();
-  for (const principalId of stableUnique(principalIds)) {
-    for (const providerCode of stableUnique(providerCodes)) {
-      const pool = await trx.selectFrom("principal_grant")
-        .selectAll()
-        .where("enterprise_id", "=", enterpriseId)
-        .where("principal_id", "=", principalId)
-        .where("provider", "=", providerCode)
-        .where("pool_model_alias", "=", "*")
-        .where("status", "=", "ACTIVE")
-        .forUpdate()
-        .executeTakeFirst();
-      if (pool) locked.set(`${principalId}:${providerCode}`, pool);
-    }
-  }
+  for (const principalId of stableUnique(principalIds)) {}
   return locked;
 }
killedBy: POOL-039 主体接入锁顺序辅助函数 主体与厂商池按双重稳定顺序加锁并返回行
statusReason: expected [] to deeply equal [ 'pool:principal-a:alpha', …(3) ]

[Killed] BlockStatement
src/repositories/principal-access-locks.ts:50:61
 ): Promise<Map<string, LockedPrincipalGrant>> {
   const locked = new Map<string, LockedPrincipalGrant>();
   for (const principalId of stableUnique(principalIds)) {
-    for (const providerCode of stableUnique(providerCodes)) {
-      const pool = await trx.selectFrom("principal_grant")
-        .selectAll()
-        .where("enterprise_id", "=", enterpriseId)
-        .where("principal_id", "=", principalId)
-        .where("provider", "=", providerCode)
-        .where("pool_model_alias", "=", "*")
-        .where("status", "=", "ACTIVE")
-        .forUpdate()
-        .executeTakeFirst();
-      if (pool) locked.set(`${principalId}:${providerCode}`, pool);
-    }
+    for (const providerCode of stableUnique(providerCodes)) {}
   }
   return locked;
killedBy: POOL-039 主体接入锁顺序辅助函数 主体与厂商池按双重稳定顺序加锁并返回行
statusReason: expected [] to deeply equal [ 'pool:principal-a:alpha', …(3) ]

[Killed] StringLiteral
src/repositories/principal-access-locks.ts:53:16
     for (const providerCode of stableUnique(providerCodes)) {
       const pool = await trx.selectFrom("principal_grant")
         .selectAll()
-        .where("enterprise_id", "=", enterpriseId)
+        .where("", "=", enterpriseId)
         .where("principal_id", "=", principalId)
         .where("provider", "=", providerCode)
killedBy: POOL-039 主体接入锁顺序辅助函数 主体与厂商池按双重稳定顺序加锁并返回行
statusReason: expected [] to deeply equal [ 'pool:principal-a:alpha', …(3) ]

[Killed] StringLiteral
src/repositories/principal-access-locks.ts:54:32
       const pool = await trx.selectFrom("principal_grant")
         .selectAll()
         .where("enterprise_id", "=", enterpriseId)
-        .where("principal_id", "=", principalId)
+        .where("principal_id", "", principalId)
         .where("provider", "=", providerCode)
         .where("pool_model_alias", "=", "*")
killedBy: POOL-039 主体接入锁顺序辅助函数 主体与厂商池按双重稳定顺序加锁并返回行
statusReason: expected [] to deeply equal [ 'pool:principal-a:alpha', …(3) ]

[Killed] StringLiteral
src/repositories/principal-access-locks.ts:55:28
         .selectAll()
         .where("enterprise_id", "=", enterpriseId)
         .where("principal_id", "=", principalId)
-        .where("provider", "=", providerCode)
+        .where("provider", "", providerCode)
         .where("pool_model_alias", "=", "*")
         .where("status", "=", "ACTIVE")
killedBy: POOL-039 主体接入锁顺序辅助函数 主体与厂商池按双重稳定顺序加锁并返回行
statusReason: expected [] to deeply equal [ 'pool:principal-a:alpha', …(3) ]

[Killed] StringLiteral
src/repositories/principal-access-locks.ts:57:26
         .where("principal_id", "=", principalId)
         .where("provider", "=", providerCode)
         .where("pool_model_alias", "=", "*")
-        .where("status", "=", "ACTIVE")
+        .where("status", "", "ACTIVE")
         .forUpdate()
         .executeTakeFirst();
killedBy: POOL-039 主体接入锁顺序辅助函数 主体与厂商池按双重稳定顺序加锁并返回行
statusReason: expected [] to deeply equal [ 'pool:principal-a:alpha', …(3) ]

[Killed] ConditionalExpression
src/repositories/principal-access-locks.ts:60:11
         .where("status", "=", "ACTIVE")
         .forUpdate()
         .executeTakeFirst();
-      if (pool) locked.set(`${principalId}:${providerCode}`, pool);
+      if (false) locked.set(`${principalId}:${providerCode}`, pool);
     }
   }
killedBy: POOL-039 主体接入锁顺序辅助函数 主体与厂商池按双重稳定顺序加锁并返回行
statusReason: expected undefined to match object { id: 'pool-principal-a-alpha' }

[Killed] ConditionalExpression
src/repositories/principal-access-locks.ts:60:11
         .where("status", "=", "ACTIVE")
         .forUpdate()
         .executeTakeFirst();
-      if (pool) locked.set(`${principalId}:${providerCode}`, pool);
+      if (true) locked.set(`${principalId}:${providerCode}`, pool);
     }
   }
killedBy: POOL-039 主体接入锁顺序辅助函数 缺失 Key 或池行时不伪造锁定结果
statusReason: expected [ 'principal-a:alpha', …(1) ] to deeply equal [ 'principal-a:zeta' ]
