[Killed] BlockStatement
src/repositories/principal-single-rule.ts:6:36
 import type { Database } from "../kysely.js";
 import type { AccessConfigPutInput } from "./principal-access-config-repository.js";
 
-function jsonValue<T>(value: T): T {
-  return JSON.stringify(value) as unknown as T;
-}
+function jsonValue<T>(value: T): T {}
 
 /** 单主体配置只复用草稿/校验版本；已发布版本必须递增新版本，避免静默覆盖。 */
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected { enterprise_id: 'enterprise', …(14) } to match object { enterprise_id: 'enterprise', …(12) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/repositories/principal-single-rule.ts:14:20
 export async function ensureSingleRule(
   trx: Transaction<Database>,
   input: AccessConfigPutInput,
-): Promise<string> {
-  const existing = await trx.selectFrom("employee_model_rule_version")
-    .select(["id", "rule_id", "version", "status"])
-    .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
-    .orderBy("version", "desc").forUpdate().executeTakeFirst();
-  if (existing && (existing.status === "DRAFT" || existing.status === "VALIDATED")) return existing.id;
-  const ruleId = existing?.rule_id ?? randomUUID();
-  const version = existing ? existing.version + 1 : 1;
-  const created = await trx.insertInto("employee_model_rule_version").values({
-    enterprise_id: input.enterpriseId, rule_id: ruleId, version,
-    name: `接入配置-${input.principalId}`, employee_scope: "SELECTED",
-    principal_ids: jsonValue([input.principalId]), model_scope: "SELECTED",
-    model_targets: jsonValue([]), quota_value: null, allow_overage: false,
-    valid_from: new Date(), valid_until: null, owner_principal_id: input.principalId,
-    created_by_admin_user_id: input.adminUserId, status: "DRAFT",
-  }).returning("id").executeTakeFirstOrThrow();
-  return created.id;
-}
+): Promise<string> {}
 
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected undefined to be 'draft' // Object.is equality

[Killed] StringLiteral
src/repositories/principal-single-rule.ts:15:41
   trx: Transaction<Database>,
   input: AccessConfigPutInput,
 ): Promise<string> {
-  const existing = await trx.selectFrom("employee_model_rule_version")
+  const existing = await trx.selectFrom("")
     .select(["id", "rule_id", "version", "status"])
     .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected 'new-version' to be 'draft' // Object.is equality

[Killed] StringLiteral
src/repositories/principal-single-rule.ts:16:31
   input: AccessConfigPutInput,
 ): Promise<string> {
   const existing = await trx.selectFrom("employee_model_rule_version")
-    .select(["id", "rule_id", "version", "status"])
+    .select(["id", "rule_id", "", "status"])
     .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
     .orderBy("version", "desc").forUpdate().executeTakeFirst();
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected 'new-version' to be 'draft' // Object.is equality

[Killed] StringLiteral
src/repositories/principal-single-rule.ts:16:20
   input: AccessConfigPutInput,
 ): Promise<string> {
   const existing = await trx.selectFrom("employee_model_rule_version")
-    .select(["id", "rule_id", "version", "status"])
+    .select(["id", "", "version", "status"])
     .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
     .orderBy("version", "desc").forUpdate().executeTakeFirst();
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected 'new-version' to be 'draft' // Object.is equality

[Killed] StringLiteral
src/repositories/principal-single-rule.ts:17:60
 ): Promise<string> {
   const existing = await trx.selectFrom("employee_model_rule_version")
     .select(["id", "rule_id", "version", "status"])
-    .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
+    .where("enterprise_id", "=", input.enterpriseId).where("", "=", input.principalId)
     .orderBy("version", "desc").forUpdate().executeTakeFirst();
   if (existing && (existing.status === "DRAFT" || existing.status === "VALIDATED")) return existing.id;
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected [ …(6) ] to include 'employee_model_rule_version.where:own…'

[Killed] StringLiteral
src/repositories/principal-single-rule.ts:17:82
 ): Promise<string> {
   const existing = await trx.selectFrom("employee_model_rule_version")
     .select(["id", "rule_id", "version", "status"])
-    .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
+    .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "", input.principalId)
     .orderBy("version", "desc").forUpdate().executeTakeFirst();
   if (existing && (existing.status === "DRAFT" || existing.status === "VALIDATED")) return existing.id;
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected [ …(6) ] to include 'employee_model_rule_version.where:own…'

[Killed] LogicalOperator
src/repositories/principal-single-rule.ts:19:20
     .select(["id", "rule_id", "version", "status"])
     .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
     .orderBy("version", "desc").forUpdate().executeTakeFirst();
-  if (existing && (existing.status === "DRAFT" || existing.status === "VALIDATED")) return existing.id;
+  if (existing && (existing.status === "DRAFT" && existing.status === "VALIDATED")) return existing.id;
   const ruleId = existing?.rule_id ?? randomUUID();
   const version = existing ? existing.version + 1 : 1;
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected 'new-version' to be 'draft' // Object.is equality

[Killed] EqualityOperator
src/repositories/principal-single-rule.ts:19:20
     .select(["id", "rule_id", "version", "status"])
     .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
     .orderBy("version", "desc").forUpdate().executeTakeFirst();
-  if (existing && (existing.status === "DRAFT" || existing.status === "VALIDATED")) return existing.id;
+  if (existing && (existing.status !== "DRAFT" || existing.status === "VALIDATED")) return existing.id;
   const ruleId = existing?.rule_id ?? randomUUID();
   const version = existing ? existing.version + 1 : 1;
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected 'new-version' to be 'draft' // Object.is equality

[Killed] LogicalOperator
src/repositories/principal-single-rule.ts:20:18
     .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
     .orderBy("version", "desc").forUpdate().executeTakeFirst();
   if (existing && (existing.status === "DRAFT" || existing.status === "VALIDATED")) return existing.id;
-  const ruleId = existing?.rule_id ?? randomUUID();
+  const ruleId = existing?.rule_id && randomUUID();
   const version = existing ? existing.version + 1 : 1;
   const created = await trx.insertInto("employee_model_rule_version").values({
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected { enterprise_id: 'enterprise', …(14) } to match object { enterprise_id: 'enterprise', …(12) }
(2 matching properties omitted from actual)

[Killed] OptionalChaining
src/repositories/principal-single-rule.ts:20:18
     .where("enterprise_id", "=", input.enterpriseId).where("owner_principal_id", "=", input.principalId)
     .orderBy("version", "desc").forUpdate().executeTakeFirst();
   if (existing && (existing.status === "DRAFT" || existing.status === "VALIDATED")) return existing.id;
-  const ruleId = existing?.rule_id ?? randomUUID();
+  const ruleId = existing.rule_id ?? randomUUID();
   const version = existing ? existing.version + 1 : 1;
   const created = await trx.insertInto("employee_model_rule_version").values({
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] ArithmeticOperator
src/repositories/principal-single-rule.ts:21:30
     .orderBy("version", "desc").forUpdate().executeTakeFirst();
   if (existing && (existing.status === "DRAFT" || existing.status === "VALIDATED")) return existing.id;
   const ruleId = existing?.rule_id ?? randomUUID();
-  const version = existing ? existing.version + 1 : 1;
+  const version = existing ? existing.version - 1 : 1;
   const created = await trx.insertInto("employee_model_rule_version").values({
     enterprise_id: input.enterpriseId, rule_id: ruleId, version,
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected { enterprise_id: 'enterprise', …(14) } to match object { enterprise_id: 'enterprise', …(12) }
(2 matching properties omitted from actual)

[Killed] ObjectLiteral
src/repositories/principal-single-rule.ts:22:78
   if (existing && (existing.status === "DRAFT" || existing.status === "VALIDATED")) return existing.id;
   const ruleId = existing?.rule_id ?? randomUUID();
   const version = existing ? existing.version + 1 : 1;
-  const created = await trx.insertInto("employee_model_rule_version").values({
-    enterprise_id: input.enterpriseId, rule_id: ruleId, version,
-    name: `接入配置-${input.principalId}`, employee_scope: "SELECTED",
-    principal_ids: jsonValue([input.principalId]), model_scope: "SELECTED",
-    model_targets: jsonValue([]), quota_value: null, allow_overage: false,
-    valid_from: new Date(), valid_until: null, owner_principal_id: input.principalId,
-    created_by_admin_user_id: input.adminUserId, status: "DRAFT",
-  }).returning("id").executeTakeFirstOrThrow();
+  const created = await trx.insertInto("employee_model_rule_version").values({}).returning("id").executeTakeFirstOrThrow();
   return created.id;
 }
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected {} to match object { enterprise_id: 'enterprise', …(12) }

[Killed] BooleanLiteral
src/repositories/principal-single-rule.ts:26:69
     enterprise_id: input.enterpriseId, rule_id: ruleId, version,
     name: `接入配置-${input.principalId}`, employee_scope: "SELECTED",
     principal_ids: jsonValue([input.principalId]), model_scope: "SELECTED",
-    model_targets: jsonValue([]), quota_value: null, allow_overage: false,
+    model_targets: jsonValue([]), quota_value: null, allow_overage: true,
     valid_from: new Date(), valid_until: null, owner_principal_id: input.principalId,
     created_by_admin_user_id: input.adminUserId, status: "DRAFT",
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected { enterprise_id: 'enterprise', …(14) } to match object { enterprise_id: 'enterprise', …(12) }
(2 matching properties omitted from actual)

[Killed] ArrayDeclaration
src/repositories/principal-single-rule.ts:26:30
     enterprise_id: input.enterpriseId, rule_id: ruleId, version,
     name: `接入配置-${input.principalId}`, employee_scope: "SELECTED",
     principal_ids: jsonValue([input.principalId]), model_scope: "SELECTED",
-    model_targets: jsonValue([]), quota_value: null, allow_overage: false,
+    model_targets: jsonValue(["Stryker was here"]), quota_value: null, allow_overage: false,
     valid_from: new Date(), valid_until: null, owner_principal_id: input.principalId,
     created_by_admin_user_id: input.adminUserId, status: "DRAFT",
killedBy: POOL-039 repository incremental mutation contract reuses editable single rules and versions a published one
statusReason: expected { enterprise_id: 'enterprise', …(14) } to match object { enterprise_id: 'enterprise', …(12) }
(2 matching properties omitted from actual)
