[Killed] ArrowFunction
src/repositories/gateway-ledger-request-facts.ts:24:66
   enterpriseId: string,
   requestId: string,
 ): Promise<RequestSettlementFacts> {
-  const attempt = await db.selectFrom("upstream_attempt").select((eb) => [
-    eb.fn.countAll<string>().as("total"),
-    eb.fn.count<string>("finished_at").as("finished"),
-  ]).where("enterprise_id", "=", enterpriseId)
+  const attempt = await db.selectFrom("upstream_attempt").select(() => undefined).where("enterprise_id", "=", enterpriseId)
     .where("ai_request_id", "=", requestId).executeTakeFirstOrThrow();
   if (attempt.finished !== attempt.total) {
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: invalid aliased expression: undefined

[Killed] StringLiteral
src/repositories/gateway-ledger-request-facts.ts:27:29
   const attempt = await db.selectFrom("upstream_attempt").select((eb) => [
     eb.fn.countAll<string>().as("total"),
     eb.fn.count<string>("finished_at").as("finished"),
-  ]).where("enterprise_id", "=", enterpriseId)
+  ]).where("enterprise_id", "", enterpriseId)
     .where("ai_request_id", "=", requestId).executeTakeFirstOrThrow();
   if (attempt.finished !== attempt.total) {
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-request-facts.ts:28:12
     eb.fn.countAll<string>().as("total"),
     eb.fn.count<string>("finished_at").as("finished"),
   ]).where("enterprise_id", "=", enterpriseId)
-    .where("ai_request_id", "=", requestId).executeTakeFirstOrThrow();
+    .where("", "=", requestId).executeTakeFirstOrThrow();
   if (attempt.finished !== attempt.total) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: zero-length delimited identifier at or near """"

[Killed] ConditionalExpression
src/repositories/gateway-ledger-request-facts.ts:29:7
     eb.fn.count<string>("finished_at").as("finished"),
   ]).where("enterprise_id", "=", enterpriseId)
     .where("ai_request_id", "=", requestId).executeTakeFirstOrThrow();
-  if (attempt.finished !== attempt.total) {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
   }
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_attempt_incomplete

[Killed] ConditionalExpression
src/repositories/gateway-ledger-request-facts.ts:29:7
     eb.fn.count<string>("finished_at").as("finished"),
   ]).where("enterprise_id", "=", enterpriseId)
     .where("ai_request_id", "=", requestId).executeTakeFirstOrThrow();
-  if (attempt.finished !== attempt.total) {
+  if (false) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
   }
killedBy: POOL-043 结账与项目归属并发边界 finalize 拒绝事务外旧 totals 与未完成 attempt，且不发布 terminal
statusReason: expected [Function] to throw error including 'settlement_attempt_incomplete' but got 'settlement_attempt_fact_missing'

[Killed] StringLiteral
src/repositories/gateway-ledger-request-facts.ts:30:52
   ]).where("enterprise_id", "=", enterpriseId)
     .where("ai_request_id", "=", requestId).executeTakeFirstOrThrow();
   if (attempt.finished !== attempt.total) {
-    throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
+    throw new GatewayLedgerSettlementConflictError("");
   }
   const missingLine = await sql<{ missing: boolean }>`
killedBy: POOL-043 结账与项目归属并发边界 finalize 拒绝事务外旧 totals 与未完成 attempt，且不发布 terminal
statusReason: expected [Function] to throw error including 'settlement_attempt_incomplete' but got ''

[Killed] BlockStatement
src/repositories/gateway-ledger-request-facts.ts:44:37
          )
     ) AS missing
   `.execute(db);
-  if (missingLine.rows[0]?.missing) {
-    throw new GatewayLedgerSettlementConflictError("settlement_usage_without_line");
-  }
+  if (missingLine.rows[0]?.missing) {}
   const missingAttemptFact = await sql<{ missing: boolean }>`
     SELECT EXISTS (
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: expected [Function] to throw error including 'settlement_usage_without_line' but got 'settlement_attempt_fact_missing'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-request-facts.ts:44:7
          )
     ) AS missing
   `.execute(db);
-  if (missingLine.rows[0]?.missing) {
+  if (false) {
     throw new GatewayLedgerSettlementConflictError("settlement_usage_without_line");
   }
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: expected [Function] to throw error including 'settlement_usage_without_line' but got 'settlement_attempt_fact_missing'

[Killed] StringLiteral
src/repositories/gateway-ledger-request-facts.ts:45:52
     ) AS missing
   `.execute(db);
   if (missingLine.rows[0]?.missing) {
-    throw new GatewayLedgerSettlementConflictError("settlement_usage_without_line");
+    throw new GatewayLedgerSettlementConflictError("");
   }
   const missingAttemptFact = await sql<{ missing: boolean }>`
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: expected [Function] to throw error including 'settlement_usage_without_line' but got ''

[Killed] OptionalChaining
src/repositories/gateway-ledger-request-facts.ts:64:7
          )
     ) AS missing
   `.execute(db);
-  if (missingAttemptFact.rows[0]?.missing) {
+  if (missingAttemptFact.rows[0].missing) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_fact_missing");
   }
killedBy: POOL-043 结账与项目归属并发边界 terminal 发布后拒绝 late attempt 与 late usage，账本计数保持不变
statusReason: settlement_status_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-request-facts.ts:64:7
          )
     ) AS missing
   `.execute(db);
-  if (missingAttemptFact.rows[0]?.missing) {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_fact_missing");
   }
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_attempt_fact_missing

[Killed] ObjectLiteral
src/repositories/gateway-ledger-request-facts.ts:91:10
        AND ai_request_id = ${requestId}
   `.execute(db);
   const total = totals.rows[0]!;
-  return {
-    attemptCount: Number(attempt.total),
-    totalInputTokens: BigInt(total.input_tokens),
-    totalOutputTokens: BigInt(total.output_tokens),
-    totalCacheTokens: BigInt(total.cache_tokens),
-    totalReasoningTokens: BigInt(total.reasoning_tokens),
-    totalDeductedQuota: BigInt(total.deducted_quota),
-    totalApiCost: new Decimal(total.api_cost_known ? total.api_cost : "0").toFixed(8),
-    usageQualities: total.usage_qualities ?? [],
-  };
+  return {};
 }
 
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_attempt_incomplete

[Killed] LogicalOperator
src/repositories/gateway-ledger-request-facts.ts:99:21
     totalReasoningTokens: BigInt(total.reasoning_tokens),
     totalDeductedQuota: BigInt(total.deducted_quota),
     totalApiCost: new Decimal(total.api_cost_known ? total.api_cost : "0").toFixed(8),
-    usageQualities: total.usage_qualities ?? [],
+    usageQualities: total.usage_qualities && [],
   };
 }
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_totals_stale
