[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:100:9
 ): Promise<UsageLedgerLineResult> {
   return db.transaction().execute(async (trx) => {
     const result = await persistUsageLedgerLine(trx, input, input.attempt_result);
-    if (result.created) {
+    if (true) {
       await settleRequestAccounting(trx, {
         ai_request_id: input.usage.ai_request_id,
killedBy: POOL-043 结账与项目归属并发边界 非终态清算提交后发生同 Grant 新预占，旧 Attempt 重放不得再次扣减
statusReason: expected 0n to be 19n // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:122:7
   const request = await lockInProgressRequest(
     trx, input.usage.enterprise_id, input.usage.ai_request_id,
   );
-  if (request.principal_id !== input.ledger_line.principal_id) {
+  if (request.principal_id === input.ledger_line.principal_id) {
     throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
   }
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: settlement_principal_conflict to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:123:52
     trx, input.usage.enterprise_id, input.usage.ai_request_id,
   );
   if (request.principal_id !== input.ledger_line.principal_id) {
-    throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
+    throw new GatewayLedgerSettlementConflictError("");
   }
   let attemptQuery = trx.selectFrom("upstream_attempt")
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: principal_id: expected [Function] to throw error including 'settlement_principal_conflict' but got ''

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:125:37
   if (request.principal_id !== input.ledger_line.principal_id) {
     throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
   }
-  let attemptQuery = trx.selectFrom("upstream_attempt")
+  let attemptQuery = trx.selectFrom("")
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
     .select([
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:128:7
   let attemptQuery = trx.selectFrom("upstream_attempt")
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
     .select([
-      "upstream_attempt.id", "upstream_attempt.finished_at", "upstream_attempt.http_status",
+      "", "upstream_attempt.finished_at", "upstream_attempt.http_status",
       "upstream_attempt.response_committed", "upstream_attempt.error_classification",
       "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:128:30
   let attemptQuery = trx.selectFrom("upstream_attempt")
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
     .select([
-      "upstream_attempt.id", "upstream_attempt.finished_at", "upstream_attempt.http_status",
+      "upstream_attempt.id", "", "upstream_attempt.http_status",
       "upstream_attempt.response_committed", "upstream_attempt.error_classification",
       "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:130:7
     .select([
       "upstream_attempt.id", "upstream_attempt.finished_at", "upstream_attempt.http_status",
       "upstream_attempt.response_committed", "upstream_attempt.error_classification",
-      "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
+      "", "upstream_attempt.switch_reason", "provider_resource.mode",
     ])
     .where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:132:12
       "upstream_attempt.response_committed", "upstream_attempt.error_classification",
       "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
     ])
-    .where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
+    .where("", "=", input.usage.upstream_attempt_id)
     .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
     .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:135:12
     .where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
     .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
     .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
-    .where("upstream_attempt.provider_resource_id", "=", input.usage.provider_resource_id)
+    .where("", "=", input.usage.provider_resource_id)
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id);
   if (attemptResult) attemptQuery = attemptQuery.forUpdate();
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:139:7
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id);
   if (attemptResult) attemptQuery = attemptQuery.forUpdate();
   const attempt = await attemptQuery.executeTakeFirst();
-  if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
+  if (true) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
   if (attempt.mode !== input.ledger_line.resource_mode) {
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: usage_attempt_conflict to be an instance of OperatingBillClosedError

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:140:7
   if (attemptResult) attemptQuery = attemptQuery.forUpdate();
   const attempt = await attemptQuery.executeTakeFirst();
   if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
-  if (attempt.mode !== input.ledger_line.resource_mode) {
+  if (false) {
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
   }
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: resource_mode: expected [Function] to throw error including 'settlement_resource_mode_conflict' but got 'ledger_line_conflict'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:143:7
   if (attempt.mode !== input.ledger_line.resource_mode) {
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
   }
-  if (attemptResult) {
+  if (false) {
     if (attempt.finished_at === null) {
       const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_incomplete

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:146:22
   if (attemptResult) {
     if (attempt.finished_at === null) {
       const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
-        .where("id", "=", input.usage.upstream_attempt_id)
+        .where("id", "", input.usage.upstream_attempt_id)
         .where("enterprise_id", "=", input.usage.enterprise_id)
         .where("ai_request_id", "=", input.usage.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:147:16
     if (attempt.finished_at === null) {
       const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
         .where("id", "=", input.usage.upstream_attempt_id)
-        .where("enterprise_id", "=", input.usage.enterprise_id)
+        .where("", "=", input.usage.enterprise_id)
         .where("ai_request_id", "=", input.usage.ai_request_id)
         .where("finished_at", "is", null).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:150:49
         .where("enterprise_id", "=", input.usage.enterprise_id)
         .where("ai_request_id", "=", input.usage.ai_request_id)
         .where("finished_at", "is", null).executeTakeFirst();
-      if (Number(updated.numUpdatedRows) !== 1) {
-        throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
-      }
+      if (Number(updated.numUpdatedRows) !== 1) {}
     } else if (attempt.http_status !== attemptResult.http_status
       || attempt.response_committed !== attemptResult.response_committed
killedBy: POOL-043 结账与项目归属并发边界 Attempt UPDATE 被 PostgreSQL trigger 丢弃时，零事实与资源结算全部回滚
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:150:11
         .where("enterprise_id", "=", input.usage.enterprise_id)
         .where("ai_request_id", "=", input.usage.ai_request_id)
         .where("finished_at", "is", null).executeTakeFirst();
-      if (Number(updated.numUpdatedRows) !== 1) {
+      if (Number(updated.numUpdatedRows) === 1) {
         throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:153:16
       if (Number(updated.numUpdatedRows) !== 1) {
         throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
       }
-    } else if (attempt.http_status !== attemptResult.http_status
+    } else if (attempt.http_status === attemptResult.http_status
       || attempt.response_committed !== attemptResult.response_committed
       || attempt.error_classification !== attemptResult.error_classification
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: settlement_attempt_result_conflict

[Killed] ObjectLiteral
src/repositories/gateway-ledger-settlement.ts:166:56
   if (!usage) {
     const createdAt = new Date();
     await guardOperatingBillLedgerWrite(trx, input.usage.enterprise_id, createdAt);
-    usage = await trx.insertInto("usage_event").values({
-      ai_request_id: input.usage.ai_request_id,
-      enterprise_id: input.usage.enterprise_id,
-      upstream_attempt_id: input.usage.upstream_attempt_id,
-      provider_resource_id: input.usage.provider_resource_id,
-      input_tokens: input.usage.input_tokens,
-      output_tokens: input.usage.output_tokens,
-      cache_tokens: input.usage.cache_tokens,
-      reasoning_tokens: input.usage.reasoning_tokens ?? 0n,
-      usage_quality: input.usage.usage_quality,
-      dedup_key: input.usage.dedup_key,
-      upstream_usage_id: input.usage.upstream_usage_id ?? null,
-      created_at: createdAt,
-    }).returningAll().executeTakeFirstOrThrow();
+    usage = await trx.insertInto("usage_event").values({}).returningAll().executeTakeFirstOrThrow();
   }
   assertUsageMatches(usage, input);
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: syntax error at or near ")"

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:183:12
   }
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
-    .where("usage_event_id", "=", usage.id).orderBy("created_at", "asc")
+    .where("", "=", usage.id).orderBy("created_at", "asc")
     .orderBy("id", "asc").execute();
   if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: zero-length delimited identifier at or near """"

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:185:7
   const lines = await trx.selectFrom("ledger_line").selectAll()
     .where("usage_event_id", "=", usage.id).orderBy("created_at", "asc")
     .orderBy("id", "asc").execute();
-  if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
+  if (true) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
   if (lines[0]) {
     assertLineMatches(lines[0], input);
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: duplicate_ledger_line

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:186:17
     .where("usage_event_id", "=", usage.id).orderBy("created_at", "asc")
     .orderBy("id", "asc").execute();
   if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
-  if (lines[0]) {
-    assertLineMatches(lines[0], input);
-    return { usage, line: lines[0], created: false };
-  }
+  if (lines[0]) {}
 
   // 历史 usage-only 自愈必须保留 usage 的事实月份，不能按修复执行时间跨月改账。
killedBy: POOL-043 结账与项目归属并发边界 usage→ledger 窗口不可见半成品，IN_PROGRESS 使关账 fail-close 直到原子 finalize
statusReason: duplicate key value violates unique constraint "ledger_line_unique_usage_event_idx"

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:315:16
     const counter = await db.selectFrom("quota_counter").selectAll()
       .where("grant_id", "=", grantId).forUpdate().executeTakeFirst();
     const grant = await db.selectFrom("principal_grant")
-      .select(["id", "enterprise_id", "principal_id", "quota_value"])
+      .select(["", "enterprise_id", "principal_id", "quota_value"])
       .where("id", "=", grantId).executeTakeFirst();
     if (!counter || !grant
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:317:9
     const grant = await db.selectFrom("principal_grant")
       .select(["id", "enterprise_id", "principal_id", "quota_value"])
       .where("id", "=", grantId).executeTakeFirst();
-    if (!counter || !grant
-      || grant.enterprise_id !== input.enterprise_id
-      || grant.principal_id !== input.principal_id) {
+    if (true) {
       throw new GatewayLedgerSettlementConflictError("settlement_quota_grant_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_quota_grant_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:328:22
     const quota = BigInt(grant.quota_value);
     await db.updateTable("quota_counter").set({
       used_value: used,
-      overage_value: used > quota ? used - quota : 0n,
+      overage_value: false ? used - quota : 0n,
       updated_at: now,
     }).where("grant_id", "=", grantId).execute();
killedBy: POOL-043 结账与项目归属并发边界 非终态清算按实际扣减重算额度与超额：'quota-over'
statusReason: expected 0n to be 5n // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:334:7
   }
 
   const leaseIds = [...new Set(input.release_lease_ids ?? [])].sort();
-  if (leaseIds.length > 0) {
+  if (leaseIds.length <= 0) {
     const leases = await db.selectFrom("concurrency_lease").select("id")
       .where("id", "in", leaseIds)
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: syntax error at or near ")"

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:336:14
   const leaseIds = [...new Set(input.release_lease_ids ?? [])].sort();
   if (leaseIds.length > 0) {
     const leases = await db.selectFrom("concurrency_lease").select("id")
-      .where("id", "in", leaseIds)
+      .where("", "in", leaseIds)
       .where("enterprise_id", "=", input.enterprise_id)
       .where("ai_request_id", "=", input.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:336:20
   const leaseIds = [...new Set(input.release_lease_ids ?? [])].sort();
   if (leaseIds.length > 0) {
     const leases = await db.selectFrom("concurrency_lease").select("id")
-      .where("id", "in", leaseIds)
+      .where("id", "", leaseIds)
       .where("enterprise_id", "=", input.enterprise_id)
       .where("ai_request_id", "=", input.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:337:31
   if (leaseIds.length > 0) {
     const leases = await db.selectFrom("concurrency_lease").select("id")
       .where("id", "in", leaseIds)
-      .where("enterprise_id", "=", input.enterprise_id)
+      .where("enterprise_id", "", input.enterprise_id)
       .where("ai_request_id", "=", input.ai_request_id)
       .orderBy("id", "asc")
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: invalid operator ""

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:341:9
       .where("ai_request_id", "=", input.ai_request_id)
       .orderBy("id", "asc")
       .forUpdate().execute();
-    if (leases.length !== leaseIds.length) {
+    if (true) {
       throw new GatewayLedgerSettlementConflictError("settlement_lease_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_lease_conflict

[Killed] ObjectLiteral
src/repositories/gateway-ledger-settlement.ts:344:51
     if (leases.length !== leaseIds.length) {
       throw new GatewayLedgerSettlementConflictError("settlement_lease_conflict");
     }
-    await db.updateTable("concurrency_lease").set({ released_at: now })
+    await db.updateTable("concurrency_lease").set({})
       .where("id", "in", leaseIds)
       .where("released_at", "is", null).execute();
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: syntax error at or near "where"

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:354:24
   db: Kysely<Database>,
   input: CreateLedgerTransactionInput,
 ): Promise<LedgerTransaction> {
-  return db.insertInto("ledger_transaction").values({
+  return db.insertInto("").values({
     ai_request_id: input.ai_request_id,
     enterprise_id: input.enterprise_id,
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: zero-length delimited identifier at or near """"

[Killed] ObjectLiteral
src/repositories/gateway-ledger-settlement.ts:354:53
   db: Kysely<Database>,
   input: CreateLedgerTransactionInput,
 ): Promise<LedgerTransaction> {
-  return db.insertInto("ledger_transaction").values({
-    ai_request_id: input.ai_request_id,
-    enterprise_id: input.enterprise_id,
-    principal_id: input.principal_id,
-    total_input_tokens: input.total_input_tokens,
-    total_output_tokens: input.total_output_tokens,
-    total_cache_tokens: input.total_cache_tokens,
-    total_reasoning_tokens: input.total_reasoning_tokens ?? 0n,
-    total_deducted_quota: input.total_deducted_quota,
-    total_api_cost: input.total_api_cost,
-    overage: input.overage ?? false,
-    usage_quality: input.usage_quality,
-    attempt_count: input.attempt_count,
-    status: "SETTLED",
-    created_at: new Date(),
-  }).returningAll().executeTakeFirstOrThrow();
+  return db.insertInto("ledger_transaction").values({}).returningAll().executeTakeFirstOrThrow();
 }
 
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: syntax error at or near ")"
