[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:36:7
   assertTerminalRejectionInput(input);
   return db.transaction().execute(async (trx) => {
     const request = await trx.selectFrom("ai_request").select([
-      "status", "principal_id", "error_classification", "error_code",
+      "", "principal_id", "error_classification", "error_code",
     ]).where("id", "=", input.usage.ai_request_id)
       .where("enterprise_id", "=", input.usage.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:36:33
   assertTerminalRejectionInput(input);
   return db.transaction().execute(async (trx) => {
     const request = await trx.selectFrom("ai_request").select([
-      "status", "principal_id", "error_classification", "error_code",
+      "status", "principal_id", "", "error_code",
     ]).where("id", "=", input.usage.ai_request_id)
       .where("enterprise_id", "=", input.usage.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:38:31
     const request = await trx.selectFrom("ai_request").select([
       "status", "principal_id", "error_classification", "error_code",
     ]).where("id", "=", input.usage.ai_request_id)
-      .where("enterprise_id", "=", input.usage.enterprise_id)
+      .where("enterprise_id", "", input.usage.enterprise_id)
       .forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: invalid operator ""

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:41:9
       .where("enterprise_id", "=", input.usage.enterprise_id)
       .forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
-    if (request.principal_id !== input.ledger_line.principal_id) {
+    if (request.principal_id === input.ledger_line.principal_id) {
       throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_principal_conflict

[Killed] BlockStatement
src/repositories/gateway-ledger-terminal-rejection.ts:41:66
       .where("enterprise_id", "=", input.usage.enterprise_id)
       .forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
-    if (request.principal_id !== input.ledger_line.principal_id) {
-      throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
-    }
+    if (request.principal_id !== input.ledger_line.principal_id) {}
 
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
killedBy: POOL-043 结账与项目归属并发边界 终态重放逐项核验主体、请求终态、错误身份和 Attempt 结果
statusReason: expected [Function] to throw error including 'settlement_principal_conflict' but got 'ledger_line_conflict'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:47:9
 
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
       .where("ai_request_id", "=", input.usage.ai_request_id).executeTakeFirst();
-    if (request.status !== "IN_PROGRESS") {
+    if (false) {
       if (request.status !== "FAILED" || !existing
         || request.error_classification !== input.error_classification
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_request_terminal

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:47:9
 
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
       .where("ai_request_id", "=", input.usage.ai_request_id).executeTakeFirst();
-    if (request.status !== "IN_PROGRESS") {
+    if (request.status === "IN_PROGRESS") {
       if (request.status !== "FAILED" || !existing
         || request.error_classification !== input.error_classification
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_terminal_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:48:11
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
       .where("ai_request_id", "=", input.usage.ai_request_id).executeTakeFirst();
     if (request.status !== "IN_PROGRESS") {
-      if (request.status !== "FAILED" || !existing
-        || request.error_classification !== input.error_classification
-        || request.error_code !== input.error_code) {
+      if (true) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_terminal_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:48:11
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
       .where("ai_request_id", "=", input.usage.ai_request_id).executeTakeFirst();
     if (request.status !== "IN_PROGRESS") {
-      if (request.status !== "FAILED" || !existing
+      if (request.status === "FAILED" || !existing
         || request.error_classification !== input.error_classification
         || request.error_code !== input.error_code) {
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_terminal_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:49:12
       .where("ai_request_id", "=", input.usage.ai_request_id).executeTakeFirst();
     if (request.status !== "IN_PROGRESS") {
       if (request.status !== "FAILED" || !existing
-        || request.error_classification !== input.error_classification
+        || request.error_classification === input.error_classification
         || request.error_code !== input.error_code) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_terminal_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:49:12
       .where("ai_request_id", "=", input.usage.ai_request_id).executeTakeFirst();
     if (request.status !== "IN_PROGRESS") {
       if (request.status !== "FAILED" || !existing
-        || request.error_classification !== input.error_classification
+        || false
         || request.error_code !== input.error_code) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
killedBy: POOL-043 结账与项目归属并发边界 终态重放逐项核验主体、请求终态、错误身份和 Attempt 结果
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:50:12
     if (request.status !== "IN_PROGRESS") {
       if (request.status !== "FAILED" || !existing
         || request.error_classification !== input.error_classification
-        || request.error_code !== input.error_code) {
+        || false) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 终态重放逐项核验主体、请求终态、错误身份和 Attempt 结果
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] BlockStatement
src/repositories/gateway-ledger-terminal-rejection.ts:50:53
     if (request.status !== "IN_PROGRESS") {
       if (request.status !== "FAILED" || !existing
         || request.error_classification !== input.error_classification
-        || request.error_code !== input.error_code) {
-        throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
-      }
+        || request.error_code !== input.error_code) {}
       await assertRejectedAttemptEvidence(trx, input);
       const finalization = await buildFinalization(trx, input);
killedBy: POOL-043 结账与项目归属并发边界 终态重放逐项核验主体、请求终态、错误身份和 Attempt 结果
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] LogicalOperator
src/repositories/gateway-ledger-terminal-rejection.ts:63:25
     const finalization = await buildFinalization(trx, input);
     const finishedAt = new Date();
     await settleRequestAccounting(trx, finalization, finishedAt);
-    const transaction = existing ?? await insertLedgerTransaction(trx, finalization);
+    const transaction = existing && (await insertLedgerTransaction(trx, finalization));
     assertTransactionMatches(transaction, finalization);
     const updated = await trx.updateTable("ai_request").set({
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: Cannot read properties of undefined (reading 'ai_request_id')

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:70:20
       finished_at: finishedAt,
       error_classification: input.error_classification,
       error_code: input.error_code,
-    }).where("id", "=", input.usage.ai_request_id)
+    }).where("id", "", input.usage.ai_request_id)
       .where("enterprise_id", "=", input.usage.enterprise_id)
       .where("status", "=", "IN_PROGRESS").executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: invalid operator ""

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:73:9
     }).where("id", "=", input.usage.ai_request_id)
       .where("enterprise_id", "=", input.usage.enterprise_id)
       .where("status", "=", "IN_PROGRESS").executeTakeFirst();
-    if (Number(updated.numUpdatedRows) !== 1) {
+    if (false) {
       throw new GatewayLedgerSettlementConflictError("settlement_status_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 终态 request UPDATE 未命中时全部写入回滚
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:84:24
   const usage = input.usage;
   const line = input.ledger_line;
   const result = input.attempt_result;
-  const apiCostValid = line.resource_mode === "API"
+  const apiCostValid = line.resource_mode !== "API"
     ? line.api_cost === "0.00000000"
     : line.api_cost === null || line.api_cost === undefined;
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:84:24
   const usage = input.usage;
   const line = input.ledger_line;
   const result = input.attempt_result;
-  const apiCostValid = line.resource_mode === "API"
+  const apiCostValid = false
     ? line.api_cost === "0.00000000"
     : line.api_cost === null || line.api_cost === undefined;
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:85:7
   const line = input.ledger_line;
   const result = input.attempt_result;
   const apiCostValid = line.resource_mode === "API"
-    ? line.api_cost === "0.00000000"
+    ? true
     : line.api_cost === null || line.api_cost === undefined;
   const conflicts = [
killedBy: POOL-043 结账与项目归属并发边界 终态撤权拒绝伪造的零事实或错误身份：api-cost-unknown
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:85:7
   const line = input.ledger_line;
   const result = input.attempt_result;
   const apiCostValid = line.resource_mode === "API"
-    ? line.api_cost === "0.00000000"
+    ? false
     : line.api_cost === null || line.api_cost === undefined;
   const conflicts = [
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[NoCoverage] LogicalOperator
src/repositories/gateway-ledger-terminal-rejection.ts:86:7
   const result = input.attempt_result;
   const apiCostValid = line.resource_mode === "API"
     ? line.api_cost === "0.00000000"
-    : line.api_cost === null || line.api_cost === undefined;
+    : line.api_cost === null && line.api_cost === undefined;
   const conflicts = [
     usage.input_tokens !== 0n,

[NoCoverage] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:86:7
   const result = input.attempt_result;
   const apiCostValid = line.resource_mode === "API"
     ? line.api_cost === "0.00000000"
-    : line.api_cost === null || line.api_cost === undefined;
+    : line.api_cost !== null || line.api_cost === undefined;
   const conflicts = [
     usage.input_tokens !== 0n,

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:88:5
     ? line.api_cost === "0.00000000"
     : line.api_cost === null || line.api_cost === undefined;
   const conflicts = [
-    usage.input_tokens !== 0n,
+    usage.input_tokens === 0n,
     usage.output_tokens !== 0n,
     usage.cache_tokens !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:88:5
     ? line.api_cost === "0.00000000"
     : line.api_cost === null || line.api_cost === undefined;
   const conflicts = [
-    usage.input_tokens !== 0n,
+    true,
     usage.output_tokens !== 0n,
     usage.cache_tokens !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:89:5
     : line.api_cost === null || line.api_cost === undefined;
   const conflicts = [
     usage.input_tokens !== 0n,
-    usage.output_tokens !== 0n,
+    true,
     usage.cache_tokens !== 0n,
     (usage.reasoning_tokens ?? 0n) !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:89:5
     : line.api_cost === null || line.api_cost === undefined;
   const conflicts = [
     usage.input_tokens !== 0n,
-    usage.output_tokens !== 0n,
+    usage.output_tokens === 0n,
     usage.cache_tokens !== 0n,
     (usage.reasoning_tokens ?? 0n) !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:90:5
   const conflicts = [
     usage.input_tokens !== 0n,
     usage.output_tokens !== 0n,
-    usage.cache_tokens !== 0n,
+    usage.cache_tokens === 0n,
     (usage.reasoning_tokens ?? 0n) !== 0n,
     usage.usage_quality !== "UNKNOWN",
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:90:5
   const conflicts = [
     usage.input_tokens !== 0n,
     usage.output_tokens !== 0n,
-    usage.cache_tokens !== 0n,
+    true,
     (usage.reasoning_tokens ?? 0n) !== 0n,
     usage.usage_quality !== "UNKNOWN",
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:91:5
     usage.input_tokens !== 0n,
     usage.output_tokens !== 0n,
     usage.cache_tokens !== 0n,
-    (usage.reasoning_tokens ?? 0n) !== 0n,
+    true,
     usage.usage_quality !== "UNKNOWN",
     (usage.upstream_usage_id ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:91:5
     usage.input_tokens !== 0n,
     usage.output_tokens !== 0n,
     usage.cache_tokens !== 0n,
-    (usage.reasoning_tokens ?? 0n) !== 0n,
+    (usage.reasoning_tokens ?? 0n) === 0n,
     usage.usage_quality !== "UNKNOWN",
     (usage.upstream_usage_id ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:92:5
     usage.output_tokens !== 0n,
     usage.cache_tokens !== 0n,
     (usage.reasoning_tokens ?? 0n) !== 0n,
-    usage.usage_quality !== "UNKNOWN",
+    true,
     (usage.upstream_usage_id ?? null) !== null,
     line.raw_input_tokens !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:92:5
     usage.output_tokens !== 0n,
     usage.cache_tokens !== 0n,
     (usage.reasoning_tokens ?? 0n) !== 0n,
-    usage.usage_quality !== "UNKNOWN",
+    usage.usage_quality === "UNKNOWN",
     (usage.upstream_usage_id ?? null) !== null,
     line.raw_input_tokens !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:93:5
     usage.cache_tokens !== 0n,
     (usage.reasoning_tokens ?? 0n) !== 0n,
     usage.usage_quality !== "UNKNOWN",
-    (usage.upstream_usage_id ?? null) !== null,
+    (usage.upstream_usage_id ?? null) === null,
     line.raw_input_tokens !== 0n,
     line.raw_output_tokens !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] LogicalOperator
src/repositories/gateway-ledger-terminal-rejection.ts:93:6
     usage.cache_tokens !== 0n,
     (usage.reasoning_tokens ?? 0n) !== 0n,
     usage.usage_quality !== "UNKNOWN",
-    (usage.upstream_usage_id ?? null) !== null,
+    (usage.upstream_usage_id && null) !== null,
     line.raw_input_tokens !== 0n,
     line.raw_output_tokens !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:94:5
     (usage.reasoning_tokens ?? 0n) !== 0n,
     usage.usage_quality !== "UNKNOWN",
     (usage.upstream_usage_id ?? null) !== null,
-    line.raw_input_tokens !== 0n,
+    true,
     line.raw_output_tokens !== 0n,
     line.raw_cache_tokens !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:94:5
     (usage.reasoning_tokens ?? 0n) !== 0n,
     usage.usage_quality !== "UNKNOWN",
     (usage.upstream_usage_id ?? null) !== null,
-    line.raw_input_tokens !== 0n,
+    line.raw_input_tokens === 0n,
     line.raw_output_tokens !== 0n,
     line.raw_cache_tokens !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:95:5
     usage.usage_quality !== "UNKNOWN",
     (usage.upstream_usage_id ?? null) !== null,
     line.raw_input_tokens !== 0n,
-    line.raw_output_tokens !== 0n,
+    true,
     line.raw_cache_tokens !== 0n,
     (line.raw_reasoning_tokens ?? 0n) !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:95:5
     usage.usage_quality !== "UNKNOWN",
     (usage.upstream_usage_id ?? null) !== null,
     line.raw_input_tokens !== 0n,
-    line.raw_output_tokens !== 0n,
+    line.raw_output_tokens === 0n,
     line.raw_cache_tokens !== 0n,
     (line.raw_reasoning_tokens ?? 0n) !== 0n,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:96:5
     (usage.upstream_usage_id ?? null) !== null,
     line.raw_input_tokens !== 0n,
     line.raw_output_tokens !== 0n,
-    line.raw_cache_tokens !== 0n,
+    line.raw_cache_tokens === 0n,
     (line.raw_reasoning_tokens ?? 0n) !== 0n,
     (line.deducted_quota ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:96:5
     (usage.upstream_usage_id ?? null) !== null,
     line.raw_input_tokens !== 0n,
     line.raw_output_tokens !== 0n,
-    line.raw_cache_tokens !== 0n,
+    true,
     (line.raw_reasoning_tokens ?? 0n) !== 0n,
     (line.deducted_quota ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:97:5
     line.raw_input_tokens !== 0n,
     line.raw_output_tokens !== 0n,
     line.raw_cache_tokens !== 0n,
-    (line.raw_reasoning_tokens ?? 0n) !== 0n,
+    true,
     (line.deducted_quota ?? null) !== null,
     line.usage_quality !== "UNKNOWN",
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:97:5
     line.raw_input_tokens !== 0n,
     line.raw_output_tokens !== 0n,
     line.raw_cache_tokens !== 0n,
-    (line.raw_reasoning_tokens ?? 0n) !== 0n,
+    (line.raw_reasoning_tokens ?? 0n) === 0n,
     (line.deducted_quota ?? null) !== null,
     line.usage_quality !== "UNKNOWN",
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:98:5
     line.raw_output_tokens !== 0n,
     line.raw_cache_tokens !== 0n,
     (line.raw_reasoning_tokens ?? 0n) !== 0n,
-    (line.deducted_quota ?? null) !== null,
+    true,
     line.usage_quality !== "UNKNOWN",
     !apiCostValid,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:98:5
     line.raw_output_tokens !== 0n,
     line.raw_cache_tokens !== 0n,
     (line.raw_reasoning_tokens ?? 0n) !== 0n,
-    (line.deducted_quota ?? null) !== null,
+    (line.deducted_quota ?? null) === null,
     line.usage_quality !== "UNKNOWN",
     !apiCostValid,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:99:5
     line.raw_cache_tokens !== 0n,
     (line.raw_reasoning_tokens ?? 0n) !== 0n,
     (line.deducted_quota ?? null) !== null,
-    line.usage_quality !== "UNKNOWN",
+    line.usage_quality === "UNKNOWN",
     !apiCostValid,
     (line.billing_rule_id ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:99:5
     line.raw_cache_tokens !== 0n,
     (line.raw_reasoning_tokens ?? 0n) !== 0n,
     (line.deducted_quota ?? null) !== null,
-    line.usage_quality !== "UNKNOWN",
+    true,
     !apiCostValid,
     (line.billing_rule_id ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] BooleanLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:100:5
     (line.raw_reasoning_tokens ?? 0n) !== 0n,
     (line.deducted_quota ?? null) !== null,
     line.usage_quality !== "UNKNOWN",
-    !apiCostValid,
+    apiCostValid,
     (line.billing_rule_id ?? null) !== null,
     (line.rule_version ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:101:5
     (line.deducted_quota ?? null) !== null,
     line.usage_quality !== "UNKNOWN",
     !apiCostValid,
-    (line.billing_rule_id ?? null) !== null,
+    true,
     (line.rule_version ?? null) !== null,
     (line.multiplier ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:101:5
     (line.deducted_quota ?? null) !== null,
     line.usage_quality !== "UNKNOWN",
     !apiCostValid,
-    (line.billing_rule_id ?? null) !== null,
+    (line.billing_rule_id ?? null) === null,
     (line.rule_version ?? null) !== null,
     (line.multiplier ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:102:5
     line.usage_quality !== "UNKNOWN",
     !apiCostValid,
     (line.billing_rule_id ?? null) !== null,
-    (line.rule_version ?? null) !== null,
+    true,
     (line.multiplier ?? null) !== null,
     (line.billing_rule_snapshot ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:102:5
     line.usage_quality !== "UNKNOWN",
     !apiCostValid,
     (line.billing_rule_id ?? null) !== null,
-    (line.rule_version ?? null) !== null,
+    (line.rule_version ?? null) === null,
     (line.multiplier ?? null) !== null,
     (line.billing_rule_snapshot ?? null) !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:103:5
     !apiCostValid,
     (line.billing_rule_id ?? null) !== null,
     (line.rule_version ?? null) !== null,
-    (line.multiplier ?? null) !== null,
+    true,
     (line.billing_rule_snapshot ?? null) !== null,
     result.response_committed,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:103:5
     !apiCostValid,
     (line.billing_rule_id ?? null) !== null,
     (line.rule_version ?? null) !== null,
-    (line.multiplier ?? null) !== null,
+    (line.multiplier ?? null) === null,
     (line.billing_rule_snapshot ?? null) !== null,
     result.response_committed,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:104:5
     (line.billing_rule_id ?? null) !== null,
     (line.rule_version ?? null) !== null,
     (line.multiplier ?? null) !== null,
-    (line.billing_rule_snapshot ?? null) !== null,
+    true,
     result.response_committed,
     result.switch_reason !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:104:5
     (line.billing_rule_id ?? null) !== null,
     (line.rule_version ?? null) !== null,
     (line.multiplier ?? null) !== null,
-    (line.billing_rule_snapshot ?? null) !== null,
+    (line.billing_rule_snapshot ?? null) === null,
     result.response_committed,
     result.switch_reason !== null,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:106:5
     (line.multiplier ?? null) !== null,
     (line.billing_rule_snapshot ?? null) !== null,
     result.response_committed,
-    result.switch_reason !== null,
+    result.switch_reason === null,
     result.error_classification !== input.error_classification,
     result.error_code !== input.error_code,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:106:5
     (line.multiplier ?? null) !== null,
     (line.billing_rule_snapshot ?? null) !== null,
     result.response_committed,
-    result.switch_reason !== null,
+    true,
     result.error_classification !== input.error_classification,
     result.error_code !== input.error_code,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:107:5
     (line.billing_rule_snapshot ?? null) !== null,
     result.response_committed,
     result.switch_reason !== null,
-    result.error_classification !== input.error_classification,
+    true,
     result.error_code !== input.error_code,
   ];
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict
