[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:107:5
     (line.billing_rule_snapshot ?? null) !== null,
     result.response_committed,
     result.switch_reason !== null,
-    result.error_classification !== input.error_classification,
+    result.error_classification === input.error_classification,
     result.error_code !== input.error_code,
   ];
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:108:5
     result.response_committed,
     result.switch_reason !== null,
     result.error_classification !== input.error_classification,
-    result.error_code !== input.error_code,
+    result.error_code === input.error_code,
   ];
   if (conflicts.includes(true)) {
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:108:5
     result.response_committed,
     result.switch_reason !== null,
     result.error_classification !== input.error_classification,
-    result.error_code !== input.error_code,
+    true,
   ];
   if (conflicts.includes(true)) {
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] BooleanLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:110:26
     result.error_classification !== input.error_classification,
     result.error_code !== input.error_code,
   ];
-  if (conflicts.includes(true)) {
+  if (conflicts.includes(false)) {
     throw new GatewayLedgerSettlementConflictError("terminal_rejection_fact_conflict");
   }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: terminal_rejection_fact_conflict

[Killed] BlockStatement
src/repositories/gateway-ledger-terminal-rejection.ts:110:33
     result.error_classification !== input.error_classification,
     result.error_code !== input.error_code,
   ];
-  if (conflicts.includes(true)) {
-    throw new GatewayLedgerSettlementConflictError("terminal_rejection_fact_conflict");
-  }
+  if (conflicts.includes(true)) {}
 }
 
killedBy: POOL-043 结账与项目归属并发边界 终态撤权拒绝伪造的零事实或错误身份：nonzero
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:111:52
     result.error_code !== input.error_code,
   ];
   if (conflicts.includes(true)) {
-    throw new GatewayLedgerSettlementConflictError("terminal_rejection_fact_conflict");
+    throw new GatewayLedgerSettlementConflictError("");
   }
 }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权拒绝伪造的零事实或错误身份：nonzero
statusReason: expected [Function] to throw error including 'terminal_rejection_fact_conflict' but got ''

[Killed] ObjectLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:122:10
   const facts = await loadRequestSettlementFacts(
     trx, input.usage.enterprise_id, input.usage.ai_request_id,
   );
-  return {
-    ai_request_id: input.usage.ai_request_id,
-    enterprise_id: input.usage.enterprise_id,
-    principal_id: input.ledger_line.principal_id,
-    total_input_tokens: facts.totalInputTokens,
-    total_output_tokens: facts.totalOutputTokens,
-    total_cache_tokens: facts.totalCacheTokens,
-    total_reasoning_tokens: facts.totalReasoningTokens,
-    total_deducted_quota: facts.totalDeductedQuota,
-    total_api_cost: facts.totalApiCost,
-    usage_quality: summarizeLedgerUsageQuality(
-      facts.usageQualities.map((usage_quality) => ({ usage_quality })),
-    ),
-    attempt_count: facts.attemptCount,
-    overage: input.overage ?? false,
-    request_status: "FAILED",
-    error_classification: input.error_classification,
-    error_code: input.error_code,
-    quota_settlements: input.quota_settlements,
-    release_lease_ids: input.release_lease_ids,
-  };
+  return {};
 }
 
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: null value in column "ai_request_id" of relation "ledger_transaction" violates not-null constraint

[Killed] ArrowFunction
src/repositories/gateway-ledger-terminal-rejection.ts:133:32
     total_deducted_quota: facts.totalDeductedQuota,
     total_api_cost: facts.totalApiCost,
     usage_quality: summarizeLedgerUsageQuality(
-      facts.usageQualities.map((usage_quality) => ({ usage_quality })),
+      facts.usageQualities.map(() => undefined),
     ),
     attempt_count: facts.attemptCount,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: Cannot read properties of undefined (reading 'usage_quality')

[Killed] ObjectLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:133:52
     total_deducted_quota: facts.totalDeductedQuota,
     total_api_cost: facts.totalApiCost,
     usage_quality: summarizeLedgerUsageQuality(
-      facts.usageQualities.map((usage_quality) => ({ usage_quality })),
+      facts.usageQualities.map((usage_quality) => ({})),
     ),
     attempt_count: facts.attemptCount,
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: null value in column "usage_quality" of relation "ledger_transaction" violates not-null constraint

[Survived] LogicalOperator
src/repositories/gateway-ledger-terminal-rejection.ts:136:14
       facts.usageQualities.map((usage_quality) => ({ usage_quality })),
     ),
     attempt_count: facts.attemptCount,
-    overage: input.overage ?? false,
+    overage: input.overage && false,
     request_status: "FAILED",
     error_classification: input.error_classification,

[NoCoverage] BooleanLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:136:31
       facts.usageQualities.map((usage_quality) => ({ usage_quality })),
     ),
     attempt_count: facts.attemptCount,
-    overage: input.overage ?? false,
+    overage: input.overage ?? true,
     request_status: "FAILED",
     error_classification: input.error_classification,

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:150:61
   input: FinalizeRejectedAttemptSettlementInput,
 ): Promise<void> {
   const attempt = await trx.selectFrom("upstream_attempt")
-    .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
+    .innerJoin("provider_resource", "provider_resource.id", "")
     .select([
       "upstream_attempt.finished_at", "upstream_attempt.http_status",
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] ArrayDeclaration
src/repositories/gateway-ledger-terminal-rejection.ts:151:13
 ): Promise<void> {
   const attempt = await trx.selectFrom("upstream_attempt")
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
-    .select([
-      "upstream_attempt.finished_at", "upstream_attempt.http_status",
-      "upstream_attempt.response_committed", "upstream_attempt.error_classification",
-      "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
-    ]).where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
+    .select([]).where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
     .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
     .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:152:7
   const attempt = await trx.selectFrom("upstream_attempt")
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
     .select([
-      "upstream_attempt.finished_at", "upstream_attempt.http_status",
+      "", "upstream_attempt.http_status",
       "upstream_attempt.response_committed", "upstream_attempt.error_classification",
       "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:153:7
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
     .select([
       "upstream_attempt.finished_at", "upstream_attempt.http_status",
-      "upstream_attempt.response_committed", "upstream_attempt.error_classification",
+      "", "upstream_attempt.error_classification",
       "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
     ]).where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:154:38
     .select([
       "upstream_attempt.finished_at", "upstream_attempt.http_status",
       "upstream_attempt.response_committed", "upstream_attempt.error_classification",
-      "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
+      "upstream_attempt.error_code", "", "provider_resource.mode",
     ]).where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
     .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:155:14
       "upstream_attempt.finished_at", "upstream_attempt.http_status",
       "upstream_attempt.response_committed", "upstream_attempt.error_classification",
       "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
-    ]).where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
+    ]).where("", "=", input.usage.upstream_attempt_id)
     .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
     .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:162:51
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id)
     .executeTakeFirst();
   const result = input.attempt_result;
-  if (!attempt || attempt.finished_at === null || attempt.mode !== input.ledger_line.resource_mode
+  if (!attempt || attempt.finished_at === null || attempt.mode === input.ledger_line.resource_mode
     || attempt.http_status !== result.http_status
     || attempt.response_committed !== result.response_committed
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Killed] LogicalOperator
src/repositories/gateway-ledger-terminal-rejection.ts:162:7
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id)
     .executeTakeFirst();
   const result = input.attempt_result;
-  if (!attempt || attempt.finished_at === null || attempt.mode !== input.ledger_line.resource_mode
-    || attempt.http_status !== result.http_status
+  if ((!attempt || attempt.finished_at === null || attempt.mode !== input.ledger_line.resource_mode) && attempt.http_status !== result.http_status
     || attempt.response_committed !== result.response_committed
     || attempt.error_classification !== result.error_classification
killedBy: POOL-043 结账与项目归属并发边界 终态重放逐项核验主体、请求终态、错误身份和 Attempt 结果
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:163:8
     .executeTakeFirst();
   const result = input.attempt_result;
   if (!attempt || attempt.finished_at === null || attempt.mode !== input.ledger_line.resource_mode
-    || attempt.http_status !== result.http_status
+    || false
     || attempt.response_committed !== result.response_committed
     || attempt.error_classification !== result.error_classification
killedBy: POOL-043 结账与项目归属并发边界 终态重放逐项核验主体、请求终态、错误身份和 Attempt 结果
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:163:8
     .executeTakeFirst();
   const result = input.attempt_result;
   if (!attempt || attempt.finished_at === null || attempt.mode !== input.ledger_line.resource_mode
-    || attempt.http_status !== result.http_status
+    || attempt.http_status === result.http_status
     || attempt.response_committed !== result.response_committed
     || attempt.error_classification !== result.error_classification
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:164:8
   const result = input.attempt_result;
   if (!attempt || attempt.finished_at === null || attempt.mode !== input.ledger_line.resource_mode
     || attempt.http_status !== result.http_status
-    || attempt.response_committed !== result.response_committed
+    || attempt.response_committed === result.response_committed
     || attempt.error_classification !== result.error_classification
     || attempt.error_code !== result.error_code
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Survived] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:164:8
   const result = input.attempt_result;
   if (!attempt || attempt.finished_at === null || attempt.mode !== input.ledger_line.resource_mode
     || attempt.http_status !== result.http_status
-    || attempt.response_committed !== result.response_committed
+    || false
     || attempt.error_classification !== result.error_classification
     || attempt.error_code !== result.error_code

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:165:8
   if (!attempt || attempt.finished_at === null || attempt.mode !== input.ledger_line.resource_mode
     || attempt.http_status !== result.http_status
     || attempt.response_committed !== result.response_committed
-    || attempt.error_classification !== result.error_classification
+    || attempt.error_classification === result.error_classification
     || attempt.error_code !== result.error_code
     || attempt.switch_reason !== result.switch_reason) {
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Survived] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:165:8
   if (!attempt || attempt.finished_at === null || attempt.mode !== input.ledger_line.resource_mode
     || attempt.http_status !== result.http_status
     || attempt.response_committed !== result.response_committed
-    || attempt.error_classification !== result.error_classification
+    || false
     || attempt.error_code !== result.error_code
     || attempt.switch_reason !== result.switch_reason) {

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:166:8
     || attempt.http_status !== result.http_status
     || attempt.response_committed !== result.response_committed
     || attempt.error_classification !== result.error_classification
-    || attempt.error_code !== result.error_code
+    || attempt.error_code === result.error_code
     || attempt.switch_reason !== result.switch_reason) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Survived] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:166:8
     || attempt.http_status !== result.http_status
     || attempt.response_committed !== result.response_committed
     || attempt.error_classification !== result.error_classification
-    || attempt.error_code !== result.error_code
+    || false
     || attempt.switch_reason !== result.switch_reason) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");

[Killed] BlockStatement
src/repositories/gateway-ledger-terminal-rejection.ts:167:56
     || attempt.response_committed !== result.response_committed
     || attempt.error_classification !== result.error_classification
     || attempt.error_code !== result.error_code
-    || attempt.switch_reason !== result.switch_reason) {
-    throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
-  }
+    || attempt.switch_reason !== result.switch_reason) {}
   const usage = await trx.selectFrom("usage_event").selectAll()
     .where("dedup_key", "=", input.usage.dedup_key).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 终态重放逐项核验主体、请求终态、错误身份和 Attempt 结果
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:167:8
     || attempt.response_committed !== result.response_committed
     || attempt.error_classification !== result.error_classification
     || attempt.error_code !== result.error_code
-    || attempt.switch_reason !== result.switch_reason) {
+    || attempt.switch_reason === result.switch_reason) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
   }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:172:7
   }
   const usage = await trx.selectFrom("usage_event").selectAll()
     .where("dedup_key", "=", input.usage.dedup_key).executeTakeFirst();
-  if (!usage) throw new GatewayLedgerSettlementConflictError("settlement_usage_missing");
+  if (true) throw new GatewayLedgerSettlementConflictError("settlement_usage_missing");
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_usage_missing

[Killed] BooleanLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:172:7
   }
   const usage = await trx.selectFrom("usage_event").selectAll()
     .where("dedup_key", "=", input.usage.dedup_key).executeTakeFirst();
-  if (!usage) throw new GatewayLedgerSettlementConflictError("settlement_usage_missing");
+  if (usage) throw new GatewayLedgerSettlementConflictError("settlement_usage_missing");
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_usage_missing

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:174:38
     .where("dedup_key", "=", input.usage.dedup_key).executeTakeFirst();
   if (!usage) throw new GatewayLedgerSettlementConflictError("settlement_usage_missing");
   assertUsageMatches(usage, input);
-  const lines = await trx.selectFrom("ledger_line").selectAll()
+  const lines = await trx.selectFrom("").selectAll()
     .where("usage_event_id", "=", usage.id).execute();
   if (lines.length !== 1) {
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:175:30
   if (!usage) throw new GatewayLedgerSettlementConflictError("settlement_usage_missing");
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
-    .where("usage_event_id", "=", usage.id).execute();
+    .where("usage_event_id", "", usage.id).execute();
   if (lines.length !== 1) {
     throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-terminal-rejection.ts:175:12
   if (!usage) throw new GatewayLedgerSettlementConflictError("settlement_usage_missing");
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
-    .where("usage_event_id", "=", usage.id).execute();
+    .where("", "=", usage.id).execute();
   if (lines.length !== 1) {
     throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] ConditionalExpression
src/repositories/gateway-ledger-terminal-rejection.ts:176:7
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
     .where("usage_event_id", "=", usage.id).execute();
-  if (lines.length !== 1) {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
   }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: duplicate_ledger_line

[Killed] EqualityOperator
src/repositories/gateway-ledger-terminal-rejection.ts:176:7
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
     .where("usage_event_id", "=", usage.id).execute();
-  if (lines.length !== 1) {
+  if (lines.length === 1) {
     throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
   }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: duplicate_ledger_line
