[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:38:11
 /** 多 Attempt 请求的 transaction 口径必须显式保留混合质量，不能由行顺序决定。 */
 export function summarizeLedgerUsageQuality(
   lines: ReadonlyArray<Pick<LedgerLine, "usage_quality">>,
-): string {
-  const qualities = [...new Set(lines.map((line) => line.usage_quality))].sort();
-  if (qualities.length === 0) return "UNKNOWN";
-  return qualities.length === 1 ? qualities[0]! : `MIXED:${qualities.join("+")}`;
-}
+): string {}
 
 /** 上游访问前持久化唯一 attempt，但不在网络调用期间占用数据库连接。 */
killedBy: POOL-043 transaction 用量质量 无明细 fail-closed 为 UNKNOWN
statusReason: expected undefined to be 'UNKNOWN' // Object.is equality

[Killed] MethodExpression
src/repositories/gateway-ledger-settlement.ts:39:21
 export function summarizeLedgerUsageQuality(
   lines: ReadonlyArray<Pick<LedgerLine, "usage_quality">>,
 ): string {
-  const qualities = [...new Set(lines.map((line) => line.usage_quality))].sort();
+  const qualities = [...new Set(lines.map(line => line.usage_quality))];
   if (qualities.length === 0) return "UNKNOWN";
   return qualities.length === 1 ? qualities[0]! : `MIXED:${qualities.join("+")}`;
killedBy: POOL-043 transaction 用量质量 多质量排序后生成稳定 MIXED 口径，不依赖行顺序
statusReason: expected 'MIXED:UNKNOWN+PROVIDER_REPORTED' to be 'MIXED:PROVIDER_REPORTED+UNKNOWN' // Object.is equality

[Killed] ArrowFunction
src/repositories/gateway-ledger-settlement.ts:39:43
 export function summarizeLedgerUsageQuality(
   lines: ReadonlyArray<Pick<LedgerLine, "usage_quality">>,
 ): string {
-  const qualities = [...new Set(lines.map((line) => line.usage_quality))].sort();
+  const qualities = [...new Set(lines.map(() => undefined))].sort();
   if (qualities.length === 0) return "UNKNOWN";
   return qualities.length === 1 ? qualities[0]! : `MIXED:${qualities.join("+")}`;
killedBy: POOL-043 transaction 用量质量 单一质量原样冻结
statusReason: expected undefined to be 'PROVIDER_REPORTED' // Object.is equality

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:40:7
   lines: ReadonlyArray<Pick<LedgerLine, "usage_quality">>,
 ): string {
   const qualities = [...new Set(lines.map((line) => line.usage_quality))].sort();
-  if (qualities.length === 0) return "UNKNOWN";
+  if (true) return "UNKNOWN";
   return qualities.length === 1 ? qualities[0]! : `MIXED:${qualities.join("+")}`;
 }
killedBy: POOL-043 transaction 用量质量 单一质量原样冻结
statusReason: expected 'UNKNOWN' to be 'PROVIDER_REPORTED' // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:40:7
   lines: ReadonlyArray<Pick<LedgerLine, "usage_quality">>,
 ): string {
   const qualities = [...new Set(lines.map((line) => line.usage_quality))].sort();
-  if (qualities.length === 0) return "UNKNOWN";
+  if (qualities.length !== 0) return "UNKNOWN";
   return qualities.length === 1 ? qualities[0]! : `MIXED:${qualities.join("+")}`;
 }
killedBy: POOL-043 transaction 用量质量 无明细 fail-closed 为 UNKNOWN
statusReason: expected 'MIXED:' to be 'UNKNOWN' // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:41:10
 ): string {
   const qualities = [...new Set(lines.map((line) => line.usage_quality))].sort();
   if (qualities.length === 0) return "UNKNOWN";
-  return qualities.length === 1 ? qualities[0]! : `MIXED:${qualities.join("+")}`;
+  return qualities.length !== 1 ? qualities[0]! : `MIXED:${qualities.join("+")}`;
 }
 
killedBy: POOL-043 transaction 用量质量 单一质量原样冻结
statusReason: expected 'MIXED:PROVIDER_REPORTED' to be 'PROVIDER_REPORTED' // Object.is equality

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:41:10
 ): string {
   const qualities = [...new Set(lines.map((line) => line.usage_quality))].sort();
   if (qualities.length === 0) return "UNKNOWN";
-  return qualities.length === 1 ? qualities[0]! : `MIXED:${qualities.join("+")}`;
+  return true ? qualities[0]! : `MIXED:${qualities.join("+")}`;
 }
 
killedBy: POOL-043 transaction 用量质量 多质量排序后生成稳定 MIXED 口径，不依赖行顺序
statusReason: expected 'PROVIDER_REPORTED' to be 'MIXED:PROVIDER_REPORTED+UNKNOWN' // Object.is equality

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:50:50
   input: CreateAttemptInput,
 ): Promise<UpstreamAttempt> {
   const startedAt = new Date();
-  return db.transaction().execute(async (trx) => {
-    await lockInProgressRequest(trx, input.enterprise_id, input.ai_request_id);
-    const resource = await trx.selectFrom("provider_resource").select("id")
-      .where("id", "=", input.provider_resource_id)
-      .where("enterprise_id", "=", input.enterprise_id).executeTakeFirst();
-    if (!resource) throw new GatewayLedgerSettlementConflictError("attempt_resource_conflict");
-    const existing = await trx.selectFrom("upstream_attempt").selectAll()
-      .where("enterprise_id", "=", input.enterprise_id)
-      .where("ai_request_id", "=", input.ai_request_id)
-      .where("attempt_no", "=", input.attempt_no)
-      .executeTakeFirst();
-    if (existing) {
-      assertAttemptMatches(existing, input);
-      throw new GatewayLedgerSettlementConflictError("attempt_already_started");
-    }
-    await guardOperatingBillLedgerWrite(trx, input.enterprise_id, startedAt);
-    return trx.insertInto("upstream_attempt").values({
-      ai_request_id: input.ai_request_id,
-      enterprise_id: input.enterprise_id,
-      attempt_no: input.attempt_no,
-      provider_resource_id: input.provider_resource_id,
-      upstream_model: input.upstream_model,
-      started_at: startedAt,
-    }).returningAll().executeTakeFirstOrThrow();
-  });
+  return db.transaction().execute(async (trx) => {});
 }
 
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: promise resolved "{ gaps: [ { …(8) }, { …(6) } ], …(17) }" instead of rejecting

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:53:14
   return db.transaction().execute(async (trx) => {
     await lockInProgressRequest(trx, input.enterprise_id, input.ai_request_id);
     const resource = await trx.selectFrom("provider_resource").select("id")
-      .where("id", "=", input.provider_resource_id)
+      .where("", "=", input.provider_resource_id)
       .where("enterprise_id", "=", input.enterprise_id).executeTakeFirst();
     if (!resource) throw new GatewayLedgerSettlementConflictError("attempt_resource_conflict");
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: zero-length delimited identifier at or near """"

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:55:9
     const resource = await trx.selectFrom("provider_resource").select("id")
       .where("id", "=", input.provider_resource_id)
       .where("enterprise_id", "=", input.enterprise_id).executeTakeFirst();
-    if (!resource) throw new GatewayLedgerSettlementConflictError("attempt_resource_conflict");
+    if (true) throw new GatewayLedgerSettlementConflictError("attempt_resource_conflict");
     const existing = await trx.selectFrom("upstream_attempt").selectAll()
       .where("enterprise_id", "=", input.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: attempt_resource_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:55:9
     const resource = await trx.selectFrom("provider_resource").select("id")
       .where("id", "=", input.provider_resource_id)
       .where("enterprise_id", "=", input.enterprise_id).executeTakeFirst();
-    if (!resource) throw new GatewayLedgerSettlementConflictError("attempt_resource_conflict");
+    if (false) throw new GatewayLedgerSettlementConflictError("attempt_resource_conflict");
     const existing = await trx.selectFrom("upstream_attempt").selectAll()
       .where("enterprise_id", "=", input.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 attempt 创建拒绝不存在资源、重复启动与重复身份漂移
statusReason: expected [Function] to throw error including 'attempt_resource_conflict' but got 'insert or update on table "upstream_a…'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:61:9
       .where("ai_request_id", "=", input.ai_request_id)
       .where("attempt_no", "=", input.attempt_no)
       .executeTakeFirst();
-    if (existing) {
+    if (true) {
       assertAttemptMatches(existing, input);
       throw new GatewayLedgerSettlementConflictError("attempt_already_started");
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: Cannot read properties of undefined (reading 'enterprise_id')

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:61:9
       .where("ai_request_id", "=", input.ai_request_id)
       .where("attempt_no", "=", input.attempt_no)
       .executeTakeFirst();
-    if (existing) {
+    if (false) {
       assertAttemptMatches(existing, input);
       throw new GatewayLedgerSettlementConflictError("attempt_already_started");
killedBy: POOL-043 结账与项目归属并发边界 attempt 创建拒绝不存在资源、重复启动与重复身份漂移
statusReason: expected [Function] to throw error including 'attempt_already_started' but got 'duplicate key value violates unique c…'

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:66:27
       throw new GatewayLedgerSettlementConflictError("attempt_already_started");
     }
     await guardOperatingBillLedgerWrite(trx, input.enterprise_id, startedAt);
-    return trx.insertInto("upstream_attempt").values({
+    return trx.insertInto("").values({
       ai_request_id: input.ai_request_id,
       enterprise_id: input.enterprise_id,
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: zero-length delimited identifier at or near """"

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:83:35
  */
 export async function createUsageLedgerLineAtomically(
   db: Kysely<Database>, input: CreateUsageLedgerLineInput,
-): Promise<UsageLedgerLineResult> {
-  return db.transaction().execute((trx) => persistUsageLedgerLine(trx, input));
-}
+): Promise<UsageLedgerLineResult> {}
 
 /**
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ArrowFunction
src/repositories/gateway-ledger-settlement.ts:84:35
 export async function createUsageLedgerLineAtomically(
   db: Kysely<Database>, input: CreateUsageLedgerLineInput,
 ): Promise<UsageLedgerLineResult> {
-  return db.transaction().execute((trx) => persistUsageLedgerLine(trx, input));
+  return db.transaction().execute(() => undefined);
 }
 
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:98:35
 export async function persistAttemptUsageAccountingAtomically(
   db: Kysely<Database>,
   input: PersistAttemptUsageAccountingInput,
-): Promise<UsageLedgerLineResult> {
-  return db.transaction().execute(async (trx) => {
-    const result = await persistUsageLedgerLine(trx, input, input.attempt_result);
-    if (result.created) {
-      await settleRequestAccounting(trx, {
-        ai_request_id: input.usage.ai_request_id,
-        enterprise_id: input.usage.enterprise_id,
-        principal_id: input.ledger_line.principal_id,
-        quota_settlements: input.quota_settlements,
-        release_lease_ids: input.release_lease_ids,
-      }, new Date());
-    }
-    return result;
-  });
-}
+): Promise<UsageLedgerLineResult> {}
 
 export async function persistUsageLedgerLine(
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:99:50
   db: Kysely<Database>,
   input: PersistAttemptUsageAccountingInput,
 ): Promise<UsageLedgerLineResult> {
-  return db.transaction().execute(async (trx) => {
-    const result = await persistUsageLedgerLine(trx, input, input.attempt_result);
-    if (result.created) {
-      await settleRequestAccounting(trx, {
-        ai_request_id: input.usage.ai_request_id,
-        enterprise_id: input.usage.enterprise_id,
-        principal_id: input.ledger_line.principal_id,
-        quota_settlements: input.quota_settlements,
-        release_lease_ids: input.release_lease_ids,
-      }, new Date());
-    }
-    return result;
-  });
+  return db.transaction().execute(async (trx) => {});
 }
 
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:101:9
 ): Promise<UsageLedgerLineResult> {
   return db.transaction().execute(async (trx) => {
     const result = await persistUsageLedgerLine(trx, input, input.attempt_result);
-    if (result.created) {
+    if (false) {
       await settleRequestAccounting(trx, {
         ai_request_id: input.usage.ai_request_id,
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:101:25
 ): Promise<UsageLedgerLineResult> {
   return db.transaction().execute(async (trx) => {
     const result = await persistUsageLedgerLine(trx, input, input.attempt_result);
-    if (result.created) {
-      await settleRequestAccounting(trx, {
-        ai_request_id: input.usage.ai_request_id,
-        enterprise_id: input.usage.enterprise_id,
-        principal_id: input.ledger_line.principal_id,
-        quota_settlements: input.quota_settlements,
-        release_lease_ids: input.release_lease_ids,
-      }, new Date());
-    }
+    if (result.created) {}
     return result;
   });
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:123:7
   const request = await lockInProgressRequest(
     trx, input.usage.enterprise_id, input.usage.ai_request_id,
   );
-  if (request.principal_id !== input.ledger_line.principal_id) {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
   }
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: settlement_principal_conflict to be an instance of OperatingBillClosedError

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:123:64
   const request = await lockInProgressRequest(
     trx, input.usage.enterprise_id, input.usage.ai_request_id,
   );
-  if (request.principal_id !== input.ledger_line.principal_id) {
-    throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
-  }
+  if (request.principal_id !== input.ledger_line.principal_id) {}
   let attemptQuery = trx.selectFrom("upstream_attempt")
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: principal_id: expected [Function] to throw error including 'settlement_principal_conflict' but got 'ledger_line_conflict'

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:127:16
     throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
   }
   let attemptQuery = trx.selectFrom("upstream_attempt")
-    .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
+    .innerJoin("", "provider_resource.id", "upstream_attempt.provider_resource_id")
     .select([
       "upstream_attempt.id", "upstream_attempt.finished_at", "upstream_attempt.http_status",
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] ArrayDeclaration
src/repositories/gateway-ledger-settlement.ts:128:13
   }
   let attemptQuery = trx.selectFrom("upstream_attempt")
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
-    .select([
-      "upstream_attempt.id", "upstream_attempt.finished_at", "upstream_attempt.http_status",
-      "upstream_attempt.response_committed", "upstream_attempt.error_classification",
-      "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
-    ])
+    .select([])
     .where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
     .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: settlement_resource_mode_conflict to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:130:7
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
     .select([
       "upstream_attempt.id", "upstream_attempt.finished_at", "upstream_attempt.http_status",
-      "upstream_attempt.response_committed", "upstream_attempt.error_classification",
+      "", "upstream_attempt.error_classification",
       "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
     ])
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:130:46
     .innerJoin("provider_resource", "provider_resource.id", "upstream_attempt.provider_resource_id")
     .select([
       "upstream_attempt.id", "upstream_attempt.finished_at", "upstream_attempt.http_status",
-      "upstream_attempt.response_committed", "upstream_attempt.error_classification",
+      "upstream_attempt.response_committed", "",
       "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
     ])
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:131:72
     .select([
       "upstream_attempt.id", "upstream_attempt.finished_at", "upstream_attempt.http_status",
       "upstream_attempt.response_committed", "upstream_attempt.error_classification",
-      "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
+      "upstream_attempt.error_code", "upstream_attempt.switch_reason", "",
     ])
     .where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:134:12
       "upstream_attempt.error_code", "upstream_attempt.switch_reason", "provider_resource.mode",
     ])
     .where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
-    .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
+    .where("", "=", input.usage.enterprise_id)
     .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
     .where("upstream_attempt.provider_resource_id", "=", input.usage.provider_resource_id)
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:135:12
     ])
     .where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
     .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
-    .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
+    .where("", "=", input.usage.ai_request_id)
     .where("upstream_attempt.provider_resource_id", "=", input.usage.provider_resource_id)
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id);
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:136:53
     .where("upstream_attempt.id", "=", input.usage.upstream_attempt_id)
     .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
     .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
-    .where("upstream_attempt.provider_resource_id", "=", input.usage.provider_resource_id)
+    .where("upstream_attempt.provider_resource_id", "", input.usage.provider_resource_id)
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id);
   if (attemptResult) attemptQuery = attemptQuery.forUpdate();
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: invalid operator "" to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:137:47
     .where("upstream_attempt.enterprise_id", "=", input.usage.enterprise_id)
     .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
     .where("upstream_attempt.provider_resource_id", "=", input.usage.provider_resource_id)
-    .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id);
+    .where("provider_resource.enterprise_id", "", input.usage.enterprise_id);
   if (attemptResult) attemptQuery = attemptQuery.forUpdate();
   const attempt = await attemptQuery.executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: invalid operator "" to be an instance of OperatingBillClosedError

[Survived] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:138:7
     .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
     .where("upstream_attempt.provider_resource_id", "=", input.usage.provider_resource_id)
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id);
-  if (attemptResult) attemptQuery = attemptQuery.forUpdate();
+  if (false) attemptQuery = attemptQuery.forUpdate();
   const attempt = await attemptQuery.executeTakeFirst();
   if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");

[Survived] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:138:7
     .where("upstream_attempt.ai_request_id", "=", input.usage.ai_request_id)
     .where("upstream_attempt.provider_resource_id", "=", input.usage.provider_resource_id)
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id);
-  if (attemptResult) attemptQuery = attemptQuery.forUpdate();
+  if (true) attemptQuery = attemptQuery.forUpdate();
   const attempt = await attemptQuery.executeTakeFirst();
   if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");

[Killed] BooleanLiteral
src/repositories/gateway-ledger-settlement.ts:140:7
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id);
   if (attemptResult) attemptQuery = attemptQuery.forUpdate();
   const attempt = await attemptQuery.executeTakeFirst();
-  if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
+  if (attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
   if (attempt.mode !== input.ledger_line.resource_mode) {
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: usage_attempt_conflict to be an instance of OperatingBillClosedError

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:140:7
     .where("provider_resource.enterprise_id", "=", input.usage.enterprise_id);
   if (attemptResult) attemptQuery = attemptQuery.forUpdate();
   const attempt = await attemptQuery.executeTakeFirst();
-  if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
+  if (false) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
   if (attempt.mode !== input.ledger_line.resource_mode) {
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: expected [Function] to throw error including 'usage_attempt_conflict' but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:141:7
   if (attemptResult) attemptQuery = attemptQuery.forUpdate();
   const attempt = await attemptQuery.executeTakeFirst();
   if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
-  if (attempt.mode !== input.ledger_line.resource_mode) {
+  if (attempt.mode === input.ledger_line.resource_mode) {
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
   }
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: settlement_resource_mode_conflict to be an instance of OperatingBillClosedError

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:141:7
   if (attemptResult) attemptQuery = attemptQuery.forUpdate();
   const attempt = await attemptQuery.executeTakeFirst();
   if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
-  if (attempt.mode !== input.ledger_line.resource_mode) {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
   }
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: settlement_resource_mode_conflict to be an instance of OperatingBillClosedError

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:144:22
   if (attempt.mode !== input.ledger_line.resource_mode) {
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
   }
-  if (attemptResult) {
-    if (attempt.finished_at === null) {
-      const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
-        .where("id", "=", input.usage.upstream_attempt_id)
-        .where("enterprise_id", "=", input.usage.enterprise_id)
-        .where("ai_request_id", "=", input.usage.ai_request_id)
-        .where("finished_at", "is", null).executeTakeFirst();
-      if (Number(updated.numUpdatedRows) !== 1) {
-        throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
-      }
-    } else if (attempt.http_status !== attemptResult.http_status
-      || attempt.response_committed !== attemptResult.response_committed
-      || attempt.error_classification !== attemptResult.error_classification
-      || attempt.error_code !== attemptResult.error_code
-      || attempt.switch_reason !== attemptResult.switch_reason) {
-      throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
-    }
-  }
+  if (attemptResult) {}
   let usage = await trx.selectFrom("usage_event").selectAll()
     .where("dedup_key", "=", input.usage.dedup_key).forUpdate().executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_incomplete

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:144:7
   if (attempt.mode !== input.ledger_line.resource_mode) {
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
   }
-  if (attemptResult) {
+  if (true) {
     if (attempt.finished_at === null) {
       const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of OperatingBillClosedError

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:145:9
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
   }
   if (attemptResult) {
-    if (attempt.finished_at === null) {
+    if (true) {
       const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
         .where("id", "=", input.usage.upstream_attempt_id)
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: settlement_attempt_result_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:145:9
     throw new GatewayLedgerSettlementConflictError("settlement_resource_mode_conflict");
   }
   if (attemptResult) {
-    if (attempt.finished_at === null) {
+    if (attempt.finished_at !== null) {
       const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
         .where("id", "=", input.usage.upstream_attempt_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:146:45
   }
   if (attemptResult) {
     if (attempt.finished_at === null) {
-      const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
+      const updated = await trx.updateTable("").set(attemptResult)
         .where("id", "=", input.usage.upstream_attempt_id)
         .where("enterprise_id", "=", input.usage.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"
