[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:147:16
   if (attemptResult) {
     if (attempt.finished_at === null) {
       const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
-        .where("id", "=", input.usage.upstream_attempt_id)
+        .where("", "=", input.usage.upstream_attempt_id)
         .where("enterprise_id", "=", input.usage.enterprise_id)
         .where("ai_request_id", "=", input.usage.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:148:33
     if (attempt.finished_at === null) {
       const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
         .where("id", "=", input.usage.upstream_attempt_id)
-        .where("enterprise_id", "=", input.usage.enterprise_id)
+        .where("enterprise_id", "", input.usage.enterprise_id)
         .where("ai_request_id", "=", input.usage.ai_request_id)
         .where("finished_at", "is", null).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:149:33
       const updated = await trx.updateTable("upstream_attempt").set(attemptResult)
         .where("id", "=", input.usage.upstream_attempt_id)
         .where("enterprise_id", "=", input.usage.enterprise_id)
-        .where("ai_request_id", "=", input.usage.ai_request_id)
+        .where("ai_request_id", "", input.usage.ai_request_id)
         .where("finished_at", "is", null).executeTakeFirst();
       if (Number(updated.numUpdatedRows) !== 1) {
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:150:16
         .where("id", "=", input.usage.upstream_attempt_id)
         .where("enterprise_id", "=", input.usage.enterprise_id)
         .where("ai_request_id", "=", input.usage.ai_request_id)
-        .where("finished_at", "is", null).executeTakeFirst();
+        .where("", "is", null).executeTakeFirst();
       if (Number(updated.numUpdatedRows) !== 1) {
         throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:151:11
         .where("enterprise_id", "=", input.usage.enterprise_id)
         .where("ai_request_id", "=", input.usage.ai_request_id)
         .where("finished_at", "is", null).executeTakeFirst();
-      if (Number(updated.numUpdatedRows) !== 1) {
+      if (true) {
         throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_attempt_result_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:151:11
         .where("enterprise_id", "=", input.usage.enterprise_id)
         .where("ai_request_id", "=", input.usage.ai_request_id)
         .where("finished_at", "is", null).executeTakeFirst();
-      if (Number(updated.numUpdatedRows) !== 1) {
+      if (false) {
         throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 Attempt UPDATE 被 PostgreSQL trigger 丢弃时，零事实与资源结算全部回滚
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:152:56
         .where("ai_request_id", "=", input.usage.ai_request_id)
         .where("finished_at", "is", null).executeTakeFirst();
       if (Number(updated.numUpdatedRows) !== 1) {
-        throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
+        throw new GatewayLedgerSettlementConflictError("");
       }
     } else if (attempt.http_status !== attemptResult.http_status
killedBy: POOL-043 结账与项目归属并发边界 Attempt UPDATE 被 PostgreSQL trigger 丢弃时，零事实与资源结算全部回滚
statusReason: expected [Function] to throw error including 'settlement_attempt_result_conflict' but got ''

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:154:16
       if (Number(updated.numUpdatedRows) !== 1) {
         throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
       }
-    } else if (attempt.http_status !== attemptResult.http_status
-      || attempt.response_committed !== attemptResult.response_committed
-      || attempt.error_classification !== attemptResult.error_classification
-      || attempt.error_code !== attemptResult.error_code
-      || attempt.switch_reason !== attemptResult.switch_reason) {
+    } else if (false) {
       throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 非终态清算重放拒绝 Attempt 结果漂移：http_status
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:154:16
       if (Number(updated.numUpdatedRows) !== 1) {
         throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
       }
-    } else if (attempt.http_status !== attemptResult.http_status
-      || attempt.response_committed !== attemptResult.response_committed
-      || attempt.error_classification !== attemptResult.error_classification
-      || attempt.error_code !== attemptResult.error_code
+    } else if (false
       || attempt.switch_reason !== attemptResult.switch_reason) {
       throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
killedBy: POOL-043 结账与项目归属并发边界 非终态清算重放拒绝 Attempt 结果漂移：http_status
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:155:10
         throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
       }
     } else if (attempt.http_status !== attemptResult.http_status
-      || attempt.response_committed !== attemptResult.response_committed
+      || false
       || attempt.error_classification !== attemptResult.error_classification
       || attempt.error_code !== attemptResult.error_code
killedBy: POOL-043 结账与项目归属并发边界 非终态清算重放拒绝 Attempt 结果漂移：response_committed
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:155:10
         throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
       }
     } else if (attempt.http_status !== attemptResult.http_status
-      || attempt.response_committed !== attemptResult.response_committed
+      || attempt.response_committed === attemptResult.response_committed
       || attempt.error_classification !== attemptResult.error_classification
       || attempt.error_code !== attemptResult.error_code
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: settlement_attempt_result_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:156:10
       }
     } else if (attempt.http_status !== attemptResult.http_status
       || attempt.response_committed !== attemptResult.response_committed
-      || attempt.error_classification !== attemptResult.error_classification
+      || false
       || attempt.error_code !== attemptResult.error_code
       || attempt.switch_reason !== attemptResult.switch_reason) {
killedBy: POOL-043 结账与项目归属并发边界 非终态清算重放拒绝 Attempt 结果漂移：error_classification
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:156:10
       }
     } else if (attempt.http_status !== attemptResult.http_status
       || attempt.response_committed !== attemptResult.response_committed
-      || attempt.error_classification !== attemptResult.error_classification
+      || attempt.error_classification === attemptResult.error_classification
       || attempt.error_code !== attemptResult.error_code
       || attempt.switch_reason !== attemptResult.switch_reason) {
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: settlement_attempt_result_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:157:10
     } else if (attempt.http_status !== attemptResult.http_status
       || attempt.response_committed !== attemptResult.response_committed
       || attempt.error_classification !== attemptResult.error_classification
-      || attempt.error_code !== attemptResult.error_code
+      || attempt.error_code === attemptResult.error_code
       || attempt.switch_reason !== attemptResult.switch_reason) {
       throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: settlement_attempt_result_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:157:10
     } else if (attempt.http_status !== attemptResult.http_status
       || attempt.response_committed !== attemptResult.response_committed
       || attempt.error_classification !== attemptResult.error_classification
-      || attempt.error_code !== attemptResult.error_code
+      || false
       || attempt.switch_reason !== attemptResult.switch_reason) {
       throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
killedBy: POOL-043 结账与项目归属并发边界 非终态清算重放拒绝 Attempt 结果漂移：error_code
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:158:10
       || attempt.response_committed !== attemptResult.response_committed
       || attempt.error_classification !== attemptResult.error_classification
       || attempt.error_code !== attemptResult.error_code
-      || attempt.switch_reason !== attemptResult.switch_reason) {
+      || attempt.switch_reason === attemptResult.switch_reason) {
       throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: settlement_attempt_result_conflict

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:158:65
       || attempt.response_committed !== attemptResult.response_committed
       || attempt.error_classification !== attemptResult.error_classification
       || attempt.error_code !== attemptResult.error_code
-      || attempt.switch_reason !== attemptResult.switch_reason) {
-      throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
-    }
+      || attempt.switch_reason !== attemptResult.switch_reason) {}
   }
   let usage = await trx.selectFrom("usage_event").selectAll()
killedBy: POOL-043 结账与项目归属并发边界 非终态清算重放拒绝 Attempt 结果漂移：http_status
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:159:54
       || attempt.error_classification !== attemptResult.error_classification
       || attempt.error_code !== attemptResult.error_code
       || attempt.switch_reason !== attemptResult.switch_reason) {
-      throw new GatewayLedgerSettlementConflictError("settlement_attempt_result_conflict");
+      throw new GatewayLedgerSettlementConflictError("");
     }
   }
killedBy: POOL-043 结账与项目归属并发边界 非终态清算重放拒绝 Attempt 结果漂移：http_status
statusReason: expected [Function] to throw error including 'settlement_attempt_result_conflict' but got ''

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:164:7
   }
   let usage = await trx.selectFrom("usage_event").selectAll()
     .where("dedup_key", "=", input.usage.dedup_key).forUpdate().executeTakeFirst();
-  if (!usage) {
+  if (false) {
     const createdAt = new Date();
     await guardOperatingBillLedgerWrite(trx, input.usage.enterprise_id, createdAt);
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of OperatingBillClosedError

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:164:15
   }
   let usage = await trx.selectFrom("usage_event").selectAll()
     .where("dedup_key", "=", input.usage.dedup_key).forUpdate().executeTakeFirst();
-  if (!usage) {
-    const createdAt = new Date();
-    await guardOperatingBillLedgerWrite(trx, input.usage.enterprise_id, createdAt);
-    usage = await trx.insertInto("usage_event").values({
-      ai_request_id: input.usage.ai_request_id,
-      enterprise_id: input.usage.enterprise_id,
-      upstream_attempt_id: input.usage.upstream_attempt_id,
-      provider_resource_id: input.usage.provider_resource_id,
-      input_tokens: input.usage.input_tokens,
-      output_tokens: input.usage.output_tokens,
-      cache_tokens: input.usage.cache_tokens,
-      reasoning_tokens: input.usage.reasoning_tokens ?? 0n,
-      usage_quality: input.usage.usage_quality,
-      dedup_key: input.usage.dedup_key,
-      upstream_usage_id: input.usage.upstream_usage_id ?? null,
-      created_at: createdAt,
-    }).returningAll().executeTakeFirstOrThrow();
-  }
+  if (!usage) {}
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of OperatingBillClosedError

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:175:25
       input_tokens: input.usage.input_tokens,
       output_tokens: input.usage.output_tokens,
       cache_tokens: input.usage.cache_tokens,
-      reasoning_tokens: input.usage.reasoning_tokens ?? 0n,
+      reasoning_tokens: input.usage.reasoning_tokens && 0n,
       usage_quality: input.usage.usage_quality,
       dedup_key: input.usage.dedup_key,
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: promise rejected "Error: usage_dedup_conflict" instead of resolving

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:178:26
       reasoning_tokens: input.usage.reasoning_tokens ?? 0n,
       usage_quality: input.usage.usage_quality,
       dedup_key: input.usage.dedup_key,
-      upstream_usage_id: input.usage.upstream_usage_id ?? null,
+      upstream_usage_id: input.usage.upstream_usage_id && null,
       created_at: createdAt,
     }).returningAll().executeTakeFirstOrThrow();
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: promise rejected "Error: usage_dedup_conflict" instead of resolving

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:184:30
   }
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
-    .where("usage_event_id", "=", usage.id).orderBy("created_at", "asc")
+    .where("usage_event_id", "", usage.id).orderBy("created_at", "asc")
     .orderBy("id", "asc").execute();
   if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:184:67
   }
   assertUsageMatches(usage, input);
   const lines = await trx.selectFrom("ledger_line").selectAll()
-    .where("usage_event_id", "=", usage.id).orderBy("created_at", "asc")
+    .where("usage_event_id", "=", usage.id).orderBy("created_at", "")
     .orderBy("id", "asc").execute();
   if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: Invalid order by direction:

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:186:7
   const lines = await trx.selectFrom("ledger_line").selectAll()
     .where("usage_event_id", "=", usage.id).orderBy("created_at", "asc")
     .orderBy("id", "asc").execute();
-  if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
+  if (lines.length >= 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
   if (lines[0]) {
     assertLineMatches(lines[0], input);
killedBy: POOL-043 结账与项目归属并发边界 usage→ledger 窗口不可见半成品，IN_PROGRESS 使关账 fail-close 直到原子 finalize
statusReason: duplicate_ledger_line

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:186:7
   const lines = await trx.selectFrom("ledger_line").selectAll()
     .where("usage_event_id", "=", usage.id).orderBy("created_at", "asc")
     .orderBy("id", "asc").execute();
-  if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
+  if (lines.length <= 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
   if (lines[0]) {
     assertLineMatches(lines[0], input);
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: duplicate_ledger_line

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:187:7
     .where("usage_event_id", "=", usage.id).orderBy("created_at", "asc")
     .orderBy("id", "asc").execute();
   if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
-  if (lines[0]) {
+  if (true) {
     assertLineMatches(lines[0], input);
     return { usage, line: lines[0], created: false };
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: Cannot read properties of undefined (reading 'ai_request_id')

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:187:7
     .where("usage_event_id", "=", usage.id).orderBy("created_at", "asc")
     .orderBy("id", "asc").execute();
   if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
-  if (lines[0]) {
+  if (false) {
     assertLineMatches(lines[0], input);
     return { usage, line: lines[0], created: false };
killedBy: POOL-043 结账与项目归属并发边界 usage→ledger 窗口不可见半成品，IN_PROGRESS 使关账 fail-close 直到原子 finalize
statusReason: duplicate key value violates unique constraint "ledger_line_unique_usage_event_idx"

[Killed] BooleanLiteral
src/repositories/gateway-ledger-settlement.ts:189:46
   if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
   if (lines[0]) {
     assertLineMatches(lines[0], input);
-    return { usage, line: lines[0], created: false };
+    return { usage, line: lines[0], created: true };
   }
 
killedBy: POOL-043 结账与项目归属并发边界 usage→ledger 窗口不可见半成品，IN_PROGRESS 使关账 fail-close 直到原子 finalize
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/repositories/gateway-ledger-settlement.ts:189:12
   if (lines.length > 1) throw new GatewayLedgerSettlementConflictError("duplicate_ledger_line");
   if (lines[0]) {
     assertLineMatches(lines[0], input);
-    return { usage, line: lines[0], created: false };
+    return {};
   }
 
killedBy: POOL-043 结账与项目归属并发边界 usage→ledger 窗口不可见半成品，IN_PROGRESS 使关账 fail-close 直到原子 finalize
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:194:37
 
   // 历史 usage-only 自愈必须保留 usage 的事实月份，不能按修复执行时间跨月改账。
   await guardOperatingBillLedgerWrite(trx, input.usage.enterprise_id, usage.created_at);
-  const line = await trx.insertInto("ledger_line").values({
+  const line = await trx.insertInto("").values({
     ...input.ledger_line,
     usage_event_id: usage.id,
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: zero-length delimited identifier at or near """"

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:197:27
   const line = await trx.insertInto("ledger_line").values({
     ...input.ledger_line,
     usage_event_id: usage.id,
-    raw_reasoning_tokens: input.ledger_line.raw_reasoning_tokens ?? 0n,
+    raw_reasoning_tokens: input.ledger_line.raw_reasoning_tokens && 0n,
     deducted_quota: input.ledger_line.deducted_quota ?? null,
     api_cost: input.ledger_line.api_cost ?? null,
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: expected { usage: { …(13) }, …(2) } to match object { Object (created, usage, ...) }
(14 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:198:21
     ...input.ledger_line,
     usage_event_id: usage.id,
     raw_reasoning_tokens: input.ledger_line.raw_reasoning_tokens ?? 0n,
-    deducted_quota: input.ledger_line.deducted_quota ?? null,
+    deducted_quota: input.ledger_line.deducted_quota && null,
     api_cost: input.ledger_line.api_cost ?? null,
     billing_rule_id: input.ledger_line.billing_rule_id ?? null,
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: expected { usage: { …(13) }, …(2) } to match object { Object (created, usage, ...) }
(14 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:199:15
     usage_event_id: usage.id,
     raw_reasoning_tokens: input.ledger_line.raw_reasoning_tokens ?? 0n,
     deducted_quota: input.ledger_line.deducted_quota ?? null,
-    api_cost: input.ledger_line.api_cost ?? null,
+    api_cost: input.ledger_line.api_cost && null,
     billing_rule_id: input.ledger_line.billing_rule_id ?? null,
     rule_version: input.ledger_line.rule_version ?? null,
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: settlement_totals_stale

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:200:22
     raw_reasoning_tokens: input.ledger_line.raw_reasoning_tokens ?? 0n,
     deducted_quota: input.ledger_line.deducted_quota ?? null,
     api_cost: input.ledger_line.api_cost ?? null,
-    billing_rule_id: input.ledger_line.billing_rule_id ?? null,
+    billing_rule_id: input.ledger_line.billing_rule_id && null,
     rule_version: input.ledger_line.rule_version ?? null,
     multiplier: input.ledger_line.multiplier ?? null,
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: expected { usage: { …(13) }, …(2) } to match object { Object (created, usage, ...) }
(14 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:201:19
     deducted_quota: input.ledger_line.deducted_quota ?? null,
     api_cost: input.ledger_line.api_cost ?? null,
     billing_rule_id: input.ledger_line.billing_rule_id ?? null,
-    rule_version: input.ledger_line.rule_version ?? null,
+    rule_version: input.ledger_line.rule_version && null,
     multiplier: input.ledger_line.multiplier ?? null,
     billing_rule_snapshot: input.ledger_line.billing_rule_snapshot ?? null,
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: expected { usage: { …(13) }, …(2) } to match object { Object (created, usage, ...) }
(14 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:202:17
     api_cost: input.ledger_line.api_cost ?? null,
     billing_rule_id: input.ledger_line.billing_rule_id ?? null,
     rule_version: input.ledger_line.rule_version ?? null,
-    multiplier: input.ledger_line.multiplier ?? null,
+    multiplier: input.ledger_line.multiplier && null,
     billing_rule_snapshot: input.ledger_line.billing_rule_snapshot ?? null,
     created_at: usage.created_at,
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: expected { usage: { …(13) }, …(2) } to match object { Object (created, usage, ...) }
(14 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:203:28
     billing_rule_id: input.ledger_line.billing_rule_id ?? null,
     rule_version: input.ledger_line.rule_version ?? null,
     multiplier: input.ledger_line.multiplier ?? null,
-    billing_rule_snapshot: input.ledger_line.billing_rule_snapshot ?? null,
+    billing_rule_snapshot: input.ledger_line.billing_rule_snapshot && null,
     created_at: usage.created_at,
   }).returningAll().executeTakeFirstOrThrow();
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: expected { usage: { …(13) }, …(2) } to match object { Object (created, usage, ...) }
(14 matching properties omitted from actual)

[Killed] BooleanLiteral
src/repositories/gateway-ledger-settlement.ts:206:34
     billing_rule_snapshot: input.ledger_line.billing_rule_snapshot ?? null,
     created_at: usage.created_at,
   }).returningAll().executeTakeFirstOrThrow();
-  return { usage, line, created: true };
+  return { usage, line, created: false };
 }
 
killedBy: POOL-043 结账与项目归属并发边界 usage→ledger 窗口不可见半成品，IN_PROGRESS 使关账 fail-close 直到原子 finalize
statusReason: expected { usage: { …(13) }, …(2) } to match object { created: true }
(35 matching properties omitted from actual)

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:220:39
   const finishedAt = new Date();
   return db.transaction().execute(async (trx) => {
     const request = await trx.selectFrom("ai_request").select([
-      "id", "status", "principal_id", "error_classification", "error_code",
+      "id", "status", "principal_id", "", "error_code",
     ])
       .where("id", "=", input.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: zero-length delimited identifier at or near """"

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:225:9
       .where("id", "=", input.ai_request_id)
       .where("enterprise_id", "=", input.enterprise_id)
       .forUpdate().executeTakeFirst();
-    if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
+    if (false) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
     if (request.principal_id !== input.principal_id) {
       throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: expected [Function] to throw error including 'settlement_request_not_found' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:225:9
       .where("id", "=", input.ai_request_id)
       .where("enterprise_id", "=", input.enterprise_id)
       .forUpdate().executeTakeFirst();
-    if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
+    if (true) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
     if (request.principal_id !== input.principal_id) {
       throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_request_not_found

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:226:54
       .where("enterprise_id", "=", input.enterprise_id)
       .forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
-    if (request.principal_id !== input.principal_id) {
-      throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
-    }
+    if (request.principal_id !== input.principal_id) {}
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
       .where("ai_request_id", "=", input.ai_request_id).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: expected [Function] to throw error including 'settlement_principal_conflict' but got 'insert or update on table "ledger_tra…'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:226:9
       .where("enterprise_id", "=", input.enterprise_id)
       .forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
-    if (request.principal_id !== input.principal_id) {
+    if (true) {
       throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_principal_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:231:9
     }
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
       .where("ai_request_id", "=", input.ai_request_id).executeTakeFirst();
-    if (request.status !== "IN_PROGRESS") {
+    if (true) {
       if (!existing || request.status !== input.request_status) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_terminal_conflict
