[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:231:9
     }
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
       .where("ai_request_id", "=", input.ai_request_id).executeTakeFirst();
-    if (request.status !== "IN_PROGRESS") {
+    if (request.status === "IN_PROGRESS") {
       if (!existing || request.status !== input.request_status) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_terminal_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:232:24
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
       .where("ai_request_id", "=", input.ai_request_id).executeTakeFirst();
     if (request.status !== "IN_PROGRESS") {
-      if (!existing || request.status !== input.request_status) {
+      if (!existing || false) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 finalize 的 terminal 重放仅允许状态与错误身份完全一致
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:232:24
     const existing = await trx.selectFrom("ledger_transaction").selectAll()
       .where("ai_request_id", "=", input.ai_request_id).executeTakeFirst();
     if (request.status !== "IN_PROGRESS") {
-      if (!existing || request.status !== input.request_status) {
+      if (!existing || request.status === input.request_status) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 finalize 的 terminal 重放仅允许状态与错误身份完全一致
statusReason: promise rejected "Error: settlement_terminal_conflict" instead of resolving

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:235:11
       if (!existing || request.status !== input.request_status) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
-      if (request.error_classification !== (input.error_classification ?? null)
-        || request.error_code !== (input.error_code ?? null)) {
+      if (false) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 finalize 的 terminal 重放仅允许状态与错误身份完全一致
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:235:11
       if (!existing || request.status !== input.request_status) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
-      if (request.error_classification !== (input.error_classification ?? null)
+      if (false
         || request.error_code !== (input.error_code ?? null)) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
killedBy: POOL-043 结账与项目归属并发边界 finalize 的 terminal 重放仅允许状态与错误身份完全一致
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:236:12
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
       if (request.error_classification !== (input.error_classification ?? null)
-        || request.error_code !== (input.error_code ?? null)) {
+        || request.error_code === (input.error_code ?? null)) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 finalize 的 terminal 重放仅允许状态与错误身份完全一致
statusReason: promise rejected "Error: settlement_terminal_conflict" instead of resolving

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:236:36
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
       if (request.error_classification !== (input.error_classification ?? null)
-        || request.error_code !== (input.error_code ?? null)) {
+        || request.error_code !== (input.error_code && null)) {
         throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
       }
killedBy: POOL-043 结账与项目归属并发边界 finalize 的 terminal 重放仅允许状态与错误身份完全一致
statusReason: promise rejected "Error: settlement_terminal_conflict" instead of resolving

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:247:25
 
     await assertRequestReadyToFinalize(trx, input);
     await settleRequestAccounting(trx, input, finishedAt);
-    const transaction = existing ?? await insertLedgerTransaction(trx, input);
+    const transaction = existing && (await insertLedgerTransaction(trx, input));
     assertTransactionMatches(transaction, input);
     await ensureRequestAttributionSnapshot(trx, input.enterprise_id, input.ai_request_id);
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: Cannot read properties of undefined (reading 'ai_request_id')

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:250:43
     const transaction = existing ?? await insertLedgerTransaction(trx, input);
     assertTransactionMatches(transaction, input);
     await ensureRequestAttributionSnapshot(trx, input.enterprise_id, input.ai_request_id);
-    const updated = await trx.updateTable("ai_request").set({
+    const updated = await trx.updateTable("").set({
       status: input.request_status,
       finished_at: finishedAt,
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: zero-length delimited identifier at or near """"

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:253:29
     const updated = await trx.updateTable("ai_request").set({
       status: input.request_status,
       finished_at: finishedAt,
-      error_classification: input.error_classification ?? null,
+      error_classification: input.error_classification && null,
       error_code: input.error_code ?? null,
     }).where("id", "=", input.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 finalize 的 terminal 重放仅允许状态与错误身份完全一致
statusReason: promise rejected "Error: settlement_terminal_conflict" instead of resolving

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:254:19
       status: input.request_status,
       finished_at: finishedAt,
       error_classification: input.error_classification ?? null,
-      error_code: input.error_code ?? null,
+      error_code: input.error_code && null,
     }).where("id", "=", input.ai_request_id)
       .where("enterprise_id", "=", input.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 finalize 的 terminal 重放仅允许状态与错误身份完全一致
statusReason: promise rejected "Error: settlement_terminal_conflict" instead of resolving

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:255:14
       finished_at: finishedAt,
       error_classification: input.error_classification ?? null,
       error_code: input.error_code ?? null,
-    }).where("id", "=", input.ai_request_id)
+    }).where("", "=", input.ai_request_id)
       .where("enterprise_id", "=", input.enterprise_id)
       .where("status", "=", "IN_PROGRESS").executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: zero-length delimited identifier at or near """"

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:258:9
     }).where("id", "=", input.ai_request_id)
       .where("enterprise_id", "=", input.enterprise_id)
       .where("status", "=", "IN_PROGRESS").executeTakeFirst();
-    if (Number(updated.numUpdatedRows) !== 1) {
+    if (true) {
       throw new GatewayLedgerSettlementConflictError("settlement_status_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_status_conflict

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:258:9
     }).where("id", "=", input.ai_request_id)
       .where("enterprise_id", "=", input.enterprise_id)
       .where("status", "=", "IN_PROGRESS").executeTakeFirst();
-    if (Number(updated.numUpdatedRows) !== 1) {
+    if (Number(updated.numUpdatedRows) === 1) {
       throw new GatewayLedgerSettlementConflictError("settlement_status_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_status_conflict

[NoCoverage] StringLiteral
src/repositories/gateway-ledger-settlement.ts:259:54
       .where("enterprise_id", "=", input.enterprise_id)
       .where("status", "=", "IN_PROGRESS").executeTakeFirst();
     if (Number(updated.numUpdatedRows) !== 1) {
-      throw new GatewayLedgerSettlementConflictError("settlement_status_conflict");
+      throw new GatewayLedgerSettlementConflictError("");
     }
     return transaction;

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:269:54
   db: Transaction<Database>,
   enterpriseId: string,
   requestId: string,
-): Promise<{ status: string; principal_id: string }> {
-  const request = await db.selectFrom("ai_request").select(["status", "principal_id"])
-    .where("enterprise_id", "=", enterpriseId).where("id", "=", requestId)
-    .forUpdate().executeTakeFirst();
-  if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
-  if (request.status !== "IN_PROGRESS") {
-    throw new GatewayLedgerSettlementConflictError("settlement_request_terminal");
-  }
-  return request;
-}
+): Promise<{ status: string; principal_id: string }> {}
 
 async function assertRequestReadyToFinalize(
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of OperatingBillClosedError

[Killed] ArrayDeclaration
src/repositories/gateway-ledger-settlement.ts:270:60
   enterpriseId: string,
   requestId: string,
 ): Promise<{ status: string; principal_id: string }> {
-  const request = await db.selectFrom("ai_request").select(["status", "principal_id"])
+  const request = await db.selectFrom("ai_request").select([])
     .where("enterprise_id", "=", enterpriseId).where("id", "=", requestId)
     .forUpdate().executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: settlement_request_terminal to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:271:12
   requestId: string,
 ): Promise<{ status: string; principal_id: string }> {
   const request = await db.selectFrom("ai_request").select(["status", "principal_id"])
-    .where("enterprise_id", "=", enterpriseId).where("id", "=", requestId)
+    .where("", "=", enterpriseId).where("id", "=", requestId)
     .forUpdate().executeTakeFirst();
   if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected error: zero-length delimited identifier a… { …(15) } to be an instance of OperatingBillClosedError

[Killed] BooleanLiteral
src/repositories/gateway-ledger-settlement.ts:273:7
   const request = await db.selectFrom("ai_request").select(["status", "principal_id"])
     .where("enterprise_id", "=", enterpriseId).where("id", "=", requestId)
     .forUpdate().executeTakeFirst();
-  if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
+  if (request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
   if (request.status !== "IN_PROGRESS") {
     throw new GatewayLedgerSettlementConflictError("settlement_request_terminal");
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: settlement_request_not_found to be an instance of OperatingBillClosedError

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:274:7
     .where("enterprise_id", "=", enterpriseId).where("id", "=", requestId)
     .forUpdate().executeTakeFirst();
   if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
-  if (request.status !== "IN_PROGRESS") {
+  if (false) {
     throw new GatewayLedgerSettlementConflictError("settlement_request_terminal");
   }
killedBy: POOL-043 结账与项目归属并发边界 terminal 发布后拒绝 late attempt 与 late usage，账本计数保持不变
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:274:7
     .where("enterprise_id", "=", enterpriseId).where("id", "=", requestId)
     .forUpdate().executeTakeFirst();
   if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
-  if (request.status !== "IN_PROGRESS") {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("settlement_request_terminal");
   }
killedBy: POOL-043 结账与项目归属并发边界 CLOSED 后拒绝同月 usage/ledger 原子写且零新增
statusReason: expected Error: settlement_request_terminal to be an instance of OperatingBillClosedError

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:275:52
     .forUpdate().executeTakeFirst();
   if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
   if (request.status !== "IN_PROGRESS") {
-    throw new GatewayLedgerSettlementConflictError("settlement_request_terminal");
+    throw new GatewayLedgerSettlementConflictError("");
   }
   return request;
killedBy: POOL-043 结账与项目归属并发边界 terminal 发布后拒绝 late attempt 与 late usage，账本计数保持不变
statusReason: expected [Function] to throw error including 'settlement_request_terminal' but got ''

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:283:18
 async function assertRequestReadyToFinalize(
   db: Transaction<Database>,
   input: CreateLedgerTransactionInput,
-): Promise<void> {
-  const facts = await loadRequestSettlementFacts(db, input.enterprise_id, input.ai_request_id);
-  if (facts.attemptCount !== input.attempt_count) {
-    throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
-  }
-  if (facts.totalInputTokens !== input.total_input_tokens
-    || facts.totalOutputTokens !== input.total_output_tokens
-    || facts.totalCacheTokens !== input.total_cache_tokens
-    || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
-    || facts.totalDeductedQuota !== input.total_deducted_quota
-    || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
-    || summarizeLedgerUsageQuality(
-      facts.usageQualities.map((usage_quality) => ({ usage_quality })),
-    ) !== input.usage_quality) {
-    throw new GatewayLedgerSettlementConflictError("settlement_totals_stale");
-  }
-}
+): Promise<void> {}
 
 export async function settleRequestAccounting(
killedBy: POOL-043 结账与项目归属并发边界 finalize 拒绝事务外旧 totals 与未完成 attempt，且不发布 terminal
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:285:51
   input: CreateLedgerTransactionInput,
 ): Promise<void> {
   const facts = await loadRequestSettlementFacts(db, input.enterprise_id, input.ai_request_id);
-  if (facts.attemptCount !== input.attempt_count) {
-    throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
-  }
+  if (facts.attemptCount !== input.attempt_count) {}
   if (facts.totalInputTokens !== input.total_input_tokens
     || facts.totalOutputTokens !== input.total_output_tokens
killedBy: POOL-043 结账与项目归属并发边界 finalize 拒绝事务外旧 totals 与未完成 attempt，且不发布 terminal
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:285:7
   input: CreateLedgerTransactionInput,
 ): Promise<void> {
   const facts = await loadRequestSettlementFacts(db, input.enterprise_id, input.ai_request_id);
-  if (facts.attemptCount !== input.attempt_count) {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
   }
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_attempt_incomplete

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:288:7
   if (facts.attemptCount !== input.attempt_count) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
   }
-  if (facts.totalInputTokens !== input.total_input_tokens
+  if (facts.totalInputTokens === input.total_input_tokens
     || facts.totalOutputTokens !== input.total_output_tokens
     || facts.totalCacheTokens !== input.total_cache_tokens
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_totals_stale

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:288:7
   if (facts.attemptCount !== input.attempt_count) {
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
   }
-  if (facts.totalInputTokens !== input.total_input_tokens
-    || facts.totalOutputTokens !== input.total_output_tokens
-    || facts.totalCacheTokens !== input.total_cache_tokens
-    || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
-    || facts.totalDeductedQuota !== input.total_deducted_quota
-    || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
-    || summarizeLedgerUsageQuality(
-      facts.usageQualities.map((usage_quality) => ({ usage_quality })),
-    ) !== input.usage_quality) {
+  if (false) {
     throw new GatewayLedgerSettlementConflictError("settlement_totals_stale");
   }
killedBy: POOL-043 结账与项目归属并发边界 finalize 拒绝事务外旧 totals 与未完成 attempt，且不发布 terminal
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:289:8
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
   }
   if (facts.totalInputTokens !== input.total_input_tokens
-    || facts.totalOutputTokens !== input.total_output_tokens
+    || false
     || facts.totalCacheTokens !== input.total_cache_tokens
     || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:289:8
     throw new GatewayLedgerSettlementConflictError("settlement_attempt_incomplete");
   }
   if (facts.totalInputTokens !== input.total_input_tokens
-    || facts.totalOutputTokens !== input.total_output_tokens
+    || facts.totalOutputTokens === input.total_output_tokens
     || facts.totalCacheTokens !== input.total_cache_tokens
     || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_totals_stale

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:290:8
   }
   if (facts.totalInputTokens !== input.total_input_tokens
     || facts.totalOutputTokens !== input.total_output_tokens
-    || facts.totalCacheTokens !== input.total_cache_tokens
+    || facts.totalCacheTokens === input.total_cache_tokens
     || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
     || facts.totalDeductedQuota !== input.total_deducted_quota
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_totals_stale

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:290:8
   }
   if (facts.totalInputTokens !== input.total_input_tokens
     || facts.totalOutputTokens !== input.total_output_tokens
-    || facts.totalCacheTokens !== input.total_cache_tokens
+    || false
     || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
     || facts.totalDeductedQuota !== input.total_deducted_quota
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:291:8
   if (facts.totalInputTokens !== input.total_input_tokens
     || facts.totalOutputTokens !== input.total_output_tokens
     || facts.totalCacheTokens !== input.total_cache_tokens
-    || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
+    || facts.totalReasoningTokens === (input.total_reasoning_tokens ?? 0n)
     || facts.totalDeductedQuota !== input.total_deducted_quota
     || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_totals_stale

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:291:8
   if (facts.totalInputTokens !== input.total_input_tokens
     || facts.totalOutputTokens !== input.total_output_tokens
     || facts.totalCacheTokens !== input.total_cache_tokens
-    || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
+    || false
     || facts.totalDeductedQuota !== input.total_deducted_quota
     || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:292:8
     || facts.totalOutputTokens !== input.total_output_tokens
     || facts.totalCacheTokens !== input.total_cache_tokens
     || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
-    || facts.totalDeductedQuota !== input.total_deducted_quota
+    || facts.totalDeductedQuota === input.total_deducted_quota
     || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
     || summarizeLedgerUsageQuality(
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_totals_stale

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:292:8
     || facts.totalOutputTokens !== input.total_output_tokens
     || facts.totalCacheTokens !== input.total_cache_tokens
     || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
-    || facts.totalDeductedQuota !== input.total_deducted_quota
+    || false
     || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
     || summarizeLedgerUsageQuality(
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] BooleanLiteral
src/repositories/gateway-ledger-settlement.ts:293:8
     || facts.totalCacheTokens !== input.total_cache_tokens
     || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
     || facts.totalDeductedQuota !== input.total_deducted_quota
-    || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
+    || new Decimal(facts.totalApiCost).eq(input.total_api_cost)
     || summarizeLedgerUsageQuality(
       facts.usageQualities.map((usage_quality) => ({ usage_quality })),
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_totals_stale

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:294:8
     || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
     || facts.totalDeductedQuota !== input.total_deducted_quota
     || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
-    || summarizeLedgerUsageQuality(
-      facts.usageQualities.map((usage_quality) => ({ usage_quality })),
-    ) !== input.usage_quality) {
+    || summarizeLedgerUsageQuality(facts.usageQualities.map(usage_quality => ({
+  usage_quality
+}))) === input.usage_quality) {
     throw new GatewayLedgerSettlementConflictError("settlement_totals_stale");
   }
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: settlement_totals_stale

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:294:8
     || facts.totalReasoningTokens !== (input.total_reasoning_tokens ?? 0n)
     || facts.totalDeductedQuota !== input.total_deducted_quota
     || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
-    || summarizeLedgerUsageQuality(
-      facts.usageQualities.map((usage_quality) => ({ usage_quality })),
-    ) !== input.usage_quality) {
+    || false) {
     throw new GatewayLedgerSettlementConflictError("settlement_totals_stale");
   }
killedBy: POOL-043 结账与项目归属并发边界 finalize 逐项拒绝旧 totals、缺 ledger line 与错误主体
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] ArrowFunction
src/repositories/gateway-ledger-settlement.ts:295:32
     || facts.totalDeductedQuota !== input.total_deducted_quota
     || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
     || summarizeLedgerUsageQuality(
-      facts.usageQualities.map((usage_quality) => ({ usage_quality })),
+      facts.usageQualities.map(() => undefined),
     ) !== input.usage_quality) {
     throw new GatewayLedgerSettlementConflictError("settlement_totals_stale");
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: Cannot read properties of undefined (reading 'usage_quality')

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:296:32
     || !new Decimal(facts.totalApiCost).eq(input.total_api_cost)
     || summarizeLedgerUsageQuality(
       facts.usageQualities.map((usage_quality) => ({ usage_quality })),
-    ) !== input.usage_quality) {
-    throw new GatewayLedgerSettlementConflictError("settlement_totals_stale");
-  }
+    ) !== input.usage_quality) {}
 }
 
killedBy: POOL-043 结账与项目归属并发边界 finalize 拒绝事务外旧 totals 与未完成 attempt，且不发布 terminal
statusReason: promise resolved "{ …(15) }" instead of rejecting

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:309:22
   now: Date,
 ): Promise<void> {
   const byGrant = new Map<string, { estimated: bigint; actual: bigint }>();
-  for (const item of input.quota_settlements ?? []) {
+  for (const item of input.quota_settlements && []) {
     const current = byGrant.get(item.grant_id) ?? { estimated: 0n, actual: 0n };
     current.estimated += item.reserved_estimate;
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:309:53
   now: Date,
 ): Promise<void> {
   const byGrant = new Map<string, { estimated: bigint; actual: bigint }>();
-  for (const item of input.quota_settlements ?? []) {
-    const current = byGrant.get(item.grant_id) ?? { estimated: 0n, actual: 0n };
-    current.estimated += item.reserved_estimate;
-    current.actual += item.actual_deducted;
-    byGrant.set(item.grant_id, current);
-  }
+  for (const item of input.quota_settlements ?? []) {}
   for (const [grantId, adjustment] of [...byGrant.entries()].sort(([a], [b]) => a.localeCompare(b))) {
     const counter = await db.selectFrom("quota_counter").selectAll()
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: expected 37n to be 0n // Object.is equality

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:310:21
 ): Promise<void> {
   const byGrant = new Map<string, { estimated: bigint; actual: bigint }>();
   for (const item of input.quota_settlements ?? []) {
-    const current = byGrant.get(item.grant_id) ?? { estimated: 0n, actual: 0n };
+    const current = byGrant.get(item.grant_id) && {
+  estimated: 0n,
+  actual: 0n
+};
     current.estimated += item.reserved_estimate;
     current.actual += item.actual_deducted;
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: Cannot read properties of undefined (reading 'estimated')

[Killed] AssignmentOperator
src/repositories/gateway-ledger-settlement.ts:311:5
   const byGrant = new Map<string, { estimated: bigint; actual: bigint }>();
   for (const item of input.quota_settlements ?? []) {
     const current = byGrant.get(item.grant_id) ?? { estimated: 0n, actual: 0n };
-    current.estimated += item.reserved_estimate;
+    current.estimated -= item.reserved_estimate;
     current.actual += item.actual_deducted;
     byGrant.set(item.grant_id, current);
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: expected 74n to be 0n // Object.is equality

[Killed] AssignmentOperator
src/repositories/gateway-ledger-settlement.ts:312:5
   for (const item of input.quota_settlements ?? []) {
     const current = byGrant.get(item.grant_id) ?? { estimated: 0n, actual: 0n };
     current.estimated += item.reserved_estimate;
-    current.actual += item.actual_deducted;
+    current.actual -= item.actual_deducted;
     byGrant.set(item.grant_id, current);
   }
killedBy: POOL-043 结账与项目归属并发边界 非终态清算按实际扣减重算额度与超额：'quota-over'
statusReason: expected 0n to be 15n // Object.is equality
