[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:315:102
     current.actual += item.actual_deducted;
     byGrant.set(item.grant_id, current);
   }
-  for (const [grantId, adjustment] of [...byGrant.entries()].sort(([a], [b]) => a.localeCompare(b))) {
-    const counter = await db.selectFrom("quota_counter").selectAll()
-      .where("grant_id", "=", grantId).forUpdate().executeTakeFirst();
-    const grant = await db.selectFrom("principal_grant")
-      .select(["id", "enterprise_id", "principal_id", "quota_value"])
-      .where("id", "=", grantId).executeTakeFirst();
-    if (!counter || !grant
-      || grant.enterprise_id !== input.enterprise_id
-      || grant.principal_id !== input.principal_id) {
-      throw new GatewayLedgerSettlementConflictError("settlement_quota_grant_conflict");
-    }
-    const used = calculateSettledQuota(
-      BigInt(counter.used_value), adjustment.estimated, adjustment.actual,
-    );
-    const quota = BigInt(grant.quota_value);
-    await db.updateTable("quota_counter").set({
-      used_value: used,
-      overage_value: used > quota ? used - quota : 0n,
-      updated_at: now,
-    }).where("grant_id", "=", grantId).execute();
-  }
+  for (const [grantId, adjustment] of [...byGrant.entries()].sort(([a], [b]) => a.localeCompare(b))) {}
 
   const leaseIds = [...new Set(input.release_lease_ids ?? [])].sort();
killedBy: POOL-043 资源结算锁序 Grant 与 Lease 去重排序后锁定，并合并同 Grant 调整
statusReason: expected [] to deeply equal [ 'grant-a', 'grant-z' ]

[Killed] ArrowFunction
src/repositories/gateway-ledger-settlement.ts:315:67
     current.actual += item.actual_deducted;
     byGrant.set(item.grant_id, current);
   }
-  for (const [grantId, adjustment] of [...byGrant.entries()].sort(([a], [b]) => a.localeCompare(b))) {
+  for (const [grantId, adjustment] of [...byGrant.entries()].sort(() => undefined)) {
     const counter = await db.selectFrom("quota_counter").selectAll()
       .where("grant_id", "=", grantId).forUpdate().executeTakeFirst();
killedBy: POOL-043 资源结算锁序 Grant 与 Lease 去重排序后锁定，并合并同 Grant 调整
statusReason: expected [ 'grant-z', 'grant-a' ] to deeply equal [ 'grant-a', 'grant-z' ]

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:316:41
     byGrant.set(item.grant_id, current);
   }
   for (const [grantId, adjustment] of [...byGrant.entries()].sort(([a], [b]) => a.localeCompare(b))) {
-    const counter = await db.selectFrom("quota_counter").selectAll()
+    const counter = await db.selectFrom("").selectAll()
       .where("grant_id", "=", grantId).forUpdate().executeTakeFirst();
     const grant = await db.selectFrom("principal_grant")
killedBy: POOL-043 资源结算锁序 Grant 与 Lease 去重排序后锁定，并合并同 Grant 调整
statusReason: Cannot convert undefined to a BigInt

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:319:55
     const counter = await db.selectFrom("quota_counter").selectAll()
       .where("grant_id", "=", grantId).forUpdate().executeTakeFirst();
     const grant = await db.selectFrom("principal_grant")
-      .select(["id", "enterprise_id", "principal_id", "quota_value"])
+      .select(["id", "enterprise_id", "principal_id", ""])
       .where("id", "=", grantId).executeTakeFirst();
     if (!counter || !grant
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] ArrayDeclaration
src/repositories/gateway-ledger-settlement.ts:319:15
     const counter = await db.selectFrom("quota_counter").selectAll()
       .where("grant_id", "=", grantId).forUpdate().executeTakeFirst();
     const grant = await db.selectFrom("principal_grant")
-      .select(["id", "enterprise_id", "principal_id", "quota_value"])
+      .select([])
       .where("id", "=", grantId).executeTakeFirst();
     if (!counter || !grant
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_quota_grant_conflict

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:321:9
     const grant = await db.selectFrom("principal_grant")
       .select(["id", "enterprise_id", "principal_id", "quota_value"])
       .where("id", "=", grantId).executeTakeFirst();
-    if (!counter || !grant
-      || grant.enterprise_id !== input.enterprise_id
+    if ((!counter || !grant) && grant.enterprise_id !== input.enterprise_id
       || grant.principal_id !== input.principal_id) {
       throw new GatewayLedgerSettlementConflictError("settlement_quota_grant_conflict");
killedBy: POOL-043 结账与项目归属并发边界 非终态清算拒绝不属于请求主体的额度事实：missing-counter
statusReason: expected [Function] to throw error including 'settlement_quota_grant_conflict' but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:321:9
     const grant = await db.selectFrom("principal_grant")
       .select(["id", "enterprise_id", "principal_id", "quota_value"])
       .where("id", "=", grantId).executeTakeFirst();
-    if (!counter || !grant
+    if (!counter && !grant
       || grant.enterprise_id !== input.enterprise_id
       || grant.principal_id !== input.principal_id) {
killedBy: POOL-043 结账与项目归属并发边界 非终态清算拒绝不属于请求主体的额度事实：missing-counter
statusReason: expected [Function] to throw error including 'settlement_quota_grant_conflict' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:322:10
       .select(["id", "enterprise_id", "principal_id", "quota_value"])
       .where("id", "=", grantId).executeTakeFirst();
     if (!counter || !grant
-      || grant.enterprise_id !== input.enterprise_id
+      || false
       || grant.principal_id !== input.principal_id) {
       throw new GatewayLedgerSettlementConflictError("settlement_quota_grant_conflict");
killedBy: POOL-043 结账与项目归属并发边界 非终态清算拒绝不属于请求主体的额度事实：enterprise-mismatch
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:322:10
       .select(["id", "enterprise_id", "principal_id", "quota_value"])
       .where("id", "=", grantId).executeTakeFirst();
     if (!counter || !grant
-      || grant.enterprise_id !== input.enterprise_id
+      || grant.enterprise_id === input.enterprise_id
       || grant.principal_id !== input.principal_id) {
       throw new GatewayLedgerSettlementConflictError("settlement_quota_grant_conflict");
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_quota_grant_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:323:10
       .where("id", "=", grantId).executeTakeFirst();
     if (!counter || !grant
       || grant.enterprise_id !== input.enterprise_id
-      || grant.principal_id !== input.principal_id) {
+      || false) {
       throw new GatewayLedgerSettlementConflictError("settlement_quota_grant_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 非终态清算拒绝不属于请求主体的额度事实：principal-mismatch
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:323:53
       .where("id", "=", grantId).executeTakeFirst();
     if (!counter || !grant
       || grant.enterprise_id !== input.enterprise_id
-      || grant.principal_id !== input.principal_id) {
-      throw new GatewayLedgerSettlementConflictError("settlement_quota_grant_conflict");
-    }
+      || grant.principal_id !== input.principal_id) {}
     const used = calculateSettledQuota(
       BigInt(counter.used_value), adjustment.estimated, adjustment.actual,
killedBy: POOL-043 结账与项目归属并发边界 非终态清算拒绝不属于请求主体的额度事实：missing-counter
statusReason: expected [Function] to throw error including 'settlement_quota_grant_conflict' but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:324:54
     if (!counter || !grant
       || grant.enterprise_id !== input.enterprise_id
       || grant.principal_id !== input.principal_id) {
-      throw new GatewayLedgerSettlementConflictError("settlement_quota_grant_conflict");
+      throw new GatewayLedgerSettlementConflictError("");
     }
     const used = calculateSettledQuota(
killedBy: POOL-043 结账与项目归属并发边界 非终态清算拒绝不属于请求主体的额度事实：missing-counter
statusReason: expected [Function] to throw error including 'settlement_quota_grant_conflict' but got ''

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:332:22
     const quota = BigInt(grant.quota_value);
     await db.updateTable("quota_counter").set({
       used_value: used,
-      overage_value: used > quota ? used - quota : 0n,
+      overage_value: used <= quota ? used - quota : 0n,
       updated_at: now,
     }).where("grant_id", "=", grantId).execute();
killedBy: POOL-043 结账与项目归属并发边界 非终态清算按实际扣减重算额度与超额：'quota-over'
statusReason: expected 0n to be 5n // Object.is equality

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:332:22
     const quota = BigInt(grant.quota_value);
     await db.updateTable("quota_counter").set({
       used_value: used,
-      overage_value: used > quota ? used - quota : 0n,
+      overage_value: true ? used - quota : 0n,
       updated_at: now,
     }).where("grant_id", "=", grantId).execute();
killedBy: POOL-043 结账与项目归属并发边界 非终态清算按实际扣减重算额度与超额：'quota-under'
statusReason: expected -1n to be 0n // Object.is equality

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:334:14
       used_value: used,
       overage_value: used > quota ? used - quota : 0n,
       updated_at: now,
-    }).where("grant_id", "=", grantId).execute();
+    }).where("", "=", grantId).execute();
   }
 
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:337:32
     }).where("grant_id", "=", grantId).execute();
   }
 
-  const leaseIds = [...new Set(input.release_lease_ids ?? [])].sort();
+  const leaseIds = [...new Set(input.release_lease_ids && [])].sort();
   if (leaseIds.length > 0) {
     const leases = await db.selectFrom("concurrency_lease").select("id")
killedBy: POOL-043 资源结算锁序 Grant 与 Lease 去重排序后锁定，并合并同 Grant 调整
statusReason: expected [] to deeply equal [ 'lease-a', 'lease-z' ]

[Killed] MethodExpression
src/repositories/gateway-ledger-settlement.ts:337:20
     }).where("grant_id", "=", grantId).execute();
   }
 
-  const leaseIds = [...new Set(input.release_lease_ids ?? [])].sort();
+  const leaseIds = [...new Set(input.release_lease_ids ?? [])];
   if (leaseIds.length > 0) {
     const leases = await db.selectFrom("concurrency_lease").select("id")
killedBy: POOL-043 资源结算锁序 Grant 与 Lease 去重排序后锁定，并合并同 Grant 调整
statusReason: expected [ 'lease-z', 'lease-a' ] to deeply equal [ 'lease-a', 'lease-z' ]

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement.ts:338:7
   }
 
   const leaseIds = [...new Set(input.release_lease_ids ?? [])].sort();
-  if (leaseIds.length > 0) {
+  if (true) {
     const leases = await db.selectFrom("concurrency_lease").select("id")
       .where("id", "in", leaseIds)
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: syntax error at or near ")"

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:338:7
   }
 
   const leaseIds = [...new Set(input.release_lease_ids ?? [])].sort();
-  if (leaseIds.length > 0) {
+  if (leaseIds.length >= 0) {
     const leases = await db.selectFrom("concurrency_lease").select("id")
       .where("id", "in", leaseIds)
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: syntax error at or near ")"

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:339:68
 
   const leaseIds = [...new Set(input.release_lease_ids ?? [])].sort();
   if (leaseIds.length > 0) {
-    const leases = await db.selectFrom("concurrency_lease").select("id")
+    const leases = await db.selectFrom("concurrency_lease").select("")
       .where("id", "in", leaseIds)
       .where("enterprise_id", "=", input.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:343:22
       .where("id", "in", leaseIds)
       .where("enterprise_id", "=", input.enterprise_id)
       .where("ai_request_id", "=", input.ai_request_id)
-      .orderBy("id", "asc")
+      .orderBy("id", "")
       .forUpdate().execute();
     if (leases.length !== leaseIds.length) {
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: Invalid order by direction:

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement.ts:345:9
       .where("ai_request_id", "=", input.ai_request_id)
       .orderBy("id", "asc")
       .forUpdate().execute();
-    if (leases.length !== leaseIds.length) {
+    if (leases.length === leaseIds.length) {
       throw new GatewayLedgerSettlementConflictError("settlement_lease_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: settlement_lease_conflict

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:345:44
       .where("ai_request_id", "=", input.ai_request_id)
       .orderBy("id", "asc")
       .forUpdate().execute();
-    if (leases.length !== leaseIds.length) {
-      throw new GatewayLedgerSettlementConflictError("settlement_lease_conflict");
-    }
+    if (leases.length !== leaseIds.length) {}
     await db.updateTable("concurrency_lease").set({ released_at: now })
       .where("id", "in", leaseIds)
killedBy: POOL-043 结账与项目归属并发边界 非终态撤权清算故障整体回滚，重试成功且重放不重复退额度
statusReason: promise resolved "{ usage: { …(13) }, …(2) }" instead of rejecting

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement.ts:349:14
       throw new GatewayLedgerSettlementConflictError("settlement_lease_conflict");
     }
     await db.updateTable("concurrency_lease").set({ released_at: now })
-      .where("id", "in", leaseIds)
+      .where("", "in", leaseIds)
       .where("released_at", "is", null).execute();
   }
killedBy: POOL-043 结账与项目归属并发边界 终态撤权一次提交全部事实，汇总既有 Attempt 且重放不重复结算
statusReason: zero-length delimited identifier at or near """"

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement.ts:357:31
 export async function insertLedgerTransaction(
   db: Kysely<Database>,
   input: CreateLedgerTransactionInput,
-): Promise<LedgerTransaction> {
-  return db.insertInto("ledger_transaction").values({
-    ai_request_id: input.ai_request_id,
-    enterprise_id: input.enterprise_id,
-    principal_id: input.principal_id,
-    total_input_tokens: input.total_input_tokens,
-    total_output_tokens: input.total_output_tokens,
-    total_cache_tokens: input.total_cache_tokens,
-    total_reasoning_tokens: input.total_reasoning_tokens ?? 0n,
-    total_deducted_quota: input.total_deducted_quota,
-    total_api_cost: input.total_api_cost,
-    overage: input.overage ?? false,
-    usage_quality: input.usage_quality,
-    attempt_count: input.attempt_count,
-    status: "SETTLED",
-    created_at: new Date(),
-  }).returningAll().executeTakeFirstOrThrow();
-}
+): Promise<LedgerTransaction> {}
 
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: Cannot read properties of undefined (reading 'ai_request_id')

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:365:29
     total_input_tokens: input.total_input_tokens,
     total_output_tokens: input.total_output_tokens,
     total_cache_tokens: input.total_cache_tokens,
-    total_reasoning_tokens: input.total_reasoning_tokens ?? 0n,
+    total_reasoning_tokens: input.total_reasoning_tokens && 0n,
     total_deducted_quota: input.total_deducted_quota,
     total_api_cost: input.total_api_cost,
killedBy: POOL-043 结账与项目归属并发边界 dedup 重放逐字段核验完整 usage 与 ledger_line 冻结事实
statusReason: promise rejected "Error: ledger_transaction_conflict" instead of resolving

[Killed] BooleanLiteral
src/repositories/gateway-ledger-settlement.ts:368:31
     total_reasoning_tokens: input.total_reasoning_tokens ?? 0n,
     total_deducted_quota: input.total_deducted_quota,
     total_api_cost: input.total_api_cost,
-    overage: input.overage ?? false,
+    overage: input.overage ?? true,
     usage_quality: input.usage_quality,
     attempt_count: input.attempt_count,
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: ledger_transaction_conflict

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement.ts:368:14
     total_reasoning_tokens: input.total_reasoning_tokens ?? 0n,
     total_deducted_quota: input.total_deducted_quota,
     total_api_cost: input.total_api_cost,
-    overage: input.overage ?? false,
+    overage: input.overage && false,
     usage_quality: input.usage_quality,
     attempt_count: input.attempt_count,
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: ledger_transaction_conflict
