[Killed] ArithmeticOperator
src/repositories/operating-bill-write-barrier.ts:6:28
 import type { Database } from "../kysely.js";
 import { operatingBillMonthRange } from "./operating-bill-month.js";
 
-const SHANGHAI_OFFSET_MS = 8 * 60 * 60 * 1_000;
+const SHANGHAI_OFFSET_MS = 8 * 60 * 60 / 1_000;
 
 export class OperatingBillClosedError extends Error {}
killedBy: POOL-043 经营账单结算屏障 以北京时间月界线确定 ledger_line 账期
statusReason: expected '2026-07' to be '2026-08' // Object.is equality

[Killed] ArithmeticOperator
src/repositories/operating-bill-write-barrier.ts:6:28
 import type { Database } from "../kysely.js";
 import { operatingBillMonthRange } from "./operating-bill-month.js";
 
-const SHANGHAI_OFFSET_MS = 8 * 60 * 60 * 1_000;
+const SHANGHAI_OFFSET_MS = 8 * 60 / 60 * 1_000;
 
 export class OperatingBillClosedError extends Error {}
killedBy: POOL-043 经营账单结算屏障 以北京时间月界线确定 ledger_line 账期
statusReason: expected '2026-07' to be '2026-08' // Object.is equality

[Killed] BlockStatement
src/repositories/operating-bill-write-barrier.ts:11:59
 export class OperatingBillClosedError extends Error {}
 
 /** 结算事实时间所属的北京时间经营账期。 */
-export function operatingBillMonthAt(value: Date): string {
-  const shanghai = new Date(value.getTime() + SHANGHAI_OFFSET_MS);
-  return `${shanghai.getUTCFullYear()}-${String(shanghai.getUTCMonth() + 1).padStart(2, "0")}`;
-}
+export function operatingBillMonthAt(value: Date): string {}
 
 /**
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] ArithmeticOperator
src/repositories/operating-bill-write-barrier.ts:12:29
 
 /** 结算事实时间所属的北京时间经营账期。 */
 export function operatingBillMonthAt(value: Date): string {
-  const shanghai = new Date(value.getTime() + SHANGHAI_OFFSET_MS);
+  const shanghai = new Date(value.getTime() - SHANGHAI_OFFSET_MS);
   return `${shanghai.getUTCFullYear()}-${String(shanghai.getUTCMonth() + 1).padStart(2, "0")}`;
 }
killedBy: POOL-043 经营账单结算屏障 以北京时间月界线确定 ledger_line 账期
statusReason: expected '2026-07' to be '2026-08' // Object.is equality

[Killed] ArithmeticOperator
src/repositories/operating-bill-write-barrier.ts:13:49
 /** 结算事实时间所属的北京时间经营账期。 */
 export function operatingBillMonthAt(value: Date): string {
   const shanghai = new Date(value.getTime() + SHANGHAI_OFFSET_MS);
-  return `${shanghai.getUTCFullYear()}-${String(shanghai.getUTCMonth() + 1).padStart(2, "0")}`;
+  return `${shanghai.getUTCFullYear()}-${String(shanghai.getUTCMonth() - 1).padStart(2, "0")}`;
 }
 
killedBy: POOL-043 经营账单结算屏障 以北京时间月界线确定 ledger_line 账期
statusReason: expected '2026-05' to be '2026-07' // Object.is equality

[Killed] BlockStatement
src/repositories/operating-bill-write-barrier.ts:24:18
   db: Kysely<Database>,
   enterpriseId: string,
   month: string,
-): Promise<void> {
-  operatingBillMonthRange(month);
-  const lockKey = `qianliu:operating-bill:${enterpriseId}:${month}`;
-  await sql`SELECT pg_advisory_xact_lock(hashtextextended(${lockKey}::text, 0::bigint))`
-    .execute(db);
-}
+): Promise<void> {}
 
 /**
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: close_month_advisory_lock_not_observed

[Killed] StringLiteral
src/repositories/operating-bill-write-barrier.ts:26:19
   month: string,
 ): Promise<void> {
   operatingBillMonthRange(month);
-  const lockKey = `qianliu:operating-bill:${enterpriseId}:${month}`;
+  const lockKey = ``;
   await sql`SELECT pg_advisory_xact_lock(hashtextextended(${lockKey}::text, 0::bigint))`
     .execute(db);
killedBy: POOL-043 结账与项目归属并发边界 不同企业同月屏障相互独立
statusReason: promise rejected "error: canceling statement due to lock ti… { …(15) }" instead of resolving

[Killed] BlockStatement
src/repositories/operating-bill-write-barrier.ts:40:18
   db: Kysely<Database>,
   enterpriseId: string,
   writtenAt: Date,
-): Promise<void> {
-  const month = operatingBillMonthAt(writtenAt);
-  await acquireOperatingBillMonthWriteBarrier(db, enterpriseId, month);
-  const { monthDate } = operatingBillMonthRange(month);
-  const period = await db.selectFrom("operating_bill_period")
-    .select(["id", "status"])
-    .where("enterprise_id", "=", enterpriseId)
-    .where("period_month", "=", monthDate)
-    .forUpdate()
-    .executeTakeFirst();
-  if (period?.status === "CLOSED") throw new OperatingBillClosedError();
-  if (period) {
-    await db.updateTable("operating_bill_period")
-      .set({ updated_at: writtenAt })
-      .where("id", "=", period.id)
-      .where("enterprise_id", "=", enterpriseId)
-      .execute();
-  }
-}
+): Promise<void> {}
 
 /**
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: close_month_advisory_lock_not_observed

[Killed] StringLiteral
src/repositories/operating-bill-write-barrier.ts:44:38
   const month = operatingBillMonthAt(writtenAt);
   await acquireOperatingBillMonthWriteBarrier(db, enterpriseId, month);
   const { monthDate } = operatingBillMonthRange(month);
-  const period = await db.selectFrom("operating_bill_period")
+  const period = await db.selectFrom("")
     .select(["id", "status"])
     .where("enterprise_id", "=", enterpriseId)
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/operating-bill-write-barrier.ts:45:14
   await acquireOperatingBillMonthWriteBarrier(db, enterpriseId, month);
   const { monthDate } = operatingBillMonthRange(month);
   const period = await db.selectFrom("operating_bill_period")
-    .select(["id", "status"])
+    .select(["", "status"])
     .where("enterprise_id", "=", enterpriseId)
     .where("period_month", "=", monthDate)
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/operating-bill-write-barrier.ts:45:20
   await acquireOperatingBillMonthWriteBarrier(db, enterpriseId, month);
   const { monthDate } = operatingBillMonthRange(month);
   const period = await db.selectFrom("operating_bill_period")
-    .select(["id", "status"])
+    .select(["id", ""])
     .where("enterprise_id", "=", enterpriseId)
     .where("period_month", "=", monthDate)
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/operating-bill-write-barrier.ts:46:12
   const { monthDate } = operatingBillMonthRange(month);
   const period = await db.selectFrom("operating_bill_period")
     .select(["id", "status"])
-    .where("enterprise_id", "=", enterpriseId)
+    .where("", "=", enterpriseId)
     .where("period_month", "=", monthDate)
     .forUpdate()
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/operating-bill-write-barrier.ts:47:28
   const period = await db.selectFrom("operating_bill_period")
     .select(["id", "status"])
     .where("enterprise_id", "=", enterpriseId)
-    .where("period_month", "=", monthDate)
+    .where("period_month", "", monthDate)
     .forUpdate()
     .executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] OptionalChaining
src/repositories/operating-bill-write-barrier.ts:50:7
     .where("period_month", "=", monthDate)
     .forUpdate()
     .executeTakeFirst();
-  if (period?.status === "CLOSED") throw new OperatingBillClosedError();
+  if (period.status === "CLOSED") throw new OperatingBillClosedError();
   if (period) {
     await db.updateTable("operating_bill_period")
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] ConditionalExpression
src/repositories/operating-bill-write-barrier.ts:50:7
     .where("period_month", "=", monthDate)
     .forUpdate()
     .executeTakeFirst();
-  if (period?.status === "CLOSED") throw new OperatingBillClosedError();
+  if (true) throw new OperatingBillClosedError();
   if (period) {
     await db.updateTable("operating_bill_period")
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] ConditionalExpression
src/repositories/operating-bill-write-barrier.ts:51:7
     .forUpdate()
     .executeTakeFirst();
   if (period?.status === "CLOSED") throw new OperatingBillClosedError();
-  if (period) {
+  if (true) {
     await db.updateTable("operating_bill_period")
       .set({ updated_at: writtenAt })
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] BlockStatement
src/repositories/operating-bill-write-barrier.ts:51:15
     .forUpdate()
     .executeTakeFirst();
   if (period?.status === "CLOSED") throw new OperatingBillClosedError();
-  if (period) {
-    await db.updateTable("operating_bill_period")
-      .set({ updated_at: writtenAt })
-      .where("id", "=", period.id)
-      .where("enterprise_id", "=", enterpriseId)
-      .execute();
-  }
+  if (period) {}
 }
 
killedBy: POOL-043 结账与项目归属并发边界 DRAFT 账期接受结算并触碰行版本
statusReason: expected 946684800000 to be greater than 946684800000

[Killed] ObjectLiteral
src/repositories/operating-bill-write-barrier.ts:53:12
   if (period?.status === "CLOSED") throw new OperatingBillClosedError();
   if (period) {
     await db.updateTable("operating_bill_period")
-      .set({ updated_at: writtenAt })
+      .set({})
       .where("id", "=", period.id)
       .where("enterprise_id", "=", enterpriseId)
killedBy: POOL-043 结账与项目归属并发边界 DRAFT 账期接受结算并触碰行版本
statusReason: promise rejected "error: syntax error at or near "where" { …(15) }" instead of resolving

[Killed] StringLiteral
src/repositories/operating-bill-write-barrier.ts:55:14
     await db.updateTable("operating_bill_period")
       .set({ updated_at: writtenAt })
       .where("id", "=", period.id)
-      .where("enterprise_id", "=", enterpriseId)
+      .where("", "=", enterpriseId)
       .execute();
   }
killedBy: POOL-043 结账与项目归属并发边界 DRAFT 账期接受结算并触碰行版本
statusReason: promise rejected "error: zero-length delimited identifier a… { …(15) }" instead of resolving

[Killed] ConditionalExpression
src/repositories/operating-bill-write-barrier.ts:71:26
   now: Date,
 ): Promise<boolean> {
   const { start, end } = operatingBillMonthRange(month);
-  const isCurrentMonth = operatingBillMonthAt(now) === month;
+  const isCurrentMonth = false;
   const pending = await sql<{ pending: boolean }>`
     SELECT (
killedBy: POOL-043 结账与项目归属并发边界 当前月保守拦截企业在途请求，历史空月不被误拦
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/repositories/operating-bill-write-barrier.ts:71:26
   now: Date,
 ): Promise<boolean> {
   const { start, end } = operatingBillMonthRange(month);
-  const isCurrentMonth = operatingBillMonthAt(now) === month;
+  const isCurrentMonth = true;
   const pending = await sql<{ pending: boolean }>`
     SELECT (
killedBy: POOL-043 结账与项目归属并发边界 当前月保守拦截企业在途请求，历史空月不被误拦
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/repositories/operating-bill-write-barrier.ts:171:10
       )
     ) AS pending
   `.execute(db);
-  return pending.rows[0]?.pending ?? false;
+  return pending.rows[0]?.pending && false;
 }
 
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: promise resolved "{ gaps: [ { …(8) }, { …(6) } ], …(17) }" instead of rejecting

[NoCoverage] BooleanLiteral
src/repositories/operating-bill-write-barrier.ts:171:38
       )
     ) AS pending
   `.execute(db);
-  return pending.rows[0]?.pending ?? false;
+  return pending.rows[0]?.pending ?? true;
 }
 
