[Killed] BlockStatement
src/repositories/gateway-ledger-guarded-writes.ts:48:12
   status: string,
   errorClassification: string | null,
   errorCode: string | null,
-): boolean {
-  return request.status === status
-    && request.error_classification === errorClassification
-    && request.error_code === errorCode;
-}
+): boolean {}
 
 /** @internal 任一结算事实存在时，早退入口都不得越过原子 finalize。 */
killedBy: POOL-043 结账与项目归属并发边界 无事实早退可幂等发布 terminal，随后所有结算写入口均 fail-closed
statusReason: promise rejected "Error: settlement_terminal_conflict" instead of resolving

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:49:10
   errorClassification: string | null,
   errorCode: string | null,
 ): boolean {
-  return request.status === status
-    && request.error_classification === errorClassification
-    && request.error_code === errorCode;
+  return request.status === status && request.error_classification === errorClassification || request.error_code === errorCode;
 }
 
killedBy: POOL-043 结账与项目归属并发边界 无事实早退可幂等发布 terminal，随后所有结算写入口均 fail-closed
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:49:10
   errorClassification: string | null,
   errorCode: string | null,
 ): boolean {
-  return request.status === status
-    && request.error_classification === errorClassification
+  return request.status === status || request.error_classification === errorClassification
     && request.error_code === errorCode;
 }
killedBy: POOL-043 兼容写入口纯不变量 终态幂等同时比较状态、错误分类与错误码
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:50:8
   errorCode: string | null,
 ): boolean {
   return request.status === status
-    && request.error_classification === errorClassification
+    && request.error_classification !== errorClassification
     && request.error_code === errorCode;
 }
killedBy: POOL-043 兼容写入口纯不变量 终态幂等同时比较状态、错误分类与错误码
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:50:8
   errorCode: string | null,
 ): boolean {
   return request.status === status
-    && request.error_classification === errorClassification
+    && true
     && request.error_code === errorCode;
 }
killedBy: POOL-043 兼容写入口纯不变量 终态幂等同时比较状态、错误分类与错误码
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:51:8
 ): boolean {
   return request.status === status
     && request.error_classification === errorClassification
-    && request.error_code === errorCode;
+    && true;
 }
 
killedBy: POOL-043 兼容写入口纯不变量 终态幂等同时比较状态、错误分类与错误码
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:51:8
 ): boolean {
   return request.status === status
     && request.error_classification === errorClassification
-    && request.error_code === errorCode;
+    && request.error_code !== errorCode;
 }
 
killedBy: POOL-043 兼容写入口纯不变量 终态幂等同时比较状态、错误分类与错误码
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/repositories/gateway-ledger-guarded-writes.ts:60:12
   usage: unknown,
   line: unknown,
   transaction: unknown,
-): boolean {
-  return attemptCount > 0
-    || usage !== undefined
-    || line !== undefined
-    || transaction !== undefined;
-}
+): boolean {}
 
 /** @internal 兼容 ledger 写入口的租户、请求、资源模式和主体身份必须闭合。 */
killedBy: POOL-043 兼容写入口纯不变量 任意 attempt、usage、line、transaction 存在都算结算事实
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:61:10
   line: unknown,
   transaction: unknown,
 ): boolean {
-  return attemptCount > 0
+  return attemptCount <= 0
     || usage !== undefined
     || line !== undefined
killedBy: POOL-043 兼容写入口纯不变量 任意 attempt、usage、line、transaction 存在都算结算事实
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:61:10
   line: unknown,
   transaction: unknown,
 ): boolean {
-  return attemptCount > 0
-    || usage !== undefined
+  return attemptCount > 0 && usage !== undefined
     || line !== undefined
     || transaction !== undefined;
killedBy: POOL-043 兼容写入口纯不变量 任意 attempt、usage、line、transaction 存在都算结算事实
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:62:8
   transaction: unknown,
 ): boolean {
   return attemptCount > 0
-    || usage !== undefined
+    || usage === undefined
     || line !== undefined
     || transaction !== undefined;
killedBy: POOL-043 兼容写入口纯不变量 任意 attempt、usage、line、transaction 存在都算结算事实
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:62:8
   transaction: unknown,
 ): boolean {
   return attemptCount > 0
-    || usage !== undefined
+    || false
     || line !== undefined
     || transaction !== undefined;
killedBy: POOL-043 兼容写入口纯不变量 任意 attempt、usage、line、transaction 存在都算结算事实
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:63:8
 ): boolean {
   return attemptCount > 0
     || usage !== undefined
-    || line !== undefined
+    || false
     || transaction !== undefined;
 }
killedBy: POOL-043 兼容写入口纯不变量 任意 attempt、usage、line、transaction 存在都算结算事实
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:63:8
 ): boolean {
   return attemptCount > 0
     || usage !== undefined
-    || line !== undefined
+    || line === undefined
     || transaction !== undefined;
 }
killedBy: POOL-043 兼容写入口纯不变量 任意 attempt、usage、line、transaction 存在都算结算事实
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:64:8
   return attemptCount > 0
     || usage !== undefined
     || line !== undefined
-    || transaction !== undefined;
+    || false;
 }
 
killedBy: POOL-043 兼容写入口纯不变量 任意 attempt、usage、line、transaction 存在都算结算事实
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:64:8
   return attemptCount > 0
     || usage !== undefined
     || line !== undefined
-    || transaction !== undefined;
+    || transaction === undefined;
 }
 
killedBy: POOL-043 兼容写入口纯不变量 任意 attempt、usage、line、transaction 存在都算结算事实
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/repositories/gateway-ledger-guarded-writes.ts:72:48
   usage: GuardedLedgerUsageIdentity | undefined,
   requestPrincipalId: string,
   input: LedgerLineInput,
-): asserts usage is GuardedLedgerUsageIdentity {
-  if (!usage
-    || usage.ai_request_id !== input.ai_request_id
-    || usage.enterprise_id !== input.enterprise_id
-    || usage.upstream_attempt_id !== input.upstream_attempt_id
-    || usage.provider_resource_id !== input.provider_resource_id
-    || usage.resource_enterprise_id !== input.enterprise_id
-    || usage.mode !== input.resource_mode
-    || requestPrincipalId !== input.principal_id) {
-    throw new GatewayLedgerSettlementConflictError("ledger_usage_conflict");
-  }
-}
+): asserts usage is GuardedLedgerUsageIdentity {}
 
 /** 无结算事实的早退请求才能直接发布 terminal；有事实时必须走原子 finalize。 */
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:73:7
   requestPrincipalId: string,
   input: LedgerLineInput,
 ): asserts usage is GuardedLedgerUsageIdentity {
-  if (!usage
-    || usage.ai_request_id !== input.ai_request_id
-    || usage.enterprise_id !== input.enterprise_id
-    || usage.upstream_attempt_id !== input.upstream_attempt_id
-    || usage.provider_resource_id !== input.provider_resource_id
-    || usage.resource_enterprise_id !== input.enterprise_id
-    || usage.mode !== input.resource_mode
-    || requestPrincipalId !== input.principal_id) {
+  if (false) {
     throw new GatewayLedgerSettlementConflictError("ledger_usage_conflict");
   }
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:73:7
   requestPrincipalId: string,
   input: LedgerLineInput,
 ): asserts usage is GuardedLedgerUsageIdentity {
-  if (!usage
-    || usage.ai_request_id !== input.ai_request_id
-    || usage.enterprise_id !== input.enterprise_id
-    || usage.upstream_attempt_id !== input.upstream_attempt_id
-    || usage.provider_resource_id !== input.provider_resource_id
-    || usage.resource_enterprise_id !== input.enterprise_id
-    || usage.mode !== input.resource_mode
+  if (false
     || requestPrincipalId !== input.principal_id) {
     throw new GatewayLedgerSettlementConflictError("ledger_usage_conflict");
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:74:8
   input: LedgerLineInput,
 ): asserts usage is GuardedLedgerUsageIdentity {
   if (!usage
-    || usage.ai_request_id !== input.ai_request_id
+    || usage.ai_request_id === input.ai_request_id
     || usage.enterprise_id !== input.enterprise_id
     || usage.upstream_attempt_id !== input.upstream_attempt_id
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to not throw an error but 'Error: ledger_usage_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:74:8
   input: LedgerLineInput,
 ): asserts usage is GuardedLedgerUsageIdentity {
   if (!usage
-    || usage.ai_request_id !== input.ai_request_id
+    || false
     || usage.enterprise_id !== input.enterprise_id
     || usage.upstream_attempt_id !== input.upstream_attempt_id
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:75:8
 ): asserts usage is GuardedLedgerUsageIdentity {
   if (!usage
     || usage.ai_request_id !== input.ai_request_id
-    || usage.enterprise_id !== input.enterprise_id
+    || usage.enterprise_id === input.enterprise_id
     || usage.upstream_attempt_id !== input.upstream_attempt_id
     || usage.provider_resource_id !== input.provider_resource_id
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to not throw an error but 'Error: ledger_usage_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:75:8
 ): asserts usage is GuardedLedgerUsageIdentity {
   if (!usage
     || usage.ai_request_id !== input.ai_request_id
-    || usage.enterprise_id !== input.enterprise_id
+    || false
     || usage.upstream_attempt_id !== input.upstream_attempt_id
     || usage.provider_resource_id !== input.provider_resource_id
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:76:8
   if (!usage
     || usage.ai_request_id !== input.ai_request_id
     || usage.enterprise_id !== input.enterprise_id
-    || usage.upstream_attempt_id !== input.upstream_attempt_id
+    || false
     || usage.provider_resource_id !== input.provider_resource_id
     || usage.resource_enterprise_id !== input.enterprise_id
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:76:8
   if (!usage
     || usage.ai_request_id !== input.ai_request_id
     || usage.enterprise_id !== input.enterprise_id
-    || usage.upstream_attempt_id !== input.upstream_attempt_id
+    || usage.upstream_attempt_id === input.upstream_attempt_id
     || usage.provider_resource_id !== input.provider_resource_id
     || usage.resource_enterprise_id !== input.enterprise_id
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to not throw an error but 'Error: ledger_usage_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:77:8
     || usage.ai_request_id !== input.ai_request_id
     || usage.enterprise_id !== input.enterprise_id
     || usage.upstream_attempt_id !== input.upstream_attempt_id
-    || usage.provider_resource_id !== input.provider_resource_id
+    || false
     || usage.resource_enterprise_id !== input.enterprise_id
     || usage.mode !== input.resource_mode
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:77:8
     || usage.ai_request_id !== input.ai_request_id
     || usage.enterprise_id !== input.enterprise_id
     || usage.upstream_attempt_id !== input.upstream_attempt_id
-    || usage.provider_resource_id !== input.provider_resource_id
+    || usage.provider_resource_id === input.provider_resource_id
     || usage.resource_enterprise_id !== input.enterprise_id
     || usage.mode !== input.resource_mode
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to not throw an error but 'Error: ledger_usage_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:78:8
     || usage.enterprise_id !== input.enterprise_id
     || usage.upstream_attempt_id !== input.upstream_attempt_id
     || usage.provider_resource_id !== input.provider_resource_id
-    || usage.resource_enterprise_id !== input.enterprise_id
+    || false
     || usage.mode !== input.resource_mode
     || requestPrincipalId !== input.principal_id) {
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:78:8
     || usage.enterprise_id !== input.enterprise_id
     || usage.upstream_attempt_id !== input.upstream_attempt_id
     || usage.provider_resource_id !== input.provider_resource_id
-    || usage.resource_enterprise_id !== input.enterprise_id
+    || usage.resource_enterprise_id === input.enterprise_id
     || usage.mode !== input.resource_mode
     || requestPrincipalId !== input.principal_id) {
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to not throw an error but 'Error: ledger_usage_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:79:8
     || usage.upstream_attempt_id !== input.upstream_attempt_id
     || usage.provider_resource_id !== input.provider_resource_id
     || usage.resource_enterprise_id !== input.enterprise_id
-    || usage.mode !== input.resource_mode
+    || false
     || requestPrincipalId !== input.principal_id) {
     throw new GatewayLedgerSettlementConflictError("ledger_usage_conflict");
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:79:8
     || usage.upstream_attempt_id !== input.upstream_attempt_id
     || usage.provider_resource_id !== input.provider_resource_id
     || usage.resource_enterprise_id !== input.enterprise_id
-    || usage.mode !== input.resource_mode
+    || usage.mode === input.resource_mode
     || requestPrincipalId !== input.principal_id) {
     throw new GatewayLedgerSettlementConflictError("ledger_usage_conflict");
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to not throw an error but 'Error: ledger_usage_conflict' was thrown

[Killed] BlockStatement
src/repositories/gateway-ledger-guarded-writes.ts:80:51
     || usage.provider_resource_id !== input.provider_resource_id
     || usage.resource_enterprise_id !== input.enterprise_id
     || usage.mode !== input.resource_mode
-    || requestPrincipalId !== input.principal_id) {
-    throw new GatewayLedgerSettlementConflictError("ledger_usage_conflict");
-  }
+    || requestPrincipalId !== input.principal_id) {}
 }
 
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:80:8
     || usage.provider_resource_id !== input.provider_resource_id
     || usage.resource_enterprise_id !== input.enterprise_id
     || usage.mode !== input.resource_mode
-    || requestPrincipalId !== input.principal_id) {
+    || requestPrincipalId === input.principal_id) {
     throw new GatewayLedgerSettlementConflictError("ledger_usage_conflict");
   }
killedBy: POOL-043 兼容写入口纯不变量 兼容 Ledger 入口逐字段闭合租户、请求、Attempt、资源、模式与主体
statusReason: expected [Function] to not throw an error but 'Error: ledger_usage_conflict' was thrown

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:95:67
 ): Promise<void> {
   await db.transaction().execute(async (trx) => {
     const request = await trx.selectFrom("ai_request")
-      .select(["enterprise_id", "status", "error_classification", "error_code"])
+      .select(["enterprise_id", "status", "error_classification", ""])
       .where("id", "=", id).forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'settlement_request_not_found' but got 'zero-length delimited identifier at o…'

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:95:16
 ): Promise<void> {
   await db.transaction().execute(async (trx) => {
     const request = await trx.selectFrom("ai_request")
-      .select(["enterprise_id", "status", "error_classification", "error_code"])
+      .select(["", "status", "error_classification", "error_code"])
       .where("id", "=", id).forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'settlement_request_not_found' but got 'zero-length delimited identifier at o…'

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:96:20
   await db.transaction().execute(async (trx) => {
     const request = await trx.selectFrom("ai_request")
       .select(["enterprise_id", "status", "error_classification", "error_code"])
-      .where("id", "=", id).forUpdate().executeTakeFirst();
+      .where("id", "", id).forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
     const nextErrorClassification = errorClassification ?? null;
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'settlement_request_not_found' but got 'invalid operator ""'

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:96:14
   await db.transaction().execute(async (trx) => {
     const request = await trx.selectFrom("ai_request")
       .select(["enterprise_id", "status", "error_classification", "error_code"])
-      .where("id", "=", id).forUpdate().executeTakeFirst();
+      .where("", "=", id).forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
     const nextErrorClassification = errorClassification ?? null;
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'settlement_request_not_found' but got 'zero-length delimited identifier at o…'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:97:9
     const request = await trx.selectFrom("ai_request")
       .select(["enterprise_id", "status", "error_classification", "error_code"])
       .where("id", "=", id).forUpdate().executeTakeFirst();
-    if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
+    if (false) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
     const nextErrorClassification = errorClassification ?? null;
     const nextErrorCode = errorCode ?? null;
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'settlement_request_not_found' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/repositories/gateway-ledger-guarded-writes.ts:97:9
     const request = await trx.selectFrom("ai_request")
       .select(["enterprise_id", "status", "error_classification", "error_code"])
       .where("id", "=", id).forUpdate().executeTakeFirst();
-    if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
+    if (request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
     const nextErrorClassification = errorClassification ?? null;
     const nextErrorCode = errorCode ?? null;
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'settlement_request_not_found' but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:98:37
       .select(["enterprise_id", "status", "error_classification", "error_code"])
       .where("id", "=", id).forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
-    const nextErrorClassification = errorClassification ?? null;
+    const nextErrorClassification = errorClassification && null;
     const nextErrorCode = errorCode ?? null;
     if (request.status !== "IN_PROGRESS") {
killedBy: POOL-043 结账与项目归属并发边界 无事实早退可幂等发布 terminal，随后所有结算写入口均 fail-closed
statusReason: expected { …(22) } to match object { status: 'FAILED', …(2) }
(19 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:99:27
       .where("id", "=", id).forUpdate().executeTakeFirst();
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
     const nextErrorClassification = errorClassification ?? null;
-    const nextErrorCode = errorCode ?? null;
+    const nextErrorCode = errorCode && null;
     if (request.status !== "IN_PROGRESS") {
       if (isSameTerminalRequest(
killedBy: POOL-043 结账与项目归属并发边界 无事实早退可幂等发布 terminal，随后所有结算写入口均 fail-closed
statusReason: expected { …(22) } to match object { status: 'FAILED', …(2) }
(19 matching properties omitted from actual)

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:100:9
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
     const nextErrorClassification = errorClassification ?? null;
     const nextErrorCode = errorCode ?? null;
-    if (request.status !== "IN_PROGRESS") {
+    if (true) {
       if (isSameTerminalRequest(
         request, status, nextErrorClassification, nextErrorCode,
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'unsettled_request_terminal_write' but got 'settlement_terminal_conflict'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:100:9
     if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
     const nextErrorClassification = errorClassification ?? null;
     const nextErrorCode = errorCode ?? null;
-    if (request.status !== "IN_PROGRESS") {
+    if (false) {
       if (isSameTerminalRequest(
         request, status, nextErrorClassification, nextErrorCode,
killedBy: POOL-043 结账与项目归属并发边界 无事实早退可幂等发布 terminal，随后所有结算写入口均 fail-closed
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:101:11
     const nextErrorClassification = errorClassification ?? null;
     const nextErrorCode = errorCode ?? null;
     if (request.status !== "IN_PROGRESS") {
-      if (isSameTerminalRequest(
-        request, status, nextErrorClassification, nextErrorCode,
-      )) {
+      if (false) {
         await ensureRequestAttributionSnapshot(trx, request.enterprise_id, id);
         return;
killedBy: POOL-043 结账与项目归属并发边界 无事实早退可幂等发布 terminal，随后所有结算写入口均 fail-closed
statusReason: promise rejected "Error: settlement_terminal_conflict" instead of resolving

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:101:11
     const nextErrorClassification = errorClassification ?? null;
     const nextErrorCode = errorCode ?? null;
     if (request.status !== "IN_PROGRESS") {
-      if (isSameTerminalRequest(
-        request, status, nextErrorClassification, nextErrorCode,
-      )) {
+      if (true) {
         await ensureRequestAttributionSnapshot(trx, request.enterprise_id, id);
         return;
killedBy: POOL-043 结账与项目归属并发边界 无事实早退可幂等发布 terminal，随后所有结算写入口均 fail-closed
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/repositories/gateway-ledger-guarded-writes.ts:103:10
     if (request.status !== "IN_PROGRESS") {
       if (isSameTerminalRequest(
         request, status, nextErrorClassification, nextErrorCode,
-      )) {
-        await ensureRequestAttributionSnapshot(trx, request.enterprise_id, id);
-        return;
-      }
+      )) {}
       throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 无事实早退可幂等发布 terminal，随后所有结算写入口均 fail-closed
statusReason: promise rejected "Error: settlement_terminal_conflict" instead of resolving

[Killed] ArrowFunction
src/repositories/gateway-ledger-guarded-writes.ts:110:15
       throw new GatewayLedgerSettlementConflictError("settlement_terminal_conflict");
     }
     const attempts = await trx.selectFrom("upstream_attempt")
-      .select(({ fn }) => fn.countAll<string>().as("count"))
+      .select(() => undefined)
       .where("ai_request_id", "=", id)
       .executeTakeFirstOrThrow();
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'unsettled_request_terminal_write' but got 'invalid aliased expression: undefined'

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:111:14
     }
     const attempts = await trx.selectFrom("upstream_attempt")
       .select(({ fn }) => fn.countAll<string>().as("count"))
-      .where("ai_request_id", "=", id)
+      .where("", "=", id)
       .executeTakeFirstOrThrow();
     const usage = await trx.selectFrom("usage_event").select("id")
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'unsettled_request_terminal_write' but got 'zero-length delimited identifier at o…'

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:114:31
       .where("ai_request_id", "=", id)
       .executeTakeFirstOrThrow();
     const usage = await trx.selectFrom("usage_event").select("id")
-      .where("ai_request_id", "=", id).executeTakeFirst();
+      .where("ai_request_id", "", id).executeTakeFirst();
     const line = await trx.selectFrom("ledger_line").select("id")
       .where("ai_request_id", "=", id).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'unsettled_request_terminal_write' but got 'invalid operator ""'

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:114:14
       .where("ai_request_id", "=", id)
       .executeTakeFirstOrThrow();
     const usage = await trx.selectFrom("usage_event").select("id")
-      .where("ai_request_id", "=", id).executeTakeFirst();
+      .where("", "=", id).executeTakeFirst();
     const line = await trx.selectFrom("ledger_line").select("id")
       .where("ai_request_id", "=", id).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'unsettled_request_terminal_write' but got 'zero-length delimited identifier at o…'
