[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:115:61
       .executeTakeFirstOrThrow();
     const usage = await trx.selectFrom("usage_event").select("id")
       .where("ai_request_id", "=", id).executeTakeFirst();
-    const line = await trx.selectFrom("ledger_line").select("id")
+    const line = await trx.selectFrom("ledger_line").select("")
       .where("ai_request_id", "=", id).executeTakeFirst();
     const transaction = await trx.selectFrom("ledger_transaction").select("id")
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'unsettled_request_terminal_write' but got 'zero-length delimited identifier at o…'

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:116:31
     const usage = await trx.selectFrom("usage_event").select("id")
       .where("ai_request_id", "=", id).executeTakeFirst();
     const line = await trx.selectFrom("ledger_line").select("id")
-      .where("ai_request_id", "=", id).executeTakeFirst();
+      .where("ai_request_id", "", id).executeTakeFirst();
     const transaction = await trx.selectFrom("ledger_transaction").select("id")
       .where("ai_request_id", "=", id).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'unsettled_request_terminal_write' but got 'invalid operator ""'

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:118:31
     const line = await trx.selectFrom("ledger_line").select("id")
       .where("ai_request_id", "=", id).executeTakeFirst();
     const transaction = await trx.selectFrom("ledger_transaction").select("id")
-      .where("ai_request_id", "=", id).executeTakeFirst();
+      .where("ai_request_id", "", id).executeTakeFirst();
     if (hasSettlementFacts(Number(attempts.count), usage, line, transaction)) {
       throw new GatewayLedgerSettlementConflictError("unsettled_request_terminal_write");
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'unsettled_request_terminal_write' but got 'invalid operator ""'

[Killed] BlockStatement
src/repositories/gateway-ledger-guarded-writes.ts:119:79
       .where("ai_request_id", "=", id).executeTakeFirst();
     const transaction = await trx.selectFrom("ledger_transaction").select("id")
       .where("ai_request_id", "=", id).executeTakeFirst();
-    if (hasSettlementFacts(Number(attempts.count), usage, line, transaction)) {
-      throw new GatewayLedgerSettlementConflictError("unsettled_request_terminal_write");
-    }
+    if (hasSettlementFacts(Number(attempts.count), usage, line, transaction)) {}
     await trx.updateTable("ai_request").set({
       status,
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:119:9
       .where("ai_request_id", "=", id).executeTakeFirst();
     const transaction = await trx.selectFrom("ledger_transaction").select("id")
       .where("ai_request_id", "=", id).executeTakeFirst();
-    if (hasSettlementFacts(Number(attempts.count), usage, line, transaction)) {
+    if (true) {
       throw new GatewayLedgerSettlementConflictError("unsettled_request_terminal_write");
     }
killedBy: POOL-043 结账与项目归属并发边界 无错误字段的早退显式归一为 null，并正确保存 attempt 结果
statusReason: unsettled_request_terminal_write

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:120:54
     const transaction = await trx.selectFrom("ledger_transaction").select("id")
       .where("ai_request_id", "=", id).executeTakeFirst();
     if (hasSettlementFacts(Number(attempts.count), usage, line, transaction)) {
-      throw new GatewayLedgerSettlementConflictError("unsettled_request_terminal_write");
+      throw new GatewayLedgerSettlementConflictError("");
     }
     await trx.updateTable("ai_request").set({
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'unsettled_request_terminal_write' but got ''

[Killed] ObjectLiteral
src/repositories/gateway-ledger-guarded-writes.ts:122:45
     if (hasSettlementFacts(Number(attempts.count), usage, line, transaction)) {
       throw new GatewayLedgerSettlementConflictError("unsettled_request_terminal_write");
     }
-    await trx.updateTable("ai_request").set({
-      status,
-      finished_at: new Date(),
-      error_classification: nextErrorClassification,
-      error_code: nextErrorCode,
-    }).where("id", "=", id).where("status", "=", "IN_PROGRESS").execute();
+    await trx.updateTable("ai_request").set({}).where("id", "=", id).where("status", "=", "IN_PROGRESS").execute();
     // 无 usage/ledger 也是一次完整请求；冻结其时点归属便于完整审计。
     await ensureRequestAttributionSnapshot(trx, request.enterprise_id, id);
killedBy: POOL-043 结账与项目归属并发边界 无错误字段的早退显式归一为 null，并正确保存 attempt 结果
statusReason: syntax error at or near "where"

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:127:14
       finished_at: new Date(),
       error_classification: nextErrorClassification,
       error_code: nextErrorCode,
-    }).where("id", "=", id).where("status", "=", "IN_PROGRESS").execute();
+    }).where("", "=", id).where("status", "=", "IN_PROGRESS").execute();
     // 无 usage/ledger 也是一次完整请求；冻结其时点归属便于完整审计。
     await ensureRequestAttributionSnapshot(trx, request.enterprise_id, id);
killedBy: POOL-043 结账与项目归属并发边界 无错误字段的早退显式归一为 null，并正确保存 attempt 结果
statusReason: zero-length delimited identifier at or near """"

[Killed] BlockStatement
src/repositories/gateway-ledger-guarded-writes.ts:138:18
   db: Kysely<Database>,
   id: string,
   update: AttemptResultUpdate,
-): Promise<void> {
-  await db.transaction().execute(async (trx) => {
-    const attempt = await trx.selectFrom("upstream_attempt")
-      .select(["ai_request_id", "enterprise_id"])
-      .where("id", "=", id).executeTakeFirst();
-    if (!attempt) throw new GatewayLedgerSettlementConflictError("settlement_attempt_not_found");
-    await lockRequestForSettlementWrite(trx, attempt.enterprise_id, attempt.ai_request_id);
-    await trx.updateTable("upstream_attempt").set(update)
-      .where("id", "=", id)
-      .where("ai_request_id", "=", attempt.ai_request_id)
-      .where("enterprise_id", "=", attempt.enterprise_id).execute();
-  });
-}
+): Promise<void> {}
 
 /** 兼容旧调用方；真实 pipeline 应使用 usage + line 原子入口。 */
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: settlement_attempt_incomplete

[Killed] BlockStatement
src/repositories/gateway-ledger-guarded-writes.ts:139:49
   id: string,
   update: AttemptResultUpdate,
 ): Promise<void> {
-  await db.transaction().execute(async (trx) => {
-    const attempt = await trx.selectFrom("upstream_attempt")
-      .select(["ai_request_id", "enterprise_id"])
-      .where("id", "=", id).executeTakeFirst();
-    if (!attempt) throw new GatewayLedgerSettlementConflictError("settlement_attempt_not_found");
-    await lockRequestForSettlementWrite(trx, attempt.enterprise_id, attempt.ai_request_id);
-    await trx.updateTable("upstream_attempt").set(update)
-      .where("id", "=", id)
-      .where("ai_request_id", "=", attempt.ai_request_id)
-      .where("enterprise_id", "=", attempt.enterprise_id).execute();
-  });
+  await db.transaction().execute(async (trx) => {});
 }
 
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: settlement_attempt_incomplete

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:140:42
   update: AttemptResultUpdate,
 ): Promise<void> {
   await db.transaction().execute(async (trx) => {
-    const attempt = await trx.selectFrom("upstream_attempt")
+    const attempt = await trx.selectFrom("")
       .select(["ai_request_id", "enterprise_id"])
       .where("id", "=", id).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: zero-length delimited identifier at or near """"

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:143:9
     const attempt = await trx.selectFrom("upstream_attempt")
       .select(["ai_request_id", "enterprise_id"])
       .where("id", "=", id).executeTakeFirst();
-    if (!attempt) throw new GatewayLedgerSettlementConflictError("settlement_attempt_not_found");
+    if (false) throw new GatewayLedgerSettlementConflictError("settlement_attempt_not_found");
     await lockRequestForSettlementWrite(trx, attempt.enterprise_id, attempt.ai_request_id);
     await trx.updateTable("upstream_attempt").set(update)
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'settlement_attempt_not_found' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/repositories/gateway-ledger-guarded-writes.ts:143:9
     const attempt = await trx.selectFrom("upstream_attempt")
       .select(["ai_request_id", "enterprise_id"])
       .where("id", "=", id).executeTakeFirst();
-    if (!attempt) throw new GatewayLedgerSettlementConflictError("settlement_attempt_not_found");
+    if (attempt) throw new GatewayLedgerSettlementConflictError("settlement_attempt_not_found");
     await lockRequestForSettlementWrite(trx, attempt.enterprise_id, attempt.ai_request_id);
     await trx.updateTable("upstream_attempt").set(update)
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: settlement_attempt_not_found

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:145:27
       .where("id", "=", id).executeTakeFirst();
     if (!attempt) throw new GatewayLedgerSettlementConflictError("settlement_attempt_not_found");
     await lockRequestForSettlementWrite(trx, attempt.enterprise_id, attempt.ai_request_id);
-    await trx.updateTable("upstream_attempt").set(update)
+    await trx.updateTable("").set(update)
       .where("id", "=", id)
       .where("ai_request_id", "=", attempt.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:146:20
     if (!attempt) throw new GatewayLedgerSettlementConflictError("settlement_attempt_not_found");
     await lockRequestForSettlementWrite(trx, attempt.enterprise_id, attempt.ai_request_id);
     await trx.updateTable("upstream_attempt").set(update)
-      .where("id", "=", id)
+      .where("id", "", id)
       .where("ai_request_id", "=", attempt.ai_request_id)
       .where("enterprise_id", "=", attempt.enterprise_id).execute();
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:147:31
     await lockRequestForSettlementWrite(trx, attempt.enterprise_id, attempt.ai_request_id);
     await trx.updateTable("upstream_attempt").set(update)
       .where("id", "=", id)
-      .where("ai_request_id", "=", attempt.ai_request_id)
+      .where("ai_request_id", "", attempt.ai_request_id)
       .where("enterprise_id", "=", attempt.enterprise_id).execute();
   });
killedBy: POOL-043 结账与项目归属并发边界 账期不存在时 attempt-first 先发布在途屏障，完整 finalize 后才允许关账
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:160:42
   const createdAt = new Date();
   return db.transaction().execute(async (trx) => {
     await lockRequestForSettlementWrite(trx, input.enterprise_id, input.ai_request_id);
-    const attempt = await trx.selectFrom("upstream_attempt").select("id")
+    const attempt = await trx.selectFrom("").select("id")
       .where("id", "=", input.upstream_attempt_id)
       .where("enterprise_id", "=", input.enterprise_id)
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:161:20
   return db.transaction().execute(async (trx) => {
     await lockRequestForSettlementWrite(trx, input.enterprise_id, input.ai_request_id);
     const attempt = await trx.selectFrom("upstream_attempt").select("id")
-      .where("id", "=", input.upstream_attempt_id)
+      .where("id", "", input.upstream_attempt_id)
       .where("enterprise_id", "=", input.enterprise_id)
       .where("ai_request_id", "=", input.ai_request_id)
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: invalid operator ""

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:162:14
     await lockRequestForSettlementWrite(trx, input.enterprise_id, input.ai_request_id);
     const attempt = await trx.selectFrom("upstream_attempt").select("id")
       .where("id", "=", input.upstream_attempt_id)
-      .where("enterprise_id", "=", input.enterprise_id)
+      .where("", "=", input.enterprise_id)
       .where("ai_request_id", "=", input.ai_request_id)
       .where("provider_resource_id", "=", input.provider_resource_id)
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: zero-length delimited identifier at or near """"

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:164:38
       .where("id", "=", input.upstream_attempt_id)
       .where("enterprise_id", "=", input.enterprise_id)
       .where("ai_request_id", "=", input.ai_request_id)
-      .where("provider_resource_id", "=", input.provider_resource_id)
+      .where("provider_resource_id", "", input.provider_resource_id)
       .executeTakeFirst();
     if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: invalid operator ""

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:166:9
       .where("ai_request_id", "=", input.ai_request_id)
       .where("provider_resource_id", "=", input.provider_resource_id)
       .executeTakeFirst();
-    if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
+    if (true) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
     await guardOperatingBillLedgerWrite(trx, input.enterprise_id, createdAt);
     const result = await trx.insertInto("usage_event").values({
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: usage_attempt_conflict

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:166:9
       .where("ai_request_id", "=", input.ai_request_id)
       .where("provider_resource_id", "=", input.provider_resource_id)
       .executeTakeFirst();
-    if (!attempt) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
+    if (false) throw new GatewayLedgerSettlementConflictError("usage_attempt_conflict");
     await guardOperatingBillLedgerWrite(trx, input.enterprise_id, createdAt);
     const result = await trx.insertInto("usage_event").values({
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'usage_attempt_conflict' but got 'insert or update on table "usage_even…'

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:176:25
       input_tokens: input.input_tokens,
       output_tokens: input.output_tokens,
       cache_tokens: input.cache_tokens,
-      reasoning_tokens: input.reasoning_tokens ?? 0n,
+      reasoning_tokens: input.reasoning_tokens && 0n,
       usage_quality: input.usage_quality,
       dedup_key: input.dedup_key,
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: expected { …(13) } to match object { reasoning_tokens: '7', …(1) }
(11 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:179:26
       reasoning_tokens: input.reasoning_tokens ?? 0n,
       usage_quality: input.usage_quality,
       dedup_key: input.dedup_key,
-      upstream_usage_id: input.upstream_usage_id ?? null,
+      upstream_usage_id: input.upstream_usage_id && null,
       created_at: createdAt,
     }).onConflict((oc) => oc.column("dedup_key").doNothing())
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: expected { …(13) } to match object { reasoning_tokens: '7', …(1) }
(11 matching properties omitted from actual)

[Killed] ArrowFunction
src/repositories/gateway-ledger-guarded-writes.ts:181:19
       dedup_key: input.dedup_key,
       upstream_usage_id: input.upstream_usage_id ?? null,
       created_at: createdAt,
-    }).onConflict((oc) => oc.column("dedup_key").doNothing())
+    }).onConflict(() => undefined)
       .returningAll().execute();
     await ensureRequestAttributionSnapshot(trx, input.enterprise_id, input.ai_request_id);
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: Cannot read properties of undefined (reading 'toOperationNode')

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:198:39
       trx, input.enterprise_id, input.ai_request_id,
     );
     const usage = await trx.selectFrom("usage_event")
-      .innerJoin("provider_resource", "provider_resource.id", "usage_event.provider_resource_id")
+      .innerJoin("provider_resource", "", "usage_event.provider_resource_id")
       .select([
         "usage_event.created_at", "usage_event.ai_request_id", "usage_event.enterprise_id",
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:198:18
       trx, input.enterprise_id, input.ai_request_id,
     );
     const usage = await trx.selectFrom("usage_event")
-      .innerJoin("provider_resource", "provider_resource.id", "usage_event.provider_resource_id")
+      .innerJoin("", "provider_resource.id", "usage_event.provider_resource_id")
       .select([
         "usage_event.created_at", "usage_event.ai_request_id", "usage_event.enterprise_id",
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:200:64
     const usage = await trx.selectFrom("usage_event")
       .innerJoin("provider_resource", "provider_resource.id", "usage_event.provider_resource_id")
       .select([
-        "usage_event.created_at", "usage_event.ai_request_id", "usage_event.enterprise_id",
+        "usage_event.created_at", "usage_event.ai_request_id", "",
         "usage_event.upstream_attempt_id", "usage_event.provider_resource_id",
         "provider_resource.mode", "provider_resource.enterprise_id as resource_enterprise_id",
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:200:9
     const usage = await trx.selectFrom("usage_event")
       .innerJoin("provider_resource", "provider_resource.id", "usage_event.provider_resource_id")
       .select([
-        "usage_event.created_at", "usage_event.ai_request_id", "usage_event.enterprise_id",
+        "", "usage_event.ai_request_id", "usage_event.enterprise_id",
         "usage_event.upstream_attempt_id", "usage_event.provider_resource_id",
         "provider_resource.mode", "provider_resource.enterprise_id as resource_enterprise_id",
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:202:35
       .select([
         "usage_event.created_at", "usage_event.ai_request_id", "usage_event.enterprise_id",
         "usage_event.upstream_attempt_id", "usage_event.provider_resource_id",
-        "provider_resource.mode", "provider_resource.enterprise_id as resource_enterprise_id",
+        "provider_resource.mode", "",
       ])
       .where("usage_event.id", "=", input.usage_event_id).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:202:9
       .select([
         "usage_event.created_at", "usage_event.ai_request_id", "usage_event.enterprise_id",
         "usage_event.upstream_attempt_id", "usage_event.provider_resource_id",
-        "provider_resource.mode", "provider_resource.enterprise_id as resource_enterprise_id",
+        "", "provider_resource.enterprise_id as resource_enterprise_id",
       ])
       .where("usage_event.id", "=", input.usage_event_id).executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:204:32
         "usage_event.upstream_attempt_id", "usage_event.provider_resource_id",
         "provider_resource.mode", "provider_resource.enterprise_id as resource_enterprise_id",
       ])
-      .where("usage_event.id", "=", input.usage_event_id).executeTakeFirst();
+      .where("usage_event.id", "", input.usage_event_id).executeTakeFirst();
     assertGuardedLedgerIdentity(usage, request.principal_id, input);
     await guardOperatingBillLedgerWrite(trx, input.enterprise_id, usage.created_at);
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:207:27
       .where("usage_event.id", "=", input.usage_event_id).executeTakeFirst();
     assertGuardedLedgerIdentity(usage, request.principal_id, input);
     await guardOperatingBillLedgerWrite(trx, input.enterprise_id, usage.created_at);
-    return trx.insertInto("ledger_line").values({
+    return trx.insertInto("").values({
       ai_request_id: input.ai_request_id,
       enterprise_id: input.enterprise_id,
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:218:29
       raw_input_tokens: input.raw_input_tokens,
       raw_output_tokens: input.raw_output_tokens,
       raw_cache_tokens: input.raw_cache_tokens,
-      raw_reasoning_tokens: input.raw_reasoning_tokens ?? 0n,
+      raw_reasoning_tokens: input.raw_reasoning_tokens && 0n,
       deducted_quota: input.deducted_quota ?? null,
       api_cost: input.api_cost ?? null,
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: expected { …(20) } to match object { raw_input_tokens: '40', …(7) }
(12 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:219:23
       raw_output_tokens: input.raw_output_tokens,
       raw_cache_tokens: input.raw_cache_tokens,
       raw_reasoning_tokens: input.raw_reasoning_tokens ?? 0n,
-      deducted_quota: input.deducted_quota ?? null,
+      deducted_quota: input.deducted_quota && null,
       api_cost: input.api_cost ?? null,
       usage_quality: input.usage_quality,
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: expected { …(20) } to match object { raw_input_tokens: '40', …(7) }
(12 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:220:17
       raw_cache_tokens: input.raw_cache_tokens,
       raw_reasoning_tokens: input.raw_reasoning_tokens ?? 0n,
       deducted_quota: input.deducted_quota ?? null,
-      api_cost: input.api_cost ?? null,
+      api_cost: input.api_cost && null,
       usage_quality: input.usage_quality,
       billing_rule_id: input.billing_rule_id ?? null,
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: expected { …(20) } to match object { raw_input_tokens: '40', …(1) }
(18 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:222:24
       deducted_quota: input.deducted_quota ?? null,
       api_cost: input.api_cost ?? null,
       usage_quality: input.usage_quality,
-      billing_rule_id: input.billing_rule_id ?? null,
+      billing_rule_id: input.billing_rule_id && null,
       rule_version: input.rule_version ?? null,
       multiplier: input.multiplier ?? null,
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: expected { …(20) } to match object { raw_input_tokens: '40', …(7) }
(12 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:223:21
       api_cost: input.api_cost ?? null,
       usage_quality: input.usage_quality,
       billing_rule_id: input.billing_rule_id ?? null,
-      rule_version: input.rule_version ?? null,
+      rule_version: input.rule_version && null,
       multiplier: input.multiplier ?? null,
       billing_rule_snapshot: input.billing_rule_snapshot ?? null,
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: expected { …(20) } to match object { raw_input_tokens: '40', …(7) }
(12 matching properties omitted from actual)

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:224:19
       usage_quality: input.usage_quality,
       billing_rule_id: input.billing_rule_id ?? null,
       rule_version: input.rule_version ?? null,
-      multiplier: input.multiplier ?? null,
+      multiplier: input.multiplier && null,
       billing_rule_snapshot: input.billing_rule_snapshot ?? null,
       created_at: usage.created_at,
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] LogicalOperator
src/repositories/gateway-ledger-guarded-writes.ts:225:30
       billing_rule_id: input.billing_rule_id ?? null,
       rule_version: input.rule_version ?? null,
       multiplier: input.multiplier ?? null,
-      billing_rule_snapshot: input.billing_rule_snapshot ?? null,
+      billing_rule_snapshot: input.billing_rule_snapshot && null,
       created_at: usage.created_at,
     }).returningAll().executeTakeFirstOrThrow();
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: expected { …(20) } to match object { raw_input_tokens: '40', …(7) }
(12 matching properties omitted from actual)

[Killed] EqualityOperator
src/repositories/gateway-ledger-guarded-writes.ts:240:9
     const request = await lockRequestForSettlementWrite(
       trx, input.enterprise_id, input.ai_request_id,
     );
-    if (request.principal_id !== input.principal_id) {
+    if (request.principal_id === input.principal_id) {
       throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: promise rejected "Error: settlement_principal_conflict" instead of resolving

[Killed] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:240:9
     const request = await lockRequestForSettlementWrite(
       trx, input.enterprise_id, input.ai_request_id,
     );
-    if (request.principal_id !== input.principal_id) {
+    if (true) {
       throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
     }
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口保留幂等语义，并由原子 finalize 发布 terminal
statusReason: promise rejected "Error: settlement_principal_conflict" instead of resolving

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:241:54
       trx, input.enterprise_id, input.ai_request_id,
     );
     if (request.principal_id !== input.principal_id) {
-      throw new GatewayLedgerSettlementConflictError("settlement_principal_conflict");
+      throw new GatewayLedgerSettlementConflictError("");
     }
     const result = await trx.insertInto("ledger_transaction").values({
killedBy: POOL-043 结账与项目归属并发边界 兼容写入口拒绝缺失 request/attempt、错误主体与任一种既有结算事实
statusReason: expected [Function] to throw error including 'settlement_principal_conflict' but got ''
