[Killed] BlockStatement
src/repositories/gateway-ledger-settlement-assertions.ts:16:97
 export class GatewayLedgerSettlementConflictError extends Error {}
 
 /** @internal 供结算不变量的定向变异测试复用。 */
-export function assertAttemptMatches(attempt: UpstreamAttempt, input: CreateAttemptInput): void {
-  if (attempt.enterprise_id !== input.enterprise_id
-    || attempt.ai_request_id !== input.ai_request_id
-    || attempt.attempt_no !== input.attempt_no
-    || attempt.provider_resource_id !== input.provider_resource_id
-    || attempt.upstream_model !== input.upstream_model) {
-    throw new GatewayLedgerSettlementConflictError("attempt_identity_conflict");
-  }
-}
+export function assertAttemptMatches(attempt: UpstreamAttempt, input: CreateAttemptInput): void {}
 
 /** @internal 供结算不变量的定向变异测试复用。 */
killedBy: POOL-043 结账与项目归属并发边界 attempt 创建拒绝不存在资源、重复启动与重复身份漂移
statusReason: expected [Function] to throw error including 'attempt_identity_conflict' but got 'attempt_already_started'

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement-assertions.ts:17:7
 
 /** @internal 供结算不变量的定向变异测试复用。 */
 export function assertAttemptMatches(attempt: UpstreamAttempt, input: CreateAttemptInput): void {
-  if (attempt.enterprise_id !== input.enterprise_id
-    || attempt.ai_request_id !== input.ai_request_id
+  if (attempt.enterprise_id !== input.enterprise_id && attempt.ai_request_id !== input.ai_request_id
     || attempt.attempt_no !== input.attempt_no
     || attempt.provider_resource_id !== input.provider_resource_id
killedBy: POOL-043 结算事实逐字段不变量 Attempt 的五个身份字段全部参与重复检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:17:7
 
 /** @internal 供结算不变量的定向变异测试复用。 */
 export function assertAttemptMatches(attempt: UpstreamAttempt, input: CreateAttemptInput): void {
-  if (attempt.enterprise_id !== input.enterprise_id
-    || attempt.ai_request_id !== input.ai_request_id
-    || attempt.attempt_no !== input.attempt_no
-    || attempt.provider_resource_id !== input.provider_resource_id
-    || attempt.upstream_model !== input.upstream_model) {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("attempt_identity_conflict");
   }
killedBy: POOL-043 结账与项目归属并发边界 attempt 创建拒绝不存在资源、重复启动与重复身份漂移
statusReason: expected [Function] to throw error including 'attempt_already_started' but got 'attempt_identity_conflict'

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:18:8
 /** @internal 供结算不变量的定向变异测试复用。 */
 export function assertAttemptMatches(attempt: UpstreamAttempt, input: CreateAttemptInput): void {
   if (attempt.enterprise_id !== input.enterprise_id
-    || attempt.ai_request_id !== input.ai_request_id
+    || false
     || attempt.attempt_no !== input.attempt_no
     || attempt.provider_resource_id !== input.provider_resource_id
killedBy: POOL-043 结算事实逐字段不变量 Attempt 的五个身份字段全部参与重复检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:18:8
 /** @internal 供结算不变量的定向变异测试复用。 */
 export function assertAttemptMatches(attempt: UpstreamAttempt, input: CreateAttemptInput): void {
   if (attempt.enterprise_id !== input.enterprise_id
-    || attempt.ai_request_id !== input.ai_request_id
+    || attempt.ai_request_id === input.ai_request_id
     || attempt.attempt_no !== input.attempt_no
     || attempt.provider_resource_id !== input.provider_resource_id
killedBy: POOL-043 结算事实逐字段不变量 Attempt 的五个身份字段全部参与重复检测
statusReason: expected [Function] to not throw an error but 'Error: attempt_identity_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:19:8
 export function assertAttemptMatches(attempt: UpstreamAttempt, input: CreateAttemptInput): void {
   if (attempt.enterprise_id !== input.enterprise_id
     || attempt.ai_request_id !== input.ai_request_id
-    || attempt.attempt_no !== input.attempt_no
+    || false
     || attempt.provider_resource_id !== input.provider_resource_id
     || attempt.upstream_model !== input.upstream_model) {
killedBy: POOL-043 结算事实逐字段不变量 Attempt 的五个身份字段全部参与重复检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:19:8
 export function assertAttemptMatches(attempt: UpstreamAttempt, input: CreateAttemptInput): void {
   if (attempt.enterprise_id !== input.enterprise_id
     || attempt.ai_request_id !== input.ai_request_id
-    || attempt.attempt_no !== input.attempt_no
+    || attempt.attempt_no === input.attempt_no
     || attempt.provider_resource_id !== input.provider_resource_id
     || attempt.upstream_model !== input.upstream_model) {
killedBy: POOL-043 结算事实逐字段不变量 Attempt 的五个身份字段全部参与重复检测
statusReason: expected [Function] to not throw an error but 'Error: attempt_identity_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:20:8
   if (attempt.enterprise_id !== input.enterprise_id
     || attempt.ai_request_id !== input.ai_request_id
     || attempt.attempt_no !== input.attempt_no
-    || attempt.provider_resource_id !== input.provider_resource_id
+    || attempt.provider_resource_id === input.provider_resource_id
     || attempt.upstream_model !== input.upstream_model) {
     throw new GatewayLedgerSettlementConflictError("attempt_identity_conflict");
killedBy: POOL-043 结算事实逐字段不变量 Attempt 的五个身份字段全部参与重复检测
statusReason: expected [Function] to not throw an error but 'Error: attempt_identity_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:20:8
   if (attempt.enterprise_id !== input.enterprise_id
     || attempt.ai_request_id !== input.ai_request_id
     || attempt.attempt_no !== input.attempt_no
-    || attempt.provider_resource_id !== input.provider_resource_id
+    || false
     || attempt.upstream_model !== input.upstream_model) {
     throw new GatewayLedgerSettlementConflictError("attempt_identity_conflict");
killedBy: POOL-043 结算事实逐字段不变量 Attempt 的五个身份字段全部参与重复检测
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement-assertions.ts:21:57
     || attempt.ai_request_id !== input.ai_request_id
     || attempt.attempt_no !== input.attempt_no
     || attempt.provider_resource_id !== input.provider_resource_id
-    || attempt.upstream_model !== input.upstream_model) {
-    throw new GatewayLedgerSettlementConflictError("attempt_identity_conflict");
-  }
+    || attempt.upstream_model !== input.upstream_model) {}
 }
 
killedBy: POOL-043 结算事实逐字段不变量 Attempt 的五个身份字段全部参与重复检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:21:8
     || attempt.ai_request_id !== input.ai_request_id
     || attempt.attempt_no !== input.attempt_no
     || attempt.provider_resource_id !== input.provider_resource_id
-    || attempt.upstream_model !== input.upstream_model) {
+    || attempt.upstream_model === input.upstream_model) {
     throw new GatewayLedgerSettlementConflictError("attempt_identity_conflict");
   }
killedBy: POOL-043 结算事实逐字段不变量 Attempt 的五个身份字段全部参与重复检测
statusReason: expected [Function] to not throw an error but 'Error: attempt_identity_conflict' was thrown

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement-assertions.ts:27:96
 }
 
 /** @internal 供结算不变量的定向变异测试复用。 */
-export function assertUsageMatches(usage: UsageEvent, input: CreateUsageLedgerLineInput): void {
-  const expected = input.usage;
-  if (usage.ai_request_id !== expected.ai_request_id
-    || usage.enterprise_id !== expected.enterprise_id
-    || usage.upstream_attempt_id !== expected.upstream_attempt_id
-    || usage.provider_resource_id !== expected.provider_resource_id
-    || BigInt(usage.input_tokens) !== expected.input_tokens
-    || BigInt(usage.output_tokens) !== expected.output_tokens
-    || BigInt(usage.cache_tokens) !== expected.cache_tokens
-    || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
-    || usage.usage_quality !== expected.usage_quality
-    || usage.upstream_usage_id !== (expected.upstream_usage_id ?? null)) {
-    throw new GatewayLedgerSettlementConflictError("usage_dedup_conflict");
-  }
-}
+export function assertUsageMatches(usage: UsageEvent, input: CreateUsageLedgerLineInput): void {}
 
 /** @internal 供结算不变量的定向变异测试复用。 */
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:29:7
 /** @internal 供结算不变量的定向变异测试复用。 */
 export function assertUsageMatches(usage: UsageEvent, input: CreateUsageLedgerLineInput): void {
   const expected = input.usage;
-  if (usage.ai_request_id !== expected.ai_request_id
-    || usage.enterprise_id !== expected.enterprise_id
-    || usage.upstream_attempt_id !== expected.upstream_attempt_id
-    || usage.provider_resource_id !== expected.provider_resource_id
-    || BigInt(usage.input_tokens) !== expected.input_tokens
-    || BigInt(usage.output_tokens) !== expected.output_tokens
-    || BigInt(usage.cache_tokens) !== expected.cache_tokens
-    || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
-    || usage.usage_quality !== expected.usage_quality
-    || usage.upstream_usage_id !== (expected.upstream_usage_id ?? null)) {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("usage_dedup_conflict");
   }
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement-assertions.ts:29:7
 /** @internal 供结算不变量的定向变异测试复用。 */
 export function assertUsageMatches(usage: UsageEvent, input: CreateUsageLedgerLineInput): void {
   const expected = input.usage;
-  if (usage.ai_request_id !== expected.ai_request_id
-    || usage.enterprise_id !== expected.enterprise_id
-    || usage.upstream_attempt_id !== expected.upstream_attempt_id
+  if ((usage.ai_request_id !== expected.ai_request_id || usage.enterprise_id !== expected.enterprise_id) && usage.upstream_attempt_id !== expected.upstream_attempt_id
     || usage.provider_resource_id !== expected.provider_resource_id
     || BigInt(usage.input_tokens) !== expected.input_tokens
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:30:8
 export function assertUsageMatches(usage: UsageEvent, input: CreateUsageLedgerLineInput): void {
   const expected = input.usage;
   if (usage.ai_request_id !== expected.ai_request_id
-    || usage.enterprise_id !== expected.enterprise_id
+    || false
     || usage.upstream_attempt_id !== expected.upstream_attempt_id
     || usage.provider_resource_id !== expected.provider_resource_id
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:30:8
 export function assertUsageMatches(usage: UsageEvent, input: CreateUsageLedgerLineInput): void {
   const expected = input.usage;
   if (usage.ai_request_id !== expected.ai_request_id
-    || usage.enterprise_id !== expected.enterprise_id
+    || usage.enterprise_id === expected.enterprise_id
     || usage.upstream_attempt_id !== expected.upstream_attempt_id
     || usage.provider_resource_id !== expected.provider_resource_id
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:31:8
   const expected = input.usage;
   if (usage.ai_request_id !== expected.ai_request_id
     || usage.enterprise_id !== expected.enterprise_id
-    || usage.upstream_attempt_id !== expected.upstream_attempt_id
+    || false
     || usage.provider_resource_id !== expected.provider_resource_id
     || BigInt(usage.input_tokens) !== expected.input_tokens
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:31:8
   const expected = input.usage;
   if (usage.ai_request_id !== expected.ai_request_id
     || usage.enterprise_id !== expected.enterprise_id
-    || usage.upstream_attempt_id !== expected.upstream_attempt_id
+    || usage.upstream_attempt_id === expected.upstream_attempt_id
     || usage.provider_resource_id !== expected.provider_resource_id
     || BigInt(usage.input_tokens) !== expected.input_tokens
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:32:8
   if (usage.ai_request_id !== expected.ai_request_id
     || usage.enterprise_id !== expected.enterprise_id
     || usage.upstream_attempt_id !== expected.upstream_attempt_id
-    || usage.provider_resource_id !== expected.provider_resource_id
+    || usage.provider_resource_id === expected.provider_resource_id
     || BigInt(usage.input_tokens) !== expected.input_tokens
     || BigInt(usage.output_tokens) !== expected.output_tokens
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:32:8
   if (usage.ai_request_id !== expected.ai_request_id
     || usage.enterprise_id !== expected.enterprise_id
     || usage.upstream_attempt_id !== expected.upstream_attempt_id
-    || usage.provider_resource_id !== expected.provider_resource_id
+    || false
     || BigInt(usage.input_tokens) !== expected.input_tokens
     || BigInt(usage.output_tokens) !== expected.output_tokens
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:33:8
     || usage.enterprise_id !== expected.enterprise_id
     || usage.upstream_attempt_id !== expected.upstream_attempt_id
     || usage.provider_resource_id !== expected.provider_resource_id
-    || BigInt(usage.input_tokens) !== expected.input_tokens
+    || false
     || BigInt(usage.output_tokens) !== expected.output_tokens
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:33:8
     || usage.enterprise_id !== expected.enterprise_id
     || usage.upstream_attempt_id !== expected.upstream_attempt_id
     || usage.provider_resource_id !== expected.provider_resource_id
-    || BigInt(usage.input_tokens) !== expected.input_tokens
+    || BigInt(usage.input_tokens) === expected.input_tokens
     || BigInt(usage.output_tokens) !== expected.output_tokens
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:34:8
     || usage.upstream_attempt_id !== expected.upstream_attempt_id
     || usage.provider_resource_id !== expected.provider_resource_id
     || BigInt(usage.input_tokens) !== expected.input_tokens
-    || BigInt(usage.output_tokens) !== expected.output_tokens
+    || false
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
     || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:34:8
     || usage.upstream_attempt_id !== expected.upstream_attempt_id
     || usage.provider_resource_id !== expected.provider_resource_id
     || BigInt(usage.input_tokens) !== expected.input_tokens
-    || BigInt(usage.output_tokens) !== expected.output_tokens
+    || BigInt(usage.output_tokens) === expected.output_tokens
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
     || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:35:8
     || usage.provider_resource_id !== expected.provider_resource_id
     || BigInt(usage.input_tokens) !== expected.input_tokens
     || BigInt(usage.output_tokens) !== expected.output_tokens
-    || BigInt(usage.cache_tokens) !== expected.cache_tokens
+    || BigInt(usage.cache_tokens) === expected.cache_tokens
     || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
     || usage.usage_quality !== expected.usage_quality
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:35:8
     || usage.provider_resource_id !== expected.provider_resource_id
     || BigInt(usage.input_tokens) !== expected.input_tokens
     || BigInt(usage.output_tokens) !== expected.output_tokens
-    || BigInt(usage.cache_tokens) !== expected.cache_tokens
+    || false
     || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
     || usage.usage_quality !== expected.usage_quality
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:36:8
     || BigInt(usage.input_tokens) !== expected.input_tokens
     || BigInt(usage.output_tokens) !== expected.output_tokens
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
-    || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
+    || false
     || usage.usage_quality !== expected.usage_quality
     || usage.upstream_usage_id !== (expected.upstream_usage_id ?? null)) {
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:36:8
     || BigInt(usage.input_tokens) !== expected.input_tokens
     || BigInt(usage.output_tokens) !== expected.output_tokens
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
-    || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
+    || BigInt(usage.reasoning_tokens) === (expected.reasoning_tokens ?? 0n)
     || usage.usage_quality !== expected.usage_quality
     || usage.upstream_usage_id !== (expected.upstream_usage_id ?? null)) {
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:37:8
     || BigInt(usage.output_tokens) !== expected.output_tokens
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
     || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
-    || usage.usage_quality !== expected.usage_quality
+    || usage.usage_quality === expected.usage_quality
     || usage.upstream_usage_id !== (expected.upstream_usage_id ?? null)) {
     throw new GatewayLedgerSettlementConflictError("usage_dedup_conflict");
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:37:8
     || BigInt(usage.output_tokens) !== expected.output_tokens
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
     || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
-    || usage.usage_quality !== expected.usage_quality
+    || false
     || usage.upstream_usage_id !== (expected.upstream_usage_id ?? null)) {
     throw new GatewayLedgerSettlementConflictError("usage_dedup_conflict");
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:38:8
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
     || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
     || usage.usage_quality !== expected.usage_quality
-    || usage.upstream_usage_id !== (expected.upstream_usage_id ?? null)) {
+    || false) {
     throw new GatewayLedgerSettlementConflictError("usage_dedup_conflict");
   }
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:38:8
     || BigInt(usage.cache_tokens) !== expected.cache_tokens
     || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
     || usage.usage_quality !== expected.usage_quality
-    || usage.upstream_usage_id !== (expected.upstream_usage_id ?? null)) {
+    || usage.upstream_usage_id === (expected.upstream_usage_id ?? null)) {
     throw new GatewayLedgerSettlementConflictError("usage_dedup_conflict");
   }
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: usage_dedup_conflict' was thrown

[Killed] StringLiteral
src/repositories/gateway-ledger-settlement-assertions.ts:39:52
     || BigInt(usage.reasoning_tokens) !== (expected.reasoning_tokens ?? 0n)
     || usage.usage_quality !== expected.usage_quality
     || usage.upstream_usage_id !== (expected.upstream_usage_id ?? null)) {
-    throw new GatewayLedgerSettlementConflictError("usage_dedup_conflict");
+    throw new GatewayLedgerSettlementConflictError("");
   }
 }
killedBy: POOL-043 结算事实逐字段不变量 Usage 的身份、Token、质量与上游 ID 全部参与去重检测
statusReason: expected [Function] to throw error including 'usage_dedup_conflict' but got ''

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement-assertions.ts:44:94
 }
 
 /** @internal 供结算不变量的定向变异测试复用。 */
-export function assertLineMatches(line: LedgerLine, input: CreateUsageLedgerLineInput): void {
-  const expected = input.ledger_line;
-  if (line.ai_request_id !== expected.ai_request_id
-    || line.enterprise_id !== expected.enterprise_id
-    || line.upstream_attempt_id !== expected.upstream_attempt_id
-    || line.provider_resource_id !== expected.provider_resource_id
-    || line.principal_id !== expected.principal_id
-    || line.resource_mode !== expected.resource_mode
-    || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
-    || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
-    || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
-    || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
-    || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
-    || !optionalDecimalEquals(line.api_cost, expected.api_cost)
-    || line.usage_quality !== expected.usage_quality
-    || line.billing_rule_id !== (expected.billing_rule_id ?? null)
-    || line.rule_version !== (expected.rule_version ?? null)
-    || !optionalDecimalEquals(line.multiplier, expected.multiplier)
-    || stableJson(line.billing_rule_snapshot) !== stableJson(expected.billing_rule_snapshot ?? null)) {
-    throw new GatewayLedgerSettlementConflictError("ledger_line_conflict");
-  }
-}
+export function assertLineMatches(line: LedgerLine, input: CreateUsageLedgerLineInput): void {}
 
 /** @internal 供结算不变量的定向变异测试复用。 */
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:46:7
 /** @internal 供结算不变量的定向变异测试复用。 */
 export function assertLineMatches(line: LedgerLine, input: CreateUsageLedgerLineInput): void {
   const expected = input.ledger_line;
-  if (line.ai_request_id !== expected.ai_request_id
-    || line.enterprise_id !== expected.enterprise_id
-    || line.upstream_attempt_id !== expected.upstream_attempt_id
-    || line.provider_resource_id !== expected.provider_resource_id
-    || line.principal_id !== expected.principal_id
-    || line.resource_mode !== expected.resource_mode
-    || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
-    || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
-    || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
-    || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
-    || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
-    || !optionalDecimalEquals(line.api_cost, expected.api_cost)
-    || line.usage_quality !== expected.usage_quality
-    || line.billing_rule_id !== (expected.billing_rule_id ?? null)
-    || line.rule_version !== (expected.rule_version ?? null)
-    || !optionalDecimalEquals(line.multiplier, expected.multiplier)
-    || stableJson(line.billing_rule_snapshot) !== stableJson(expected.billing_rule_snapshot ?? null)) {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("ledger_line_conflict");
   }
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement-assertions.ts:46:7
 /** @internal 供结算不变量的定向变异测试复用。 */
 export function assertLineMatches(line: LedgerLine, input: CreateUsageLedgerLineInput): void {
   const expected = input.ledger_line;
-  if (line.ai_request_id !== expected.ai_request_id
-    || line.enterprise_id !== expected.enterprise_id
+  if (line.ai_request_id !== expected.ai_request_id && line.enterprise_id !== expected.enterprise_id
     || line.upstream_attempt_id !== expected.upstream_attempt_id
     || line.provider_resource_id !== expected.provider_resource_id
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:47:8
 export function assertLineMatches(line: LedgerLine, input: CreateUsageLedgerLineInput): void {
   const expected = input.ledger_line;
   if (line.ai_request_id !== expected.ai_request_id
-    || line.enterprise_id !== expected.enterprise_id
+    || line.enterprise_id === expected.enterprise_id
     || line.upstream_attempt_id !== expected.upstream_attempt_id
     || line.provider_resource_id !== expected.provider_resource_id
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:47:8
 export function assertLineMatches(line: LedgerLine, input: CreateUsageLedgerLineInput): void {
   const expected = input.ledger_line;
   if (line.ai_request_id !== expected.ai_request_id
-    || line.enterprise_id !== expected.enterprise_id
+    || false
     || line.upstream_attempt_id !== expected.upstream_attempt_id
     || line.provider_resource_id !== expected.provider_resource_id
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:48:8
   const expected = input.ledger_line;
   if (line.ai_request_id !== expected.ai_request_id
     || line.enterprise_id !== expected.enterprise_id
-    || line.upstream_attempt_id !== expected.upstream_attempt_id
+    || false
     || line.provider_resource_id !== expected.provider_resource_id
     || line.principal_id !== expected.principal_id
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:48:8
   const expected = input.ledger_line;
   if (line.ai_request_id !== expected.ai_request_id
     || line.enterprise_id !== expected.enterprise_id
-    || line.upstream_attempt_id !== expected.upstream_attempt_id
+    || line.upstream_attempt_id === expected.upstream_attempt_id
     || line.provider_resource_id !== expected.provider_resource_id
     || line.principal_id !== expected.principal_id
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown
