[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:49:8
   if (line.ai_request_id !== expected.ai_request_id
     || line.enterprise_id !== expected.enterprise_id
     || line.upstream_attempt_id !== expected.upstream_attempt_id
-    || line.provider_resource_id !== expected.provider_resource_id
+    || false
     || line.principal_id !== expected.principal_id
     || line.resource_mode !== expected.resource_mode
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:49:8
   if (line.ai_request_id !== expected.ai_request_id
     || line.enterprise_id !== expected.enterprise_id
     || line.upstream_attempt_id !== expected.upstream_attempt_id
-    || line.provider_resource_id !== expected.provider_resource_id
+    || line.provider_resource_id === expected.provider_resource_id
     || line.principal_id !== expected.principal_id
     || line.resource_mode !== expected.resource_mode
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:50:8
     || line.enterprise_id !== expected.enterprise_id
     || line.upstream_attempt_id !== expected.upstream_attempt_id
     || line.provider_resource_id !== expected.provider_resource_id
-    || line.principal_id !== expected.principal_id
+    || line.principal_id === expected.principal_id
     || line.resource_mode !== expected.resource_mode
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:50:8
     || line.enterprise_id !== expected.enterprise_id
     || line.upstream_attempt_id !== expected.upstream_attempt_id
     || line.provider_resource_id !== expected.provider_resource_id
-    || line.principal_id !== expected.principal_id
+    || false
     || line.resource_mode !== expected.resource_mode
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:51:8
     || line.upstream_attempt_id !== expected.upstream_attempt_id
     || line.provider_resource_id !== expected.provider_resource_id
     || line.principal_id !== expected.principal_id
-    || line.resource_mode !== expected.resource_mode
+    || false
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
     || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:51:8
     || line.upstream_attempt_id !== expected.upstream_attempt_id
     || line.provider_resource_id !== expected.provider_resource_id
     || line.principal_id !== expected.principal_id
-    || line.resource_mode !== expected.resource_mode
+    || line.resource_mode === expected.resource_mode
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
     || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:52:8
     || line.provider_resource_id !== expected.provider_resource_id
     || line.principal_id !== expected.principal_id
     || line.resource_mode !== expected.resource_mode
-    || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
+    || BigInt(line.raw_input_tokens) === expected.raw_input_tokens
     || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
     || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:52:8
     || line.provider_resource_id !== expected.provider_resource_id
     || line.principal_id !== expected.principal_id
     || line.resource_mode !== expected.resource_mode
-    || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
+    || false
     || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
     || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:53:8
     || line.principal_id !== expected.principal_id
     || line.resource_mode !== expected.resource_mode
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
-    || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
+    || false
     || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
     || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:53:8
     || line.principal_id !== expected.principal_id
     || line.resource_mode !== expected.resource_mode
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
-    || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
+    || BigInt(line.raw_output_tokens) === expected.raw_output_tokens
     || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
     || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:54:8
     || line.resource_mode !== expected.resource_mode
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
     || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
-    || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
+    || false
     || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
     || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:54:8
     || line.resource_mode !== expected.resource_mode
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
     || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
-    || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
+    || BigInt(line.raw_cache_tokens) === expected.raw_cache_tokens
     || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
     || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:55:8
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
     || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
     || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
-    || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
+    || BigInt(line.raw_reasoning_tokens) === (expected.raw_reasoning_tokens ?? 0n)
     || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
     || !optionalDecimalEquals(line.api_cost, expected.api_cost)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement-assertions.ts:55:47
     || BigInt(line.raw_input_tokens) !== expected.raw_input_tokens
     || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
     || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
-    || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
+    || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens && 0n)
     || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
     || !optionalDecimalEquals(line.api_cost, expected.api_cost)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] BooleanLiteral
src/repositories/gateway-ledger-settlement-assertions.ts:56:8
     || BigInt(line.raw_output_tokens) !== expected.raw_output_tokens
     || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
     || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
-    || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
+    || optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
     || !optionalDecimalEquals(line.api_cost, expected.api_cost)
     || line.usage_quality !== expected.usage_quality
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] BooleanLiteral
src/repositories/gateway-ledger-settlement-assertions.ts:57:8
     || BigInt(line.raw_cache_tokens) !== expected.raw_cache_tokens
     || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
     || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
-    || !optionalDecimalEquals(line.api_cost, expected.api_cost)
+    || optionalDecimalEquals(line.api_cost, expected.api_cost)
     || line.usage_quality !== expected.usage_quality
     || line.billing_rule_id !== (expected.billing_rule_id ?? null)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:58:8
     || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
     || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
     || !optionalDecimalEquals(line.api_cost, expected.api_cost)
-    || line.usage_quality !== expected.usage_quality
+    || line.usage_quality === expected.usage_quality
     || line.billing_rule_id !== (expected.billing_rule_id ?? null)
     || line.rule_version !== (expected.rule_version ?? null)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:58:8
     || BigInt(line.raw_reasoning_tokens) !== (expected.raw_reasoning_tokens ?? 0n)
     || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
     || !optionalDecimalEquals(line.api_cost, expected.api_cost)
-    || line.usage_quality !== expected.usage_quality
+    || false
     || line.billing_rule_id !== (expected.billing_rule_id ?? null)
     || line.rule_version !== (expected.rule_version ?? null)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement-assertions.ts:59:34
     || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
     || !optionalDecimalEquals(line.api_cost, expected.api_cost)
     || line.usage_quality !== expected.usage_quality
-    || line.billing_rule_id !== (expected.billing_rule_id ?? null)
+    || line.billing_rule_id !== (expected.billing_rule_id && null)
     || line.rule_version !== (expected.rule_version ?? null)
     || !optionalDecimalEquals(line.multiplier, expected.multiplier)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:59:8
     || !optionalBigintEquals(line.deducted_quota, expected.deducted_quota)
     || !optionalDecimalEquals(line.api_cost, expected.api_cost)
     || line.usage_quality !== expected.usage_quality
-    || line.billing_rule_id !== (expected.billing_rule_id ?? null)
+    || false
     || line.rule_version !== (expected.rule_version ?? null)
     || !optionalDecimalEquals(line.multiplier, expected.multiplier)
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:60:8
     || !optionalDecimalEquals(line.api_cost, expected.api_cost)
     || line.usage_quality !== expected.usage_quality
     || line.billing_rule_id !== (expected.billing_rule_id ?? null)
-    || line.rule_version !== (expected.rule_version ?? null)
+    || line.rule_version === (expected.rule_version ?? null)
     || !optionalDecimalEquals(line.multiplier, expected.multiplier)
     || stableJson(line.billing_rule_snapshot) !== stableJson(expected.billing_rule_snapshot ?? null)) {
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:60:8
     || !optionalDecimalEquals(line.api_cost, expected.api_cost)
     || line.usage_quality !== expected.usage_quality
     || line.billing_rule_id !== (expected.billing_rule_id ?? null)
-    || line.rule_version !== (expected.rule_version ?? null)
+    || false
     || !optionalDecimalEquals(line.multiplier, expected.multiplier)
     || stableJson(line.billing_rule_snapshot) !== stableJson(expected.billing_rule_snapshot ?? null)) {
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/repositories/gateway-ledger-settlement-assertions.ts:61:8
     || line.usage_quality !== expected.usage_quality
     || line.billing_rule_id !== (expected.billing_rule_id ?? null)
     || line.rule_version !== (expected.rule_version ?? null)
-    || !optionalDecimalEquals(line.multiplier, expected.multiplier)
+    || optionalDecimalEquals(line.multiplier, expected.multiplier)
     || stableJson(line.billing_rule_snapshot) !== stableJson(expected.billing_rule_snapshot ?? null)) {
     throw new GatewayLedgerSettlementConflictError("ledger_line_conflict");
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_line_conflict' was thrown

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement-assertions.ts:62:103
     || line.billing_rule_id !== (expected.billing_rule_id ?? null)
     || line.rule_version !== (expected.rule_version ?? null)
     || !optionalDecimalEquals(line.multiplier, expected.multiplier)
-    || stableJson(line.billing_rule_snapshot) !== stableJson(expected.billing_rule_snapshot ?? null)) {
-    throw new GatewayLedgerSettlementConflictError("ledger_line_conflict");
-  }
+    || stableJson(line.billing_rule_snapshot) !== stableJson(expected.billing_rule_snapshot ?? null)) {}
 }
 
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:62:8
     || line.billing_rule_id !== (expected.billing_rule_id ?? null)
     || line.rule_version !== (expected.rule_version ?? null)
     || !optionalDecimalEquals(line.multiplier, expected.multiplier)
-    || stableJson(line.billing_rule_snapshot) !== stableJson(expected.billing_rule_snapshot ?? null)) {
+    || false) {
     throw new GatewayLedgerSettlementConflictError("ledger_line_conflict");
   }
killedBy: POOL-043 结算事实逐字段不变量 Ledger Line 的所有冻结事实全部参与去重检测
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/repositories/gateway-ledger-settlement-assertions.ts:71:9
 export function assertTransactionMatches(
   transaction: LedgerTransaction,
   input: CreateLedgerTransactionInput,
-): void {
-  if (transaction.ai_request_id !== input.ai_request_id
-    || transaction.enterprise_id !== input.enterprise_id
-    || transaction.principal_id !== input.principal_id
-    || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
-    || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
-    || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
-    || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
-    || BigInt(transaction.total_deducted_quota) !== input.total_deducted_quota
-    || !new Decimal(transaction.total_api_cost).eq(input.total_api_cost)
-    || transaction.overage !== (input.overage ?? false)
-    || transaction.usage_quality !== input.usage_quality
-    || transaction.attempt_count !== input.attempt_count
-    || transaction.status !== "SETTLED") {
-    throw new GatewayLedgerSettlementConflictError("ledger_transaction_conflict");
-  }
-}
+): void {}
 
 /** @internal 供结算不变量的定向变异测试复用。 */
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:72:7
   transaction: LedgerTransaction,
   input: CreateLedgerTransactionInput,
 ): void {
-  if (transaction.ai_request_id !== input.ai_request_id
-    || transaction.enterprise_id !== input.enterprise_id
-    || transaction.principal_id !== input.principal_id
-    || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
-    || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
-    || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
-    || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
-    || BigInt(transaction.total_deducted_quota) !== input.total_deducted_quota
-    || !new Decimal(transaction.total_api_cost).eq(input.total_api_cost)
-    || transaction.overage !== (input.overage ?? false)
-    || transaction.usage_quality !== input.usage_quality
-    || transaction.attempt_count !== input.attempt_count
-    || transaction.status !== "SETTLED") {
+  if (true) {
     throw new GatewayLedgerSettlementConflictError("ledger_transaction_conflict");
   }
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_transaction_conflict' was thrown

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement-assertions.ts:72:7
   transaction: LedgerTransaction,
   input: CreateLedgerTransactionInput,
 ): void {
-  if (transaction.ai_request_id !== input.ai_request_id
-    || transaction.enterprise_id !== input.enterprise_id
+  if (transaction.ai_request_id !== input.ai_request_id && transaction.enterprise_id !== input.enterprise_id
     || transaction.principal_id !== input.principal_id
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:73:8
   input: CreateLedgerTransactionInput,
 ): void {
   if (transaction.ai_request_id !== input.ai_request_id
-    || transaction.enterprise_id !== input.enterprise_id
+    || false
     || transaction.principal_id !== input.principal_id
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:73:8
   input: CreateLedgerTransactionInput,
 ): void {
   if (transaction.ai_request_id !== input.ai_request_id
-    || transaction.enterprise_id !== input.enterprise_id
+    || transaction.enterprise_id === input.enterprise_id
     || transaction.principal_id !== input.principal_id
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_transaction_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:74:8
 ): void {
   if (transaction.ai_request_id !== input.ai_request_id
     || transaction.enterprise_id !== input.enterprise_id
-    || transaction.principal_id !== input.principal_id
+    || false
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:74:8
 ): void {
   if (transaction.ai_request_id !== input.ai_request_id
     || transaction.enterprise_id !== input.enterprise_id
-    || transaction.principal_id !== input.principal_id
+    || transaction.principal_id === input.principal_id
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_transaction_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:75:8
   if (transaction.ai_request_id !== input.ai_request_id
     || transaction.enterprise_id !== input.enterprise_id
     || transaction.principal_id !== input.principal_id
-    || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
+    || BigInt(transaction.total_input_tokens) === input.total_input_tokens
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
     || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_transaction_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:75:8
   if (transaction.ai_request_id !== input.ai_request_id
     || transaction.enterprise_id !== input.enterprise_id
     || transaction.principal_id !== input.principal_id
-    || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
+    || false
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
     || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:76:8
     || transaction.enterprise_id !== input.enterprise_id
     || transaction.principal_id !== input.principal_id
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
-    || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
+    || false
     || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
     || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:76:8
     || transaction.enterprise_id !== input.enterprise_id
     || transaction.principal_id !== input.principal_id
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
-    || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
+    || BigInt(transaction.total_output_tokens) === input.total_output_tokens
     || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
     || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_transaction_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:77:8
     || transaction.principal_id !== input.principal_id
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
-    || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
+    || false
     || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
     || BigInt(transaction.total_deducted_quota) !== input.total_deducted_quota
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:77:8
     || transaction.principal_id !== input.principal_id
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
-    || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
+    || BigInt(transaction.total_cache_tokens) === input.total_cache_tokens
     || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
     || BigInt(transaction.total_deducted_quota) !== input.total_deducted_quota
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_transaction_conflict' was thrown

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:78:8
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
     || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
-    || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
+    || BigInt(transaction.total_reasoning_tokens) === (input.total_reasoning_tokens ?? 0n)
     || BigInt(transaction.total_deducted_quota) !== input.total_deducted_quota
     || !new Decimal(transaction.total_api_cost).eq(input.total_api_cost)
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_transaction_conflict' was thrown

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:78:8
     || BigInt(transaction.total_input_tokens) !== input.total_input_tokens
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
     || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
-    || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
+    || false
     || BigInt(transaction.total_deducted_quota) !== input.total_deducted_quota
     || !new Decimal(transaction.total_api_cost).eq(input.total_api_cost)
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/repositories/gateway-ledger-settlement-assertions.ts:79:8
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
     || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
     || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
-    || BigInt(transaction.total_deducted_quota) !== input.total_deducted_quota
+    || false
     || !new Decimal(transaction.total_api_cost).eq(input.total_api_cost)
     || transaction.overage !== (input.overage ?? false)
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/repositories/gateway-ledger-settlement-assertions.ts:79:8
     || BigInt(transaction.total_output_tokens) !== input.total_output_tokens
     || BigInt(transaction.total_cache_tokens) !== input.total_cache_tokens
     || BigInt(transaction.total_reasoning_tokens) !== (input.total_reasoning_tokens ?? 0n)
-    || BigInt(transaction.total_deducted_quota) !== input.total_deducted_quota
+    || BigInt(transaction.total_deducted_quota) === input.total_deducted_quota
     || !new Decimal(transaction.total_api_cost).eq(input.total_api_cost)
     || transaction.overage !== (input.overage ?? false)
killedBy: POOL-043 结算事实逐字段不变量 Transaction 的汇总、超额、质量、次数与状态全部参与幂等检测
statusReason: expected [Function] to not throw an error but 'Error: ledger_transaction_conflict' was thrown
