[Killed] StringLiteral
src/repositories/gateway-ledger-settlement-assertions.ts:132:86
   if (value && typeof value === "object") {
     const record = value as Record<string, unknown>;
     return "{" + Object.keys(record).sort()
-      .map((key) => JSON.stringify(key) + ":" + stableJson(record[key])).join(",") + "}";
+      .map((key) => JSON.stringify(key) + ":" + stableJson(record[key])).join(",") + "";
   }
   return JSON.stringify(value) ?? "undefined";
killedBy: POOL-043 结算事实逐字段不变量 JSON 快照按键稳定、数组保序，并区分 primitive 与 undefined
statusReason: expected '{"a":{"c":3,"d":4,"b":2' to be '{"a":{"c":3,"d":4},"b":2}' // Object.is equality

[Killed] LogicalOperator
src/repositories/gateway-ledger-settlement-assertions.ts:134:10
     return "{" + Object.keys(record).sort()
       .map((key) => JSON.stringify(key) + ":" + stableJson(record[key])).join(",") + "}";
   }
-  return JSON.stringify(value) ?? "undefined";
+  return JSON.stringify(value) && "undefined";
 }
 
killedBy: POOL-043 结算事实逐字段不变量 JSON 快照按键稳定、数组保序，并区分 primitive 与 undefined
statusReason: expected '{"a":{"c":undefined,"d":undefined},"b…' to be '{"a":{"c":3,"d":4},"b":2}' // Object.is equality
