[Killed] EqualityOperator
src/repositories/operating-bill-account-aggregate.ts:127:23
     };
   }
   const usageQuality = summarizeUsageQuality(target.qualities);
-  const tokensKnown = usageQuality !== "UNKNOWN";
+  const tokensKnown = usageQuality === "UNKNOWN";
   const apiCost = target.apiCostKnown ? money(target.apiCost) : null;
   const packageCost = target.packageCostKnown ? money(target.packageCost) : null;
killedBy: POOL-043 账户聚合纯函数 汇总大整数、金额、北京时间活跃日、去重请求与最近使用
statusReason: expected { inputTokens: null, …(12) } to deeply equal { …(13) }

[Killed] ConditionalExpression
src/repositories/operating-bill-account-aggregate.ts:139:45
     deductedQuota: target.deductedKnown ? integer(target.deducted) : null,
     apiCost,
     packageAllocatedCost: packageCost,
-    totalAllocatedCost: apiCost !== null && packageCost !== null
+    totalAllocatedCost: apiCost !== null && true
       ? money(target.apiCost.plus(target.packageCost)) : null,
     activeDays: target.activeDates.size,
killedBy: POOL-043 账户聚合纯函数 API 成本或套餐分摊任一未知时，归集成本不得用已知一侧冒充
statusReason: expected '1.25000000' to be null

[Killed] ConditionalExpression
src/repositories/operating-bill-account-aggregate.ts:139:25
     deductedQuota: target.deductedKnown ? integer(target.deducted) : null,
     apiCost,
     packageAllocatedCost: packageCost,
-    totalAllocatedCost: apiCost !== null && packageCost !== null
+    totalAllocatedCost: false
       ? money(target.apiCost.plus(target.packageCost)) : null,
     activeDays: target.activeDates.size,
killedBy: POOL-043 账户聚合纯函数 汇总大整数、金额、北京时间活跃日、去重请求与最近使用
statusReason: expected { …(13) } to deeply equal { …(13) }

[Killed] LogicalOperator
src/repositories/operating-bill-account-aggregate.ts:143:17
       ? money(target.apiCost.plus(target.packageCost)) : null,
     activeDays: target.activeDates.size,
     requestCount: target.requestIds.size,
-    lastUsedAt: target.lastUsedAt?.toISOString() ?? null,
+    lastUsedAt: target.lastUsedAt?.toISOString() && null,
     usageQuality,
   };
killedBy: POOL-043 账户聚合纯函数 汇总大整数、金额、北京时间活跃日、去重请求与最近使用
statusReason: expected { …(13) } to deeply equal { …(13) }

[Survived] OptionalChaining
src/repositories/operating-bill-account-aggregate.ts:143:17
       ? money(target.apiCost.plus(target.packageCost)) : null,
     activeDays: target.activeDates.size,
     requestCount: target.requestIds.size,
-    lastUsedAt: target.lastUsedAt?.toISOString() ?? null,
+    lastUsedAt: target.lastUsedAt.toISOString() ?? null,
     usageQuality,
   };

[Killed] BlockStatement
src/repositories/operating-bill-account-aggregate.ts:149:107
 }
 
 /** 将 PostgreSQL 已聚合行标准化为账户口径，避免总览为了复用 Node 聚合而拉取整月明细。 */
-export function finishAccountSummary(input: OperatingBillAccountSummaryInput): OperatingBillAccountTotals {
-  if (input.requestCount === 0) return finishAccountTotals(newAccountAccumulator());
-  const usageQuality = summarizeUsageQuality(input.qualities);
-  const tokensKnown = usageQuality !== "UNKNOWN";
-  const inputTokens = decimal(input.inputTokens);
-  const outputTokens = decimal(input.outputTokens);
-  const apiCost = input.apiCost === null ? null : money(decimal(input.apiCost));
-  const packageCost = input.packageAllocatedCost === null ? null : money(decimal(input.packageAllocatedCost));
-  return {
-    inputTokens: tokensKnown ? integer(inputTokens) : null,
-    outputTokens: tokensKnown ? integer(outputTokens) : null,
-    cacheTokens: tokensKnown ? integer(decimal(input.cacheTokens)) : null,
-    reasoningTokens: tokensKnown ? integer(decimal(input.reasoningTokens)) : null,
-    totalTokens: tokensKnown ? integer(inputTokens.plus(outputTokens)) : null,
-    deductedQuota: input.deductedQuota === null ? null : integer(decimal(input.deductedQuota)),
-    apiCost,
-    packageAllocatedCost: packageCost,
-    totalAllocatedCost: apiCost !== null && packageCost !== null
-      ? money(decimal(apiCost).plus(packageCost)) : null,
-    activeDays: input.activeDays,
-    requestCount: input.requestCount,
-    lastUsedAt: input.lastUsedAt?.toISOString() ?? null,
-    usageQuality,
-  };
-}
+export function finishAccountSummary(input: OperatingBillAccountSummaryInput): OperatingBillAccountTotals {}
 
 export function usageShare(part: OperatingBillAccountTotals, whole: OperatingBillAccountTotals): string | null {
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected undefined to deeply equal { …(13) }

[Killed] ConditionalExpression
src/repositories/operating-bill-account-aggregate.ts:150:7
 
 /** 将 PostgreSQL 已聚合行标准化为账户口径，避免总览为了复用 Node 聚合而拉取整月明细。 */
 export function finishAccountSummary(input: OperatingBillAccountSummaryInput): OperatingBillAccountTotals {
-  if (input.requestCount === 0) return finishAccountTotals(newAccountAccumulator());
+  if (true) return finishAccountTotals(newAccountAccumulator());
   const usageQuality = summarizeUsageQuality(input.qualities);
   const tokensKnown = usageQuality !== "UNKNOWN";
killedBy: POOL-043 结账与项目归属并发边界 观察到真实行锁竞争后重试新快照，冻结结果不丢失已提交归属
statusReason: expected { inputTokens: '0', …(12) } to match object { totalTokens: '33', requestCount: 1 }
(11 matching properties omitted from actual)

[Killed] EqualityOperator
src/repositories/operating-bill-account-aggregate.ts:150:7
 
 /** 将 PostgreSQL 已聚合行标准化为账户口径，避免总览为了复用 Node 聚合而拉取整月明细。 */
 export function finishAccountSummary(input: OperatingBillAccountSummaryInput): OperatingBillAccountTotals {
-  if (input.requestCount === 0) return finishAccountTotals(newAccountAccumulator());
+  if (input.requestCount !== 0) return finishAccountTotals(newAccountAccumulator());
   const usageQuality = summarizeUsageQuality(input.qualities);
   const tokensKnown = usageQuality !== "UNKNOWN";
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { inputTokens: '0', …(12) } to deeply equal { …(13) }

[Killed] EqualityOperator
src/repositories/operating-bill-account-aggregate.ts:152:23
 export function finishAccountSummary(input: OperatingBillAccountSummaryInput): OperatingBillAccountTotals {
   if (input.requestCount === 0) return finishAccountTotals(newAccountAccumulator());
   const usageQuality = summarizeUsageQuality(input.qualities);
-  const tokensKnown = usageQuality !== "UNKNOWN";
+  const tokensKnown = usageQuality === "UNKNOWN";
   const inputTokens = decimal(input.inputTokens);
   const outputTokens = decimal(input.outputTokens);
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { inputTokens: null, …(12) } to deeply equal { …(13) }

[Killed] ConditionalExpression
src/repositories/operating-bill-account-aggregate.ts:152:23
 export function finishAccountSummary(input: OperatingBillAccountSummaryInput): OperatingBillAccountTotals {
   if (input.requestCount === 0) return finishAccountTotals(newAccountAccumulator());
   const usageQuality = summarizeUsageQuality(input.qualities);
-  const tokensKnown = usageQuality !== "UNKNOWN";
+  const tokensKnown = false;
   const inputTokens = decimal(input.inputTokens);
   const outputTokens = decimal(input.outputTokens);
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { inputTokens: null, …(12) } to deeply equal { …(13) }

[Killed] ConditionalExpression
src/repositories/operating-bill-account-aggregate.ts:155:19
   const tokensKnown = usageQuality !== "UNKNOWN";
   const inputTokens = decimal(input.inputTokens);
   const outputTokens = decimal(input.outputTokens);
-  const apiCost = input.apiCost === null ? null : money(decimal(input.apiCost));
+  const apiCost = true ? null : money(decimal(input.apiCost));
   const packageCost = input.packageAllocatedCost === null ? null : money(decimal(input.packageAllocatedCost));
   return {
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { …(13) } to deeply equal { …(13) }

[Killed] EqualityOperator
src/repositories/operating-bill-account-aggregate.ts:155:19
   const tokensKnown = usageQuality !== "UNKNOWN";
   const inputTokens = decimal(input.inputTokens);
   const outputTokens = decimal(input.outputTokens);
-  const apiCost = input.apiCost === null ? null : money(decimal(input.apiCost));
+  const apiCost = input.apiCost !== null ? null : money(decimal(input.apiCost));
   const packageCost = input.packageAllocatedCost === null ? null : money(decimal(input.packageAllocatedCost));
   return {
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { …(13) } to deeply equal { …(13) }

[Killed] ConditionalExpression
src/repositories/operating-bill-account-aggregate.ts:156:23
   const inputTokens = decimal(input.inputTokens);
   const outputTokens = decimal(input.outputTokens);
   const apiCost = input.apiCost === null ? null : money(decimal(input.apiCost));
-  const packageCost = input.packageAllocatedCost === null ? null : money(decimal(input.packageAllocatedCost));
+  const packageCost = true ? null : money(decimal(input.packageAllocatedCost));
   return {
     inputTokens: tokensKnown ? integer(inputTokens) : null,
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { …(13) } to deeply equal { …(13) }

[Killed] EqualityOperator
src/repositories/operating-bill-account-aggregate.ts:156:23
   const inputTokens = decimal(input.inputTokens);
   const outputTokens = decimal(input.outputTokens);
   const apiCost = input.apiCost === null ? null : money(decimal(input.apiCost));
-  const packageCost = input.packageAllocatedCost === null ? null : money(decimal(input.packageAllocatedCost));
+  const packageCost = input.packageAllocatedCost !== null ? null : money(decimal(input.packageAllocatedCost));
   return {
     inputTokens: tokensKnown ? integer(inputTokens) : null,
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { …(13) } to deeply equal { …(13) }

[Killed] EqualityOperator
src/repositories/operating-bill-account-aggregate.ts:163:20
     cacheTokens: tokensKnown ? integer(decimal(input.cacheTokens)) : null,
     reasoningTokens: tokensKnown ? integer(decimal(input.reasoningTokens)) : null,
     totalTokens: tokensKnown ? integer(inputTokens.plus(outputTokens)) : null,
-    deductedQuota: input.deductedQuota === null ? null : integer(decimal(input.deductedQuota)),
+    deductedQuota: input.deductedQuota !== null ? null : integer(decimal(input.deductedQuota)),
     apiCost,
     packageAllocatedCost: packageCost,
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { …(13) } to deeply equal { …(13) }

[Killed] ConditionalExpression
src/repositories/operating-bill-account-aggregate.ts:163:20
     cacheTokens: tokensKnown ? integer(decimal(input.cacheTokens)) : null,
     reasoningTokens: tokensKnown ? integer(decimal(input.reasoningTokens)) : null,
     totalTokens: tokensKnown ? integer(inputTokens.plus(outputTokens)) : null,
-    deductedQuota: input.deductedQuota === null ? null : integer(decimal(input.deductedQuota)),
+    deductedQuota: false ? null : integer(decimal(input.deductedQuota)),
     apiCost,
     packageAllocatedCost: packageCost,
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { inputTokens: null, …(12) } to match object { totalTokens: null, …(5) }
(7 matching properties omitted from actual)

[Killed] EqualityOperator
src/repositories/operating-bill-account-aggregate.ts:166:45
     deductedQuota: input.deductedQuota === null ? null : integer(decimal(input.deductedQuota)),
     apiCost,
     packageAllocatedCost: packageCost,
-    totalAllocatedCost: apiCost !== null && packageCost !== null
+    totalAllocatedCost: apiCost !== null && packageCost === null
       ? money(decimal(apiCost).plus(packageCost)) : null,
     activeDays: input.activeDays,
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { …(13) } to deeply equal { …(13) }

[Killed] LogicalOperator
src/repositories/operating-bill-account-aggregate.ts:170:17
       ? money(decimal(apiCost).plus(packageCost)) : null,
     activeDays: input.activeDays,
     requestCount: input.requestCount,
-    lastUsedAt: input.lastUsedAt?.toISOString() ?? null,
+    lastUsedAt: input.lastUsedAt?.toISOString() && null,
     usageQuality,
   };
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: expected { …(13) } to deeply equal { …(13) }

[Killed] OptionalChaining
src/repositories/operating-bill-account-aggregate.ts:170:17
       ? money(decimal(apiCost).plus(packageCost)) : null,
     activeDays: input.activeDays,
     requestCount: input.requestCount,
-    lastUsedAt: input.lastUsedAt?.toISOString() ?? null,
+    lastUsedAt: input.lastUsedAt.toISOString() ?? null,
     usageQuality,
   };
killedBy: POOL-043 账户聚合纯函数 SQL 汇总行复用同一数值精度、未知传播与空账口径
statusReason: Cannot read properties of null (reading 'toISOString')

[Killed] BlockStatement
src/repositories/operating-bill-account-aggregate.ts:175:112
   };
 }
 
-export function usageShare(part: OperatingBillAccountTotals, whole: OperatingBillAccountTotals): string | null {
-  if (part.totalTokens === null || whole.totalTokens === null) return null;
-  const wholeTokens = decimal(whole.totalTokens);
-  if (wholeTokens.isZero() || wholeTokens.isNegative()) return null;
-  return decimal(part.totalTokens).div(wholeTokens).mul(100).toDecimalPlaces(2).toFixed(2);
-}
+export function usageShare(part: OperatingBillAccountTotals, whole: OperatingBillAccountTotals): string | null {}
 
killedBy: POOL-043 账户聚合纯函数 使用占比只在两端 Token 可知且分母大于零时计算
statusReason: expected undefined to be '12.50' // Object.is equality

[Killed] LogicalOperator
src/repositories/operating-bill-account-aggregate.ts:176:7
 }
 
 export function usageShare(part: OperatingBillAccountTotals, whole: OperatingBillAccountTotals): string | null {
-  if (part.totalTokens === null || whole.totalTokens === null) return null;
+  if (part.totalTokens === null && whole.totalTokens === null) return null;
   const wholeTokens = decimal(whole.totalTokens);
   if (wholeTokens.isZero() || wholeTokens.isNegative()) return null;
killedBy: POOL-043 账户聚合纯函数 使用占比只在两端 Token 可知且分母大于零时计算
statusReason: expected '0.00' to be null

[Killed] ConditionalExpression
src/repositories/operating-bill-account-aggregate.ts:176:7
 }
 
 export function usageShare(part: OperatingBillAccountTotals, whole: OperatingBillAccountTotals): string | null {
-  if (part.totalTokens === null || whole.totalTokens === null) return null;
+  if (true) return null;
   const wholeTokens = decimal(whole.totalTokens);
   if (wholeTokens.isZero() || wholeTokens.isNegative()) return null;
killedBy: POOL-043 账户聚合纯函数 使用占比只在两端 Token 可知且分母大于零时计算
statusReason: expected null to be '12.50' // Object.is equality

[Killed] ConditionalExpression
src/repositories/operating-bill-account-aggregate.ts:178:7
 export function usageShare(part: OperatingBillAccountTotals, whole: OperatingBillAccountTotals): string | null {
   if (part.totalTokens === null || whole.totalTokens === null) return null;
   const wholeTokens = decimal(whole.totalTokens);
-  if (wholeTokens.isZero() || wholeTokens.isNegative()) return null;
+  if (true) return null;
   return decimal(part.totalTokens).div(wholeTokens).mul(100).toDecimalPlaces(2).toFixed(2);
 }
killedBy: POOL-043 账户聚合纯函数 使用占比只在两端 Token 可知且分母大于零时计算
statusReason: expected null to be '12.50' // Object.is equality

[Killed] LogicalOperator
src/repositories/operating-bill-account-aggregate.ts:178:7
 export function usageShare(part: OperatingBillAccountTotals, whole: OperatingBillAccountTotals): string | null {
   if (part.totalTokens === null || whole.totalTokens === null) return null;
   const wholeTokens = decimal(whole.totalTokens);
-  if (wholeTokens.isZero() || wholeTokens.isNegative()) return null;
+  if (wholeTokens.isZero() && wholeTokens.isNegative()) return null;
   return decimal(part.totalTokens).div(wholeTokens).mul(100).toDecimalPlaces(2).toFixed(2);
 }
killedBy: POOL-043 账户聚合纯函数 使用占比只在两端 Token 可知且分母大于零时计算
statusReason: expected 'Infinity' to be null
