[Killed] BlockStatement
src/repositories/operating-bill-concurrency.ts:6:15
 /** PostgreSQL REPEATABLE READ 遇到并发账期写入时，最多用新事务重取三次快照。 */
 export async function withOperatingBillSerializationRetry<T>(
   operation: () => Promise<T>,
-): Promise<T> {
-  for (let attempt = 0; attempt < 3; attempt += 1) {
-    try {
-      return await operation();
-    } catch (error) {
-      if (!isSerializationFailure(error)) throw error;
-    }
-  }
-  throw new OperatingBillConcurrentModificationError();
-}
+): Promise<T> {}
 
 function isSerializationFailure(error: unknown): boolean {
killedBy: POOL-043 结账与项目归属并发边界 观察到真实行锁竞争后重试新快照，冻结结果不丢失已提交归属
statusReason: close_month_row_lock_not_observed

[Killed] EqualityOperator
src/repositories/operating-bill-concurrency.ts:7:25
 export async function withOperatingBillSerializationRetry<T>(
   operation: () => Promise<T>,
 ): Promise<T> {
-  for (let attempt = 0; attempt < 3; attempt += 1) {
+  for (let attempt = 0; attempt <= 3; attempt += 1) {
     try {
       return await operation();
killedBy: POOL-043 经营账单序列化冲突重试 三次 40001 后转换为明确的可重试并发错误
statusReason: expected "spy" to be called 3 times, but got 4 times

[Killed] EqualityOperator
src/repositories/operating-bill-concurrency.ts:7:25
 export async function withOperatingBillSerializationRetry<T>(
   operation: () => Promise<T>,
 ): Promise<T> {
-  for (let attempt = 0; attempt < 3; attempt += 1) {
+  for (let attempt = 0; attempt >= 3; attempt += 1) {
     try {
       return await operation();
killedBy: POOL-043 经营账单序列化冲突重试 无冲突时只执行一次并返回结果
statusReason: promise rejected "Error" instead of resolving

[Killed] BlockStatement
src/repositories/operating-bill-concurrency.ts:8:9
   operation: () => Promise<T>,
 ): Promise<T> {
   for (let attempt = 0; attempt < 3; attempt += 1) {
-    try {
-      return await operation();
-    } catch (error) {
+    try {} catch (error) {
       if (!isSerializationFailure(error)) throw error;
     }
killedBy: POOL-043 经营账单序列化冲突重试 无冲突时只执行一次并返回结果
statusReason: promise rejected "Error" instead of resolving

[Killed] BlockStatement
src/repositories/operating-bill-concurrency.ts:10:21
   for (let attempt = 0; attempt < 3; attempt += 1) {
     try {
       return await operation();
-    } catch (error) {
-      if (!isSerializationFailure(error)) throw error;
-    }
+    } catch (error) {}
   }
   throw new OperatingBillConcurrentModificationError();
killedBy: POOL-043 经营账单序列化冲突重试 非序列化错误原样抛出且不重试
statusReason: expected Error to be Error: constraint { code: '23505' } // Object.is equality

[Killed] BooleanLiteral
src/repositories/operating-bill-concurrency.ts:11:11
     try {
       return await operation();
     } catch (error) {
-      if (!isSerializationFailure(error)) throw error;
+      if (isSerializationFailure(error)) throw error;
     }
   }
killedBy: POOL-043 经营账单序列化冲突重试 仅重试 PostgreSQL 40001，并由新事务第三次成功
statusReason: promise rejected "Error: serialize-1 { code: '40001' }" instead of resolving

[Killed] ConditionalExpression
src/repositories/operating-bill-concurrency.ts:11:11
     try {
       return await operation();
     } catch (error) {
-      if (!isSerializationFailure(error)) throw error;
+      if (true) throw error;
     }
   }
killedBy: POOL-043 经营账单序列化冲突重试 仅重试 PostgreSQL 40001，并由新事务第三次成功
statusReason: promise rejected "Error: serialize-1 { code: '40001' }" instead of resolving

[Killed] BlockStatement
src/repositories/operating-bill-concurrency.ts:17:58
   throw new OperatingBillConcurrentModificationError();
 }
 
-function isSerializationFailure(error: unknown): boolean {
-  return typeof error === "object" && error !== null && "code" in error && error.code === "40001";
-}
+function isSerializationFailure(error: unknown): boolean {}
 
killedBy: POOL-043 经营账单序列化冲突重试 仅重试 PostgreSQL 40001，并由新事务第三次成功
statusReason: promise rejected "Error: serialize-1 { code: '40001' }" instead of resolving

[Killed] EqualityOperator
src/repositories/operating-bill-concurrency.ts:18:76
 }
 
 function isSerializationFailure(error: unknown): boolean {
-  return typeof error === "object" && error !== null && "code" in error && error.code === "40001";
+  return typeof error === "object" && error !== null && "code" in error && error.code !== "40001";
 }
 
killedBy: POOL-043 经营账单序列化冲突重试 仅重试 PostgreSQL 40001，并由新事务第三次成功
statusReason: promise rejected "Error: serialize-1 { code: '40001' }" instead of resolving

[Killed] LogicalOperator
src/repositories/operating-bill-concurrency.ts:18:10
 }
 
 function isSerializationFailure(error: unknown): boolean {
-  return typeof error === "object" && error !== null && "code" in error && error.code === "40001";
+  return typeof error === "object" || error !== null && "code" in error && error.code === "40001";
 }
 
killedBy: POOL-043 经营账单序列化冲突重试 非对象或无 code 的异常 null 也必须原样抛出
statusReason: expected TypeError: Cannot use 'in' operator to se… to be null // Object.is equality
