[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:11:9
   totals: Map<string, Decimal | null>,
   resourceId: string,
   value: string | null,
-): void {
-  const previous = totals.get(resourceId);
-  if (value === null || previous === null) {
-    totals.set(resourceId, null);
-    return;
-  }
-  totals.set(resourceId, (previous ?? new MoneyDecimal(0)).plus(value));
-}
+): void {}
 
 export function sumKnownCosts(totals: Map<string, Decimal | null>): Decimal | null {
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: expected '0.00000000' to be '2.00000000' // Object.is equality

[Killed] ConditionalExpression
src/repositories/operating-bill-cost-quality.ts:13:7
   value: string | null,
 ): void {
   const previous = totals.get(resourceId);
-  if (value === null || previous === null) {
+  if (false) {
     totals.set(resourceId, null);
     return;
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: [DecimalError] Invalid argument: null

[Killed] ConditionalExpression
src/repositories/operating-bill-cost-quality.ts:13:7
   value: string | null,
 ): void {
   const previous = totals.get(resourceId);
-  if (value === null || previous === null) {
+  if (false || previous === null) {
     totals.set(resourceId, null);
     return;
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: [DecimalError] Invalid argument: null

[Killed] LogicalOperator
src/repositories/operating-bill-cost-quality.ts:17:27
     totals.set(resourceId, null);
     return;
   }
-  totals.set(resourceId, (previous ?? new MoneyDecimal(0)).plus(value));
+  totals.set(resourceId, (previous && new MoneyDecimal(0)).plus(value));
 }
 
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: Cannot read properties of undefined (reading 'plus')

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:20:84
   totals.set(resourceId, (previous ?? new MoneyDecimal(0)).plus(value));
 }
 
-export function sumKnownCosts(totals: Map<string, Decimal | null>): Decimal | null {
-  const values = [...totals.values()];
-  const known = values.filter((value): value is Decimal => value !== null);
-  if (known.length !== values.length) return null;
-  return known.reduce((sum, value) => sum.plus(value), new MoneyDecimal(0));
-}
+export function sumKnownCosts(totals: Map<string, Decimal | null>): Decimal | null {}
 
 export function unknownApiCostGaps(
killedBy: POOL-043 结账与项目归属并发边界 观察到真实行锁竞争后重试新快照，冻结结果不丢失已提交归属
statusReason: Cannot read properties of undefined (reading 'toDecimalPlaces')

[Killed] MethodExpression
src/repositories/operating-bill-cost-quality.ts:22:17
 
 export function sumKnownCosts(totals: Map<string, Decimal | null>): Decimal | null {
   const values = [...totals.values()];
-  const known = values.filter((value): value is Decimal => value !== null);
+  const known = values;
   if (known.length !== values.length) return null;
   return known.reduce((sum, value) => sum.plus(value), new MoneyDecimal(0));
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: [DecimalError] Invalid argument: null

[Killed] ArrowFunction
src/repositories/operating-bill-cost-quality.ts:22:31
 
 export function sumKnownCosts(totals: Map<string, Decimal | null>): Decimal | null {
   const values = [...totals.values()];
-  const known = values.filter((value): value is Decimal => value !== null);
+  const known = values.filter(() => undefined);
   if (known.length !== values.length) return null;
   return known.reduce((sum, value) => sum.plus(value), new MoneyDecimal(0));
killedBy: POOL-043 API 成本未知传播 无调用资源保持精确零，全部已知资源才允许汇总总成本
statusReason: expected null to be '2.00000000' // Object.is equality

[Killed] ConditionalExpression
src/repositories/operating-bill-cost-quality.ts:23:7
 export function sumKnownCosts(totals: Map<string, Decimal | null>): Decimal | null {
   const values = [...totals.values()];
   const known = values.filter((value): value is Decimal => value !== null);
-  if (known.length !== values.length) return null;
+  if (true) return null;
   return known.reduce((sum, value) => sum.plus(value), new MoneyDecimal(0));
 }
killedBy: POOL-043 API 成本未知传播 无调用资源保持精确零，全部已知资源才允许汇总总成本
statusReason: expected null to be '0.00000000' // Object.is equality

[Killed] EqualityOperator
src/repositories/operating-bill-cost-quality.ts:23:7
 export function sumKnownCosts(totals: Map<string, Decimal | null>): Decimal | null {
   const values = [...totals.values()];
   const known = values.filter((value): value is Decimal => value !== null);
-  if (known.length !== values.length) return null;
+  if (known.length === values.length) return null;
   return known.reduce((sum, value) => sum.plus(value), new MoneyDecimal(0));
 }
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: expected 0 to be null

[Killed] ArrowFunction
src/repositories/operating-bill-cost-quality.ts:24:23
   const values = [...totals.values()];
   const known = values.filter((value): value is Decimal => value !== null);
   if (known.length !== values.length) return null;
-  return known.reduce((sum, value) => sum.plus(value), new MoneyDecimal(0));
+  return known.reduce(() => undefined, new MoneyDecimal(0));
 }
 
killedBy: POOL-043 API 成本未知传播 无调用资源保持精确零，全部已知资源才允许汇总总成本
statusReason: Cannot read properties of undefined (reading 'toDecimalPlaces')

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:30:23
 export function unknownApiCostGaps(
   totals: Map<string, Decimal | null>,
   resources: Map<string, { resource_name: string }>,
-): OperatingBillGap[] {
-  return [...totals].flatMap(([resourceId, cost]) => cost === null ? [{
-    code: "API_COST_UNKNOWN",
-    message: `${resources.get(resourceId)?.resource_name ?? resourceId} 存在未知账本 API 计价`,
-    providerResourceId: resourceId,
-  }] : []);
-}
+): OperatingBillGap[] {}
 
 export function addSubjectApiCost(
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: expected undefined to deeply equal [ { code: 'API_COST_UNKNOWN', …(2) } ]

[Killed] ArrowFunction
src/repositories/operating-bill-cost-quality.ts:31:30
   totals: Map<string, Decimal | null>,
   resources: Map<string, { resource_name: string }>,
 ): OperatingBillGap[] {
-  return [...totals].flatMap(([resourceId, cost]) => cost === null ? [{
-    code: "API_COST_UNKNOWN",
-    message: `${resources.get(resourceId)?.resource_name ?? resourceId} 存在未知账本 API 计价`,
-    providerResourceId: resourceId,
-  }] : []);
+  return [...totals].flatMap(() => undefined);
 }
 
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: expected [ undefined ] to deeply equal [ { code: 'API_COST_UNKNOWN', …(2) } ]

[Killed] EqualityOperator
src/repositories/operating-bill-cost-quality.ts:31:54
   totals: Map<string, Decimal | null>,
   resources: Map<string, { resource_name: string }>,
 ): OperatingBillGap[] {
-  return [...totals].flatMap(([resourceId, cost]) => cost === null ? [{
+  return [...totals].flatMap(([resourceId, cost]) => cost !== null ? [{
     code: "API_COST_UNKNOWN",
     message: `${resources.get(resourceId)?.resource_name ?? resourceId} 存在未知账本 API 计价`,
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: expected [] to deeply equal [ { code: 'API_COST_UNKNOWN', …(2) } ]

[Killed] OptionalChaining
src/repositories/operating-bill-cost-quality.ts:33:17
 ): OperatingBillGap[] {
   return [...totals].flatMap(([resourceId, cost]) => cost === null ? [{
     code: "API_COST_UNKNOWN",
-    message: `${resources.get(resourceId)?.resource_name ?? resourceId} 存在未知账本 API 计价`,
+    message: `${resources.get(resourceId).resource_name ?? resourceId} 存在未知账本 API 计价`,
     providerResourceId: resourceId,
   }] : []);
killedBy: POOL-043 API 成本未知传播 未知成本缺资源名称时回退稳定资源 ID，且只报告未知项
statusReason: Cannot read properties of undefined (reading 'resource_name')

[Killed] LogicalOperator
src/repositories/operating-bill-cost-quality.ts:33:17
 ): OperatingBillGap[] {
   return [...totals].flatMap(([resourceId, cost]) => cost === null ? [{
     code: "API_COST_UNKNOWN",
-    message: `${resources.get(resourceId)?.resource_name ?? resourceId} 存在未知账本 API 计价`,
+    message: `${resources.get(resourceId)?.resource_name && resourceId} 存在未知账本 API 计价`,
     providerResourceId: resourceId,
   }] : []);
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: expected [ { code: 'API_COST_UNKNOWN', …(2) } ] to deeply equal [ { code: 'API_COST_UNKNOWN', …(2) } ]

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:41:9
 export function addSubjectApiCost(
   target: { api: Decimal; apiKnown: boolean },
   value: string | null,
-): void {
-  if (value === null) {
-    target.apiKnown = false;
-  } else {
-    target.api = target.api.plus(value);
-  }
-}
+): void {}
 
 function amount(value: Decimal): string {
killedBy: POOL-043 API 成本未知传播 主体成本 known flag 一旦遇到未知值就不再伪装精确
statusReason: expected '0.00000000' to be '1.50000000' // Object.is equality

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:42:23
   target: { api: Decimal; apiKnown: boolean },
   value: string | null,
 ): void {
-  if (value === null) {
-    target.apiKnown = false;
-  } else {
+  if (value === null) {} else {
     target.api = target.api.plus(value);
   }
killedBy: POOL-043 API 成本未知传播 主体成本 known flag 一旦遇到未知值就不再伪装精确
statusReason: expected '2.00000000' to be null

[Killed] ConditionalExpression
src/repositories/operating-bill-cost-quality.ts:42:7
   target: { api: Decimal; apiKnown: boolean },
   value: string | null,
 ): void {
-  if (value === null) {
+  if (true) {
     target.apiKnown = false;
   } else {
killedBy: POOL-043 API 成本未知传播 主体成本 known flag 一旦遇到未知值就不再伪装精确
statusReason: expected null to be '1.50000000' // Object.is equality

[Killed] BooleanLiteral
src/repositories/operating-bill-cost-quality.ts:43:23
   value: string | null,
 ): void {
   if (value === null) {
-    target.apiKnown = false;
+    target.apiKnown = true;
   } else {
     target.api = target.api.plus(value);
killedBy: POOL-043 API 成本未知传播 主体成本 known flag 一旦遇到未知值就不再伪装精确
statusReason: expected '2.00000000' to be null

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:44:10
 ): void {
   if (value === null) {
     target.apiKnown = false;
-  } else {
-    target.api = target.api.plus(value);
-  }
+  } else {}
 }
 
killedBy: POOL-043 API 成本未知传播 主体成本 known flag 一旦遇到未知值就不再伪装精确
statusReason: expected '0.00000000' to be '1.50000000' // Object.is equality

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:49:41
   }
 }
 
-function amount(value: Decimal): string {
-  return value.toDecimalPlaces(8).toFixed(8);
-}
+function amount(value: Decimal): string {}
 
 export function knownAmount(value: Decimal, known: boolean): string | null {
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: expected undefined to be '2.00000000' // Object.is equality

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:53:76
   return value.toDecimalPlaces(8).toFixed(8);
 }
 
-export function knownAmount(value: Decimal, known: boolean): string | null {
-  return known ? amount(value) : null;
-}
+export function knownAmount(value: Decimal, known: boolean): string | null {}
 
 export function nullableAmount(value: Decimal | null): string | null {
killedBy: POOL-043 API 成本未知传播 主体成本 known flag 一旦遇到未知值就不再伪装精确
statusReason: expected undefined to be '1.50000000' // Object.is equality

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:57:70
   return known ? amount(value) : null;
 }
 
-export function nullableAmount(value: Decimal | null): string | null {
-  return value === null ? null : amount(value);
-}
+export function nullableAmount(value: Decimal | null): string | null {}
 
 export function nullableTotal(apiCost: Decimal | null, packageCost: Decimal): string | null {
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: expected undefined to be '2.00000000' // Object.is equality

[Killed] ConditionalExpression
src/repositories/operating-bill-cost-quality.ts:58:10
 }
 
 export function nullableAmount(value: Decimal | null): string | null {
-  return value === null ? null : amount(value);
+  return true ? null : amount(value);
 }
 
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: expected null to be '2.00000000' // Object.is equality

[Killed] ConditionalExpression
src/repositories/operating-bill-cost-quality.ts:58:10
 }
 
 export function nullableAmount(value: Decimal | null): string | null {
-  return value === null ? null : amount(value);
+  return false ? null : amount(value);
 }
 
killedBy: POOL-043 API 成本未知传播 主体成本 known flag 一旦遇到未知值就不再伪装精确
statusReason: Cannot read properties of null (reading 'toDecimalPlaces')

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:61:93
   return value === null ? null : amount(value);
 }
 
-export function nullableTotal(apiCost: Decimal | null, packageCost: Decimal): string | null {
-  return apiCost === null ? null : amount(apiCost.plus(packageCost));
-}
+export function nullableTotal(apiCost: Decimal | null, packageCost: Decimal): string | null {}
 
 /** Map 缺项表示本月无调用（精确 0）；显式 null 表示存在调用但费用未知。 */
killedBy: POOL-043 API 成本未知传播 无调用资源保持精确零，全部已知资源才允许汇总总成本
statusReason: expected undefined to be '5.00000000' // Object.is equality

[Killed] ConditionalExpression
src/repositories/operating-bill-cost-quality.ts:62:10
 }
 
 export function nullableTotal(apiCost: Decimal | null, packageCost: Decimal): string | null {
-  return apiCost === null ? null : amount(apiCost.plus(packageCost));
+  return false ? null : amount(apiCost.plus(packageCost));
 }
 
killedBy: POOL-043 API 成本未知传播 无调用资源保持精确零，全部已知资源才允许汇总总成本
statusReason: Cannot read properties of null (reading 'plus')

[Killed] EqualityOperator
src/repositories/operating-bill-cost-quality.ts:62:10
 }
 
 export function nullableTotal(apiCost: Decimal | null, packageCost: Decimal): string | null {
-  return apiCost === null ? null : amount(apiCost.plus(packageCost));
+  return apiCost !== null ? null : amount(apiCost.plus(packageCost));
 }
 
killedBy: POOL-043 API 成本未知传播 无调用资源保持精确零，全部已知资源才允许汇总总成本
statusReason: expected null to be '5.00000000' // Object.is equality

[Killed] BlockStatement
src/repositories/operating-bill-cost-quality.ts:69:19
 export function resourceCost(
   totals: Map<string, Decimal | null>,
   resourceId: string,
-): Decimal | null {
-  return totals.has(resourceId) ? totals.get(resourceId)! : new MoneyDecimal(0);
-}
+): Decimal | null {}
 
killedBy: POOL-043 API 成本未知传播 同资源任一未知明细吸收已知成本，并生成明确缺口
statusReason: Cannot read properties of undefined (reading 'toDecimalPlaces')
