[Killed] BlockStatement
src/repositories/operating-bill-month.ts:2:103
 /** 账期参数只接受 YYYY-MM，边界固定为北京时间自然月。 */
-export function operatingBillMonthRange(month: string): { start: Date; end: Date; monthDate: string } {
-  const match = /^(\d{4})-(0[1-9]|1[0-2])$/.exec(month);
-  if (!match) throw new InvalidOperatingBillMonthError();
-  const year = Number(match[1]);
-  const monthNumber = Number(match[2]);
-  if (year < 2000 || year > 2200) throw new InvalidOperatingBillMonthError();
-  const nextYear = monthNumber === 12 ? year + 1 : year;
-  const nextMonth = monthNumber === 12 ? 1 : monthNumber + 1;
-  return {
-    start: new Date(`${month}-01T00:00:00+08:00`),
-    end: new Date(`${nextYear}-${String(nextMonth).padStart(2, "0")}-01T00:00:00+08:00`),
-    monthDate: `${month}-01`,
-  };
-}
+export function operatingBillMonthRange(month: string): { start: Date; end: Date; monthDate: string } {}
 
 export class InvalidOperatingBillMonthError extends Error {}
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected undefined to deeply equal { …(3) }

[Killed] Regex
src/repositories/operating-bill-month.ts:3:17
 /** 账期参数只接受 YYYY-MM，边界固定为北京时间自然月。 */
 export function operatingBillMonthRange(month: string): { start: Date; end: Date; monthDate: string } {
-  const match = /^(\d{4})-(0[1-9]|1[0-2])$/.exec(month);
+  const match = /^(\d{4})-(0[1-9]|1[0-2])/.exec(month);
   if (!match) throw new InvalidOperatingBillMonthError();
   const year = Number(match[1]);
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected function to throw an error, but it didn't

[Killed] Regex
src/repositories/operating-bill-month.ts:3:17
 /** 账期参数只接受 YYYY-MM，边界固定为北京时间自然月。 */
 export function operatingBillMonthRange(month: string): { start: Date; end: Date; monthDate: string } {
-  const match = /^(\d{4})-(0[1-9]|1[0-2])$/.exec(month);
+  const match = /(\d{4})-(0[1-9]|1[0-2])$/.exec(month);
   if (!match) throw new InvalidOperatingBillMonthError();
   const year = Number(match[1]);
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/repositories/operating-bill-month.ts:4:7
 /** 账期参数只接受 YYYY-MM，边界固定为北京时间自然月。 */
 export function operatingBillMonthRange(month: string): { start: Date; end: Date; monthDate: string } {
   const match = /^(\d{4})-(0[1-9]|1[0-2])$/.exec(month);
-  if (!match) throw new InvalidOperatingBillMonthError();
+  if (false) throw new InvalidOperatingBillMonthError();
   const year = Number(match[1]);
   const monthNumber = Number(match[2]);
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected error to be instance of InvalidOperatingBillMonthError

[Killed] BooleanLiteral
src/repositories/operating-bill-month.ts:4:7
 /** 账期参数只接受 YYYY-MM，边界固定为北京时间自然月。 */
 export function operatingBillMonthRange(month: string): { start: Date; end: Date; monthDate: string } {
   const match = /^(\d{4})-(0[1-9]|1[0-2])$/.exec(month);
-  if (!match) throw new InvalidOperatingBillMonthError();
+  if (match) throw new InvalidOperatingBillMonthError();
   const year = Number(match[1]);
   const monthNumber = Number(match[2]);
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入

[Killed] EqualityOperator
src/repositories/operating-bill-month.ts:7:22
   if (!match) throw new InvalidOperatingBillMonthError();
   const year = Number(match[1]);
   const monthNumber = Number(match[2]);
-  if (year < 2000 || year > 2200) throw new InvalidOperatingBillMonthError();
+  if (year < 2000 || year >= 2200) throw new InvalidOperatingBillMonthError();
   const nextYear = monthNumber === 12 ? year + 1 : year;
   const nextMonth = monthNumber === 12 ? 1 : monthNumber + 1;
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入

[Killed] ConditionalExpression
src/repositories/operating-bill-month.ts:7:7
   if (!match) throw new InvalidOperatingBillMonthError();
   const year = Number(match[1]);
   const monthNumber = Number(match[2]);
-  if (year < 2000 || year > 2200) throw new InvalidOperatingBillMonthError();
+  if (true) throw new InvalidOperatingBillMonthError();
   const nextYear = monthNumber === 12 ? year + 1 : year;
   const nextMonth = monthNumber === 12 ? 1 : monthNumber + 1;
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入

[Killed] EqualityOperator
src/repositories/operating-bill-month.ts:8:20
   const year = Number(match[1]);
   const monthNumber = Number(match[2]);
   if (year < 2000 || year > 2200) throw new InvalidOperatingBillMonthError();
-  const nextYear = monthNumber === 12 ? year + 1 : year;
+  const nextYear = monthNumber !== 12 ? year + 1 : year;
   const nextMonth = monthNumber === 12 ? 1 : monthNumber + 1;
   return {
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] ArithmeticOperator
src/repositories/operating-bill-month.ts:8:41
   const year = Number(match[1]);
   const monthNumber = Number(match[2]);
   if (year < 2000 || year > 2200) throw new InvalidOperatingBillMonthError();
-  const nextYear = monthNumber === 12 ? year + 1 : year;
+  const nextYear = monthNumber === 12 ? year - 1 : year;
   const nextMonth = monthNumber === 12 ? 1 : monthNumber + 1;
   return {
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected 2024-12-31T16:00:00.000Z to deeply equal 2026-12-31T16:00:00.000Z

[Killed] EqualityOperator
src/repositories/operating-bill-month.ts:9:21
   const monthNumber = Number(match[2]);
   if (year < 2000 || year > 2200) throw new InvalidOperatingBillMonthError();
   const nextYear = monthNumber === 12 ? year + 1 : year;
-  const nextMonth = monthNumber === 12 ? 1 : monthNumber + 1;
+  const nextMonth = monthNumber !== 12 ? 1 : monthNumber + 1;
   return {
     start: new Date(`${month}-01T00:00:00+08:00`),
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] ArithmeticOperator
src/repositories/operating-bill-month.ts:9:46
   const monthNumber = Number(match[2]);
   if (year < 2000 || year > 2200) throw new InvalidOperatingBillMonthError();
   const nextYear = monthNumber === 12 ? year + 1 : year;
-  const nextMonth = monthNumber === 12 ? 1 : monthNumber + 1;
+  const nextMonth = monthNumber === 12 ? 1 : monthNumber - 1;
   return {
     start: new Date(`${month}-01T00:00:00+08:00`),
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] ObjectLiteral
src/repositories/operating-bill-month.ts:10:10
   if (year < 2000 || year > 2200) throw new InvalidOperatingBillMonthError();
   const nextYear = monthNumber === 12 ? year + 1 : year;
   const nextMonth = monthNumber === 12 ? 1 : monthNumber + 1;
-  return {
-    start: new Date(`${month}-01T00:00:00+08:00`),
-    end: new Date(`${nextYear}-${String(nextMonth).padStart(2, "0")}-01T00:00:00+08:00`),
-    monthDate: `${month}-01`,
-  };
+  return {};
 }
 
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected {} to deeply equal { …(3) }

[Killed] StringLiteral
src/repositories/operating-bill-month.ts:12:64
   const nextMonth = monthNumber === 12 ? 1 : monthNumber + 1;
   return {
     start: new Date(`${month}-01T00:00:00+08:00`),
-    end: new Date(`${nextYear}-${String(nextMonth).padStart(2, "0")}-01T00:00:00+08:00`),
+    end: new Date(`${nextYear}-${String(nextMonth).padStart(2, "")}-01T00:00:00+08:00`),
     monthDate: `${month}-01`,
   };
killedBy: POOL-043 账户聚合纯函数 账期固定为北京时间自然月并拒绝越界或非规范输入
statusReason: expected { …(3) } to deeply equal { …(3) }
