[Survived] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:183:9
       created_at: createdAt,
     }).onConflict((oc) => oc.column("dedup_key").doNothing())
       .returningAll().execute();
-    if (result[0]) await ensureRequestAttributionSnapshot(trx, input.enterprise_id, input.ai_request_id);
+    if (false) await ensureRequestAttributionSnapshot(trx, input.enterprise_id, input.ai_request_id);
     return result[0];
   });

[Survived] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:183:9
       created_at: createdAt,
     }).onConflict((oc) => oc.column("dedup_key").doNothing())
       .returningAll().execute();
-    if (result[0]) await ensureRequestAttributionSnapshot(trx, input.enterprise_id, input.ai_request_id);
+    if (true) await ensureRequestAttributionSnapshot(trx, input.enterprise_id, input.ai_request_id);
     return result[0];
   });

[Survived] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:260:9
       created_at: new Date(),
     }).onConflict((oc) => oc.column("ai_request_id").doNothing())
       .returningAll().execute();
-    if (result[0]) {
+    if (true) {
       await ensureRequestAttributionSnapshot(trx, input.enterprise_id, input.ai_request_id);
     }

[Survived] ConditionalExpression
src/repositories/gateway-ledger-guarded-writes.ts:260:9
       created_at: new Date(),
     }).onConflict((oc) => oc.column("ai_request_id").doNothing())
       .returningAll().execute();
-    if (result[0]) {
+    if (false) {
       await ensureRequestAttributionSnapshot(trx, input.enterprise_id, input.ai_request_id);
     }

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:272:71
   enterpriseId: string,
   requestId: string,
 ): Promise<{ status: string; principal_id: string }> {
-  const request = await db.selectFrom("ai_request").select(["status", "principal_id"])
+  const request = await db.selectFrom("ai_request").select(["status", ""])
     .where("id", "=", requestId).where("enterprise_id", "=", enterpriseId)
     .forUpdate().executeTakeFirst();
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed

[Killed] StringLiteral
src/repositories/gateway-ledger-guarded-writes.ts:273:18
   requestId: string,
 ): Promise<{ status: string; principal_id: string }> {
   const request = await db.selectFrom("ai_request").select(["status", "principal_id"])
-    .where("id", "=", requestId).where("enterprise_id", "=", enterpriseId)
+    .where("id", "", requestId).where("enterprise_id", "=", enterpriseId)
     .forUpdate().executeTakeFirst();
   if (!request) throw new GatewayLedgerSettlementConflictError("settlement_request_not_found");
killedBy: POOL-043 结账与项目归属并发边界 账期原先不存在时等待 gateway 写入，并拒绝冻结缺 transaction 的半成品
statusReason: gateway_ledger_insert_lock_not_observed
