[Killed] ConditionalExpression
src/routing-policy.ts:99:7
  */
 export function healthScore(status: ResourceStatus, probe: boolean): number {
   if (probe) return ROUTING_POLICY.probeHealthScore;
-  if (status === "DEGRADED") return ROUTING_POLICY.degradedHealthScore;
+  if (true) return ROUTING_POLICY.degradedHealthScore;
   return 1;
 }
killedBy: healthScore 健康因子 ACTIVE=1 / DEGRADED=0.6 / probe=0.3
statusReason: expected 0.6 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:130:37
 
   const results: ScoredCandidate[] = candidates.map((c) => {
     const excluded = excludeResourceIds.has(c.resourceId);
-    const inTopGroup = !excluded && c.priority === topPriority;
+    const inTopGroup = !excluded && true;
 
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: expected 'LOWER_SCORE' to be 'NOT_TOP_PRIORITY' // Object.is equality

[Killed] EqualityOperator
src/routing-policy.ts:130:37
 
   const results: ScoredCandidate[] = candidates.map((c) => {
     const excluded = excludeResourceIds.has(c.resourceId);
-    const inTopGroup = !excluded && c.priority === topPriority;
+    const inTopGroup = !excluded && c.priority !== topPriority;
 
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: expected 'LOWER_SCORE' to be 'NOT_TOP_PRIORITY' // Object.is equality

[Killed] ArrowFunction
src/routing-policy.ts:133:39
     const inTopGroup = !excluded && c.priority === topPriority;
 
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
-    const sameGroup = eligible.filter((x) => x.priority === c.priority);
+    const sameGroup = eligible.filter(() => undefined);
     const weightSum = sameGroup.reduce((s, x) => s + x.weight, 0);
     const factors: ScoreFactor[] = [
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: expected +0 to be close to 0.9, received difference is 0.9, but expected 0.0000049999999999999996

[Killed] EqualityOperator
src/routing-policy.ts:138:16
     const factors: ScoreFactor[] = [
       {
         name: "static_weight",
-        value: weightSum > 0 ? c.weight / weightSum : 0,
+        value: weightSum <= 0 ? c.weight / weightSum : 0,
         weight: ROUTING_POLICY.weights.staticWeight,
       },
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: expected +0 to be close to 0.9, received difference is 0.9, but expected 0.0000049999999999999996

[Killed] ObjectLiteral
src/routing-policy.ts:141:7
         value: weightSum > 0 ? c.weight / weightSum : 0,
         weight: ROUTING_POLICY.weights.staticWeight,
       },
-      {
-        name: "health",
-        value: healthScore(c.status, c.probe),
-        weight: ROUTING_POLICY.weights.health,
-      },
+      {},
       {
         name: "affinity",
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Survived] StringLiteral
src/routing-policy.ts:142:15
         weight: ROUTING_POLICY.weights.staticWeight,
       },
       {
-        name: "health",
+        name: "",
         value: healthScore(c.status, c.probe),
         weight: ROUTING_POLICY.weights.health,

[Killed] EqualityOperator
src/routing-policy.ts:148:16
       },
       {
         name: "affinity",
-        value: affinityResourceId !== null && c.resourceId === affinityResourceId ? 1 : 0,
+        value: affinityResourceId === null && c.resourceId === affinityResourceId ? 1 : 0,
         weight: ROUTING_POLICY.weights.affinity,
       },
killedBy: scoreAndSelect priority 分组与评分 Affinity 命中提升总分（WT-13 会话粘性）
statusReason: expected 'a-first' to be 'b-second' // Object.is equality

[Killed] EqualityOperator
src/routing-policy.ts:148:47
       },
       {
         name: "affinity",
-        value: affinityResourceId !== null && c.resourceId === affinityResourceId ? 1 : 0,
+        value: affinityResourceId !== null && c.resourceId !== affinityResourceId ? 1 : 0,
         weight: ROUTING_POLICY.weights.affinity,
       },
killedBy: scoreAndSelect priority 分组与评分 Affinity 命中提升总分（WT-13 会话粘性）
statusReason: expected 'a-first' to be 'b-second' // Object.is equality

[Killed] ArithmeticOperator
src/routing-policy.ts:153:67
       },
     ];
     const weightTotal = factors.reduce((s, f) => s + f.weight, 0);
-    const totalScore = weightTotal > 0 ? factors.reduce((s, f) => s + f.value * f.weight, 0) / weightTotal : 0;
+    const totalScore = weightTotal > 0 ? factors.reduce((s, f) => s - f.value * f.weight, 0) / weightTotal : 0;
 
     return {
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: expected 'b-light' to be 'a-heavy' // Object.is equality

[Killed] ObjectLiteral
src/routing-policy.ts:155:12
     const weightTotal = factors.reduce((s, f) => s + f.weight, 0);
     const totalScore = weightTotal > 0 ? factors.reduce((s, f) => s + f.value * f.weight, 0) / weightTotal : 0;
 
-    return {
-      input: c,
-      factors,
-      totalScore,
-      selected: false,
-      reasonCode: excluded
-        ? ROUTE_REASON.EXCLUDED_ALREADY_TRIED
-        : inTopGroup
-          ? ROUTE_REASON.LOWER_SCORE // 暂记，选中后回填
-          : ROUTE_REASON.NOT_TOP_PRIORITY,
-    };
+    return {};
   });
 
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'resourceId')

[Killed] ConditionalExpression
src/routing-policy.ts:170:20
 
   // 4. 选中：最高优先级组内总分最高；同分按 resourceId 字典序（稳定 tie-break）
   const competitors = results
-    .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
+    .filter((r) => false)
     .sort((a, b) => {
       if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'input')

[Killed] LogicalOperator
src/routing-policy.ts:170:20
 
   // 4. 选中：最高优先级组内总分最高；同分按 resourceId 字典序（稳定 tie-break）
   const competitors = results
-    .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
+    .filter((r) => !excludeResourceIds.has(r.input.resourceId) || r.input.priority === topPriority)
     .sort((a, b) => {
       if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: expected 'TIE_BREAK_LOST' to be 'NOT_TOP_PRIORITY' // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:172:11
   const competitors = results
     .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
     .sort((a, b) => {
-      if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
+      if (true) return b.totalScore - a.totalScore;
       return a.input.resourceId.localeCompare(b.input.resourceId); // 稳定 tie-break
     });
killedBy: scoreAndSelect priority 分组与评分 稳定 tie-break：同分按 resourceId 字典序，与输入顺序无关
statusReason: expected 'res-ccc' to be 'res-aaa' // Object.is equality

[Killed] BlockStatement
src/routing-policy.ts:176:31
       return a.input.resourceId.localeCompare(b.input.resourceId); // 稳定 tie-break
     });
 
-  if (competitors.length > 0) {
-    const winner = competitors[0]!;
-    winner.selected = true;
-    const tied = competitors.length > 1 && competitors[1]!.totalScore === winner.totalScore;
-    winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
-    // 同分落选者标记
-    for (const loser of competitors.slice(1)) {
-      if (loser.totalScore === winner.totalScore) loser.reasonCode = ROUTE_REASON.TIE_BREAK_LOST;
-    }
-  }
+  if (competitors.length > 0) {}
 
   return results;
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'input')

[Killed] EqualityOperator
src/routing-policy.ts:179:18
   if (competitors.length > 0) {
     const winner = competitors[0]!;
     winner.selected = true;
-    const tied = competitors.length > 1 && competitors[1]!.totalScore === winner.totalScore;
+    const tied = competitors.length >= 1 && competitors[1]!.totalScore === winner.totalScore;
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
     // 同分落选者标记
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'totalScore')

[Killed] EqualityOperator
src/routing-policy.ts:179:18
   if (competitors.length > 0) {
     const winner = competitors[0]!;
     winner.selected = true;
-    const tied = competitors.length > 1 && competitors[1]!.totalScore === winner.totalScore;
+    const tied = competitors.length <= 1 && competitors[1]!.totalScore === winner.totalScore;
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
     // 同分落选者标记
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'totalScore')

[Killed] ConditionalExpression
src/routing-policy.ts:183:11
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
     // 同分落选者标记
     for (const loser of competitors.slice(1)) {
-      if (loser.totalScore === winner.totalScore) loser.reasonCode = ROUTE_REASON.TIE_BREAK_LOST;
+      if (true) loser.reasonCode = ROUTE_REASON.TIE_BREAK_LOST;
     }
   }
killedBy: scoreAndSelect priority 分组与评分 非同分落选者标记 LOWER_SCORE（区分 TIE_BREAK_LOST 与 LOWER_SCORE）
statusReason: expected 'TIE_BREAK_LOST' to be 'LOWER_SCORE' // Object.is equality
