[Killed] BlockStatement
src/billing-rule.ts:72:70
 export function toZonedTime(
   epochMs: number,
   timezone: string,
-): { dayOfWeek: number; minutesOfDay: number; secondsOfDay: number } {
-  const fmt = new Intl.DateTimeFormat("en-US", {
-    timeZone: timezone,
-    weekday: "short",
-    hour: "2-digit",
-    minute: "2-digit",
-    second: "2-digit",
-    hour12: false,
-  });
-  const parts = fmt.formatToParts(new Date(epochMs));
-  const get = (t: string) => parts.find((p) => p.type === t)?.value ?? "";
-  const dowMap: Record<string, number> = { Sun: 7, Mon: 1, Tue: 2, Wed: 3, Thu: 4, Fri: 5, Sat: 6 };
-  const dayOfWeek = dowMap[get("weekday")] ?? 1;
-  let hour = parseInt(get("hour"), 10);
-  if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
-  const minutesOfDay = hour * 60 + parseInt(get("minute"), 10);
-  const secondsOfDay = minutesOfDay * 60 + parseInt(get("second"), 10);
-  return { dayOfWeek, minutesOfDay, secondsOfDay };
-}
+): { dayOfWeek: number; minutesOfDay: number; secondsOfDay: number } {}
 
 function parseTimeSeconds(s: string): number {
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: Cannot destructure property 'dayOfWeek' of 'toZonedTime(...)' as it is undefined.

[Killed] StringLiteral
src/billing-rule.ts:75:14
 ): { dayOfWeek: number; minutesOfDay: number; secondsOfDay: number } {
   const fmt = new Intl.DateTimeFormat("en-US", {
     timeZone: timezone,
-    weekday: "short",
+    weekday: "",
     hour: "2-digit",
     minute: "2-digit",
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: Value  out of range for Intl.DateTimeFormat options property weekday

[Killed] StringLiteral
src/billing-rule.ts:76:11
   const fmt = new Intl.DateTimeFormat("en-US", {
     timeZone: timezone,
     weekday: "short",
-    hour: "2-digit",
+    hour: "",
     minute: "2-digit",
     second: "2-digit",
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: Value  out of range for Intl.DateTimeFormat options property hour

[Killed] StringLiteral
src/billing-rule.ts:77:13
     timeZone: timezone,
     weekday: "short",
     hour: "2-digit",
-    minute: "2-digit",
+    minute: "",
     second: "2-digit",
     hour12: false,
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: Value  out of range for Intl.DateTimeFormat options property minute

[Killed] StringLiteral
src/billing-rule.ts:78:13
     weekday: "short",
     hour: "2-digit",
     minute: "2-digit",
-    second: "2-digit",
+    second: "",
     hour12: false,
   });
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: Value  out of range for Intl.DateTimeFormat options property second

[Killed] BooleanLiteral
src/billing-rule.ts:79:13
     hour: "2-digit",
     minute: "2-digit",
     second: "2-digit",
-    hour12: false,
+    hour12: true,
   });
   const parts = fmt.formatToParts(new Date(epochMs));
killedBy: toZonedTime 时区转换 UTC → Asia/Shanghai 星期与分钟
statusReason: expected 180 to be 900 // Object.is equality

[Killed] ArrowFunction
src/billing-rule.ts:82:41
     hour12: false,
   });
   const parts = fmt.formatToParts(new Date(epochMs));
-  const get = (t: string) => parts.find((p) => p.type === t)?.value ?? "";
+  const get = (t: string) => parts.find(() => undefined)?.value ?? "";
   const dowMap: Record<string, number> = { Sun: 7, Mon: 1, Tue: 2, Wed: 3, Thu: 4, Fri: 5, Sat: 6 };
   const dayOfWeek = dowMap[get("weekday")] ?? 1;
killedBy: toZonedTime 时区转换 UTC → Asia/Shanghai 星期与分钟
statusReason: expected NaN to be 900 // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:82:30
     hour12: false,
   });
   const parts = fmt.formatToParts(new Date(epochMs));
-  const get = (t: string) => parts.find((p) => p.type === t)?.value ?? "";
+  const get = (t: string) => parts.find(p => p.type === t)?.value && "";
   const dowMap: Record<string, number> = { Sun: 7, Mon: 1, Tue: 2, Wed: 3, Thu: 4, Fri: 5, Sat: 6 };
   const dayOfWeek = dowMap[get("weekday")] ?? 1;
killedBy: toZonedTime 时区转换 UTC → Asia/Shanghai 星期与分钟
statusReason: expected NaN to be 900 // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:84:21
   const parts = fmt.formatToParts(new Date(epochMs));
   const get = (t: string) => parts.find((p) => p.type === t)?.value ?? "";
   const dowMap: Record<string, number> = { Sun: 7, Mon: 1, Tue: 2, Wed: 3, Thu: 4, Fri: 5, Sat: 6 };
-  const dayOfWeek = dowMap[get("weekday")] ?? 1;
+  const dayOfWeek = dowMap[get("weekday")] && 1;
   let hour = parseInt(get("hour"), 10);
   if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
killedBy: matchesTimeWindow 时段判定 星期范围：仅工作日命中，周末不命中
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/billing-rule.ts:85:27
   const get = (t: string) => parts.find((p) => p.type === t)?.value ?? "";
   const dowMap: Record<string, number> = { Sun: 7, Mon: 1, Tue: 2, Wed: 3, Thu: 4, Fri: 5, Sat: 6 };
   const dayOfWeek = dowMap[get("weekday")] ?? 1;
-  let hour = parseInt(get("hour"), 10);
+  let hour = parseInt(get(""), 10);
   if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
   const minutesOfDay = hour * 60 + parseInt(get("minute"), 10);
killedBy: toZonedTime 时区转换 UTC → Asia/Shanghai 星期与分钟
statusReason: expected NaN to be 900 // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:86:7
   const dowMap: Record<string, number> = { Sun: 7, Mon: 1, Tue: 2, Wed: 3, Thu: 4, Fri: 5, Sat: 6 };
   const dayOfWeek = dowMap[get("weekday")] ?? 1;
   let hour = parseInt(get("hour"), 10);
-  if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
+  if (true) hour = 0; // Intl hour12:false 偶尔给 24
   const minutesOfDay = hour * 60 + parseInt(get("minute"), 10);
   const secondsOfDay = minutesOfDay * 60 + parseInt(get("second"), 10);
killedBy: toZonedTime 时区转换 UTC → Asia/Shanghai 星期与分钟
statusReason: expected +0 to be 900 // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:86:7
   const dowMap: Record<string, number> = { Sun: 7, Mon: 1, Tue: 2, Wed: 3, Thu: 4, Fri: 5, Sat: 6 };
   const dayOfWeek = dowMap[get("weekday")] ?? 1;
   let hour = parseInt(get("hour"), 10);
-  if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
+  if (hour !== 24) hour = 0; // Intl hour12:false 偶尔给 24
   const minutesOfDay = hour * 60 + parseInt(get("minute"), 10);
   const secondsOfDay = minutesOfDay * 60 + parseInt(get("second"), 10);
killedBy: toZonedTime 时区转换 UTC → Asia/Shanghai 星期与分钟
statusReason: expected +0 to be 900 // Object.is equality

[Killed] ArithmeticOperator
src/billing-rule.ts:87:24
   const dayOfWeek = dowMap[get("weekday")] ?? 1;
   let hour = parseInt(get("hour"), 10);
   if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
-  const minutesOfDay = hour * 60 + parseInt(get("minute"), 10);
+  const minutesOfDay = hour / 60 + parseInt(get("minute"), 10);
   const secondsOfDay = minutesOfDay * 60 + parseInt(get("second"), 10);
   return { dayOfWeek, minutesOfDay, secondsOfDay };
killedBy: toZonedTime 时区转换 UTC → Asia/Shanghai 星期与分钟
statusReason: expected 0.25 to be 900 // Object.is equality

[Survived] ArithmeticOperator
src/billing-rule.ts:87:24
   const dayOfWeek = dowMap[get("weekday")] ?? 1;
   let hour = parseInt(get("hour"), 10);
   if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
-  const minutesOfDay = hour * 60 + parseInt(get("minute"), 10);
+  const minutesOfDay = hour * 60 - parseInt(get("minute"), 10);
   const secondsOfDay = minutesOfDay * 60 + parseInt(get("second"), 10);
   return { dayOfWeek, minutesOfDay, secondsOfDay };

[Killed] ArithmeticOperator
src/billing-rule.ts:88:24
   let hour = parseInt(get("hour"), 10);
   if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
   const minutesOfDay = hour * 60 + parseInt(get("minute"), 10);
-  const secondsOfDay = minutesOfDay * 60 + parseInt(get("second"), 10);
+  const secondsOfDay = minutesOfDay * 60 - parseInt(get("second"), 10);
   return { dayOfWeek, minutesOfDay, secondsOfDay };
 }
killedBy: matchesTimeWindow 时段判定 带秒窗口按秒精确匹配，不提前进入或退出
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/billing-rule.ts:88:24
   let hour = parseInt(get("hour"), 10);
   if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
   const minutesOfDay = hour * 60 + parseInt(get("minute"), 10);
-  const secondsOfDay = minutesOfDay * 60 + parseInt(get("second"), 10);
+  const secondsOfDay = minutesOfDay / 60 + parseInt(get("second"), 10);
   return { dayOfWeek, minutesOfDay, secondsOfDay };
 }
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/billing-rule.ts:89:10
   if (hour === 24) hour = 0; // Intl hour12:false 偶尔给 24
   const minutesOfDay = hour * 60 + parseInt(get("minute"), 10);
   const secondsOfDay = minutesOfDay * 60 + parseInt(get("second"), 10);
-  return { dayOfWeek, minutesOfDay, secondsOfDay };
+  return {};
 }
 
killedBy: toZonedTime 时区转换 UTC → Asia/Shanghai 星期与分钟
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:92:46
   return { dayOfWeek, minutesOfDay, secondsOfDay };
 }
 
-function parseTimeSeconds(s: string): number {
-  const [h = "0", m = "0", second = "0"] = s.split(":");
-  return parseInt(h, 10) * 3600 + parseInt(m, 10) * 60 + parseInt(second, 10);
-}
+function parseTimeSeconds(s: string): number {}
 
 /** 兼容旧单窗列：新数组优先，旧数据自动投影成单元素数组。 */
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/billing-rule.ts:93:52
 }
 
 function parseTimeSeconds(s: string): number {
-  const [h = "0", m = "0", second = "0"] = s.split(":");
+  const [h = "0", m = "0", second = "0"] = s.split("");
   return parseInt(h, 10) * 3600 + parseInt(m, 10) * 60 + parseInt(second, 10);
 }
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/billing-rule.ts:94:10
 
 function parseTimeSeconds(s: string): number {
   const [h = "0", m = "0", second = "0"] = s.split(":");
-  return parseInt(h, 10) * 3600 + parseInt(m, 10) * 60 + parseInt(second, 10);
+  return parseInt(h, 10) / 3600 + parseInt(m, 10) * 60 + parseInt(second, 10);
 }
 
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/billing-rule.ts:94:10
 
 function parseTimeSeconds(s: string): number {
   const [h = "0", m = "0", second = "0"] = s.split(":");
-  return parseInt(h, 10) * 3600 + parseInt(m, 10) * 60 + parseInt(second, 10);
+  return parseInt(h, 10) * 3600 + parseInt(m, 10) * 60 - parseInt(second, 10);
 }
 
killedBy: matchesTimeWindow 时段判定 带秒窗口按秒精确匹配，不提前进入或退出
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:98:79
 }
 
 /** 兼容旧单窗列：新数组优先，旧数据自动投影成单元素数组。 */
-export function configuredTimeWindows(rule: BillingRule): BillingRuleWindow[] {
-  if (rule.timeWindows && rule.timeWindows.length > 0) return rule.timeWindows;
-  if (!rule.timezone || !rule.startTime || !rule.endTime) return [];
-  return [{
-    timezone: rule.timezone,
-    daysOfWeek: rule.daysOfWeek,
-    startTime: rule.startTime,
-    endTime: rule.endTime,
-  }];
-}
+export function configuredTimeWindows(rule: BillingRule): BillingRuleWindow[] {}
 
 function matchesWindow(window: BillingRuleWindow, epochMs: number): boolean {
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/billing-rule.ts:99:7
 
 /** 兼容旧单窗列：新数组优先，旧数据自动投影成单元素数组。 */
 export function configuredTimeWindows(rule: BillingRule): BillingRuleWindow[] {
-  if (rule.timeWindows && rule.timeWindows.length > 0) return rule.timeWindows;
+  if (true) return rule.timeWindows;
   if (!rule.timezone || !rule.startTime || !rule.endTime) return [];
   return [{
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: Cannot read properties of null (reading 'length')

[Killed] EqualityOperator
src/billing-rule.ts:99:27
 
 /** 兼容旧单窗列：新数组优先，旧数据自动投影成单元素数组。 */
 export function configuredTimeWindows(rule: BillingRule): BillingRuleWindow[] {
-  if (rule.timeWindows && rule.timeWindows.length > 0) return rule.timeWindows;
+  if (rule.timeWindows && rule.timeWindows.length <= 0) return rule.timeWindows;
   if (!rule.timezone || !rule.startTime || !rule.endTime) return [];
   return [{
killedBy: matchesTimeWindow 时段判定 同一规则两个高峰窗：09:00–12:00、14:00–18:00 任一命中且边界为 [start,end)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/billing-rule.ts:100:25
 /** 兼容旧单窗列：新数组优先，旧数据自动投影成单元素数组。 */
 export function configuredTimeWindows(rule: BillingRule): BillingRuleWindow[] {
   if (rule.timeWindows && rule.timeWindows.length > 0) return rule.timeWindows;
-  if (!rule.timezone || !rule.startTime || !rule.endTime) return [];
+  if (!rule.timezone || rule.startTime || !rule.endTime) return [];
   return [{
     timezone: rule.timezone,
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:100:7
 /** 兼容旧单窗列：新数组优先，旧数据自动投影成单元素数组。 */
 export function configuredTimeWindows(rule: BillingRule): BillingRuleWindow[] {
   if (rule.timeWindows && rule.timeWindows.length > 0) return rule.timeWindows;
-  if (!rule.timezone || !rule.startTime || !rule.endTime) return [];
+  if (true) return [];
   return [{
     timezone: rule.timezone,
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:109:77
   }];
 }
 
-function matchesWindow(window: BillingRuleWindow, epochMs: number): boolean {
-  const { dayOfWeek, secondsOfDay } = toZonedTime(epochMs, window.timezone);
-  const start = parseTimeSeconds(window.startTime);
-  const end = parseTimeSeconds(window.endTime);
-  if (start <= end) {
-    if (window.daysOfWeek && !window.daysOfWeek.includes(dayOfWeek)) return false;
-    return secondsOfDay >= start && secondsOfDay < end;
-  }
-
-  // 跨午夜窗口的星期归属开始日：例如“周一 23:00–02:00”包含周二 01:00。
-  // 结束日凌晨段要用前一天判断，避免要求管理员同时勾选周二而产生歧义。
-  const startDay = secondsOfDay >= start
-    ? dayOfWeek
-    : dayOfWeek === 1
-      ? 7
-      : dayOfWeek - 1;
-  if (window.daysOfWeek && !window.daysOfWeek.includes(startDay)) return false;
-  return secondsOfDay >= start || secondsOfDay < end;
-}
+function matchesWindow(window: BillingRuleWindow, epochMs: number): boolean {}
 
 /**
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:113:7
   const { dayOfWeek, secondsOfDay } = toZonedTime(epochMs, window.timezone);
   const start = parseTimeSeconds(window.startTime);
   const end = parseTimeSeconds(window.endTime);
-  if (start <= end) {
+  if (start > end) {
     if (window.daysOfWeek && !window.daysOfWeek.includes(dayOfWeek)) return false;
     return secondsOfDay >= start && secondsOfDay < end;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] ConditionalExpression
src/billing-rule.ts:113:7
   const { dayOfWeek, secondsOfDay } = toZonedTime(epochMs, window.timezone);
   const start = parseTimeSeconds(window.startTime);
   const end = parseTimeSeconds(window.endTime);
-  if (start <= end) {
+  if (false) {
     if (window.daysOfWeek && !window.daysOfWeek.includes(dayOfWeek)) return false;
     return secondsOfDay >= start && secondsOfDay < end;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] ConditionalExpression
src/billing-rule.ts:114:9
   const start = parseTimeSeconds(window.startTime);
   const end = parseTimeSeconds(window.endTime);
   if (start <= end) {
-    if (window.daysOfWeek && !window.daysOfWeek.includes(dayOfWeek)) return false;
+    if (true) return false;
     return secondsOfDay >= start && secondsOfDay < end;
   }
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:114:9
   const start = parseTimeSeconds(window.startTime);
   const end = parseTimeSeconds(window.endTime);
   if (start <= end) {
-    if (window.daysOfWeek && !window.daysOfWeek.includes(dayOfWeek)) return false;
+    if (window.daysOfWeek || !window.daysOfWeek.includes(dayOfWeek)) return false;
     return secondsOfDay >= start && secondsOfDay < end;
   }
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: Cannot read properties of null (reading 'includes')

[Killed] EqualityOperator
src/billing-rule.ts:115:12
   const end = parseTimeSeconds(window.endTime);
   if (start <= end) {
     if (window.daysOfWeek && !window.daysOfWeek.includes(dayOfWeek)) return false;
-    return secondsOfDay >= start && secondsOfDay < end;
+    return secondsOfDay > start && secondsOfDay < end;
   }
 
killedBy: matchesTimeWindow 时段判定 边界：start 含、end 不含
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:115:12
   const end = parseTimeSeconds(window.endTime);
   if (start <= end) {
     if (window.daysOfWeek && !window.daysOfWeek.includes(dayOfWeek)) return false;
-    return secondsOfDay >= start && secondsOfDay < end;
+    return secondsOfDay < start && secondsOfDay < end;
   }
 
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:120:20
 
   // 跨午夜窗口的星期归属开始日：例如“周一 23:00–02:00”包含周二 01:00。
   // 结束日凌晨段要用前一天判断，避免要求管理员同时勾选周二而产生歧义。
-  const startDay = secondsOfDay >= start
+  const startDay = true
     ? dayOfWeek
     : dayOfWeek === 1
killedBy: matchesTimeWindow 时段判定 跨午夜窗口的星期归属开始日
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:120:20
 
   // 跨午夜窗口的星期归属开始日：例如“周一 23:00–02:00”包含周二 01:00。
   // 结束日凌晨段要用前一天判断，避免要求管理员同时勾选周二而产生歧义。
-  const startDay = secondsOfDay >= start
+  const startDay = secondsOfDay < start
     ? dayOfWeek
     : dayOfWeek === 1
killedBy: matchesTimeWindow 时段判定 跨午夜窗口的星期归属开始日
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:122:7
   // 结束日凌晨段要用前一天判断，避免要求管理员同时勾选周二而产生歧义。
   const startDay = secondsOfDay >= start
     ? dayOfWeek
-    : dayOfWeek === 1
+    : true
       ? 7
       : dayOfWeek - 1;
killedBy: matchesTimeWindow 时段判定 跨午夜窗口的星期归属开始日
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:122:7
   // 结束日凌晨段要用前一天判断，避免要求管理员同时勾选周二而产生歧义。
   const startDay = secondsOfDay >= start
     ? dayOfWeek
-    : dayOfWeek === 1
+    : dayOfWeek !== 1
       ? 7
       : dayOfWeek - 1;
killedBy: matchesTimeWindow 时段判定 跨午夜窗口的星期归属开始日
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/billing-rule.ts:124:9
     ? dayOfWeek
     : dayOfWeek === 1
       ? 7
-      : dayOfWeek - 1;
+      : dayOfWeek + 1;
   if (window.daysOfWeek && !window.daysOfWeek.includes(startDay)) return false;
   return secondsOfDay >= start || secondsOfDay < end;
killedBy: matchesTimeWindow 时段判定 跨午夜窗口的星期归属开始日
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:125:7
     : dayOfWeek === 1
       ? 7
       : dayOfWeek - 1;
-  if (window.daysOfWeek && !window.daysOfWeek.includes(startDay)) return false;
+  if (true) return false;
   return secondsOfDay >= start || secondsOfDay < end;
 }
killedBy: matchesTimeWindow 时段判定 跨午夜时段（22:00–02:00）
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/billing-rule.ts:125:74
     : dayOfWeek === 1
       ? 7
       : dayOfWeek - 1;
-  if (window.daysOfWeek && !window.daysOfWeek.includes(startDay)) return false;
+  if (window.daysOfWeek && !window.daysOfWeek.includes(startDay)) return true;
   return secondsOfDay >= start || secondsOfDay < end;
 }
killedBy: matchesTimeWindow 时段判定 跨午夜窗口的星期归属开始日
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:126:10
       ? 7
       : dayOfWeek - 1;
   if (window.daysOfWeek && !window.daysOfWeek.includes(startDay)) return false;
-  return secondsOfDay >= start || secondsOfDay < end;
+  return secondsOfDay >= start && secondsOfDay < end;
 }
 
killedBy: matchesTimeWindow 时段判定 跨午夜时段（22:00–02:00）
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:126:35
       ? 7
       : dayOfWeek - 1;
   if (window.daysOfWeek && !window.daysOfWeek.includes(startDay)) return false;
-  return secondsOfDay >= start || secondsOfDay < end;
+  return secondsOfDay >= start || secondsOfDay <= end;
 }
 
killedBy: matchesTimeWindow 时段判定 跨午夜边界：恰好 22:00 命中、21:59 不命中、02:00 不命中
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:136:29
 export function findMatchedTimeWindow(
   rule: BillingRule,
   epochMs: number,
-): BillingRuleWindow | null {
-  return configuredTimeWindows(rule).find((window) => matchesWindow(window, epochMs)) ?? null;
-}
+): BillingRuleWindow | null {}
 
 /** 时段规则是否命中（任一窗口；边界 [start,end)，支持跨午夜）。 */
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] ArrowFunction
src/billing-rule.ts:137:43
   rule: BillingRule,
   epochMs: number,
 ): BillingRuleWindow | null {
-  return configuredTimeWindows(rule).find((window) => matchesWindow(window, epochMs)) ?? null;
+  return configuredTimeWindows(rule).find(() => undefined) ?? null;
 }
 
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:137:10
   rule: BillingRule,
   epochMs: number,
 ): BillingRuleWindow | null {
-  return configuredTimeWindows(rule).find((window) => matchesWindow(window, epochMs)) ?? null;
+  return configuredTimeWindows(rule).find(window => matchesWindow(window, epochMs)) && null;
 }
 
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] BlockStatement
src/billing-rule.ts:141:80
 }
 
 /** 时段规则是否命中（任一窗口；边界 [start,end)，支持跨午夜）。 */
-export function matchesTimeWindow(rule: BillingRule, epochMs: number): boolean {
-  return findMatchedTimeWindow(rule, epochMs) !== null;
-}
+export function matchesTimeWindow(rule: BillingRule, epochMs: number): boolean {}
 
 function scopeSpecificity(rule: BillingRule): number {
killedBy: matchesTimeWindow 时段判定 高峰内命中，高峰外不命中
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:142:10
 
 /** 时段规则是否命中（任一窗口；边界 [start,end)，支持跨午夜）。 */
 export function matchesTimeWindow(rule: BillingRule, epochMs: number): boolean {
-  return findMatchedTimeWindow(rule, epochMs) !== null;
+  return findMatchedTimeWindow(rule, epochMs) === null;
 }
 
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] ConditionalExpression
src/billing-rule.ts:142:10
 
 /** 时段规则是否命中（任一窗口；边界 [start,end)，支持跨午夜）。 */
 export function matchesTimeWindow(rule: BillingRule, epochMs: number): boolean {
-  return findMatchedTimeWindow(rule, epochMs) !== null;
+  return true;
 }
 
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] BlockStatement
src/billing-rule.ts:145:54
   return findMatchedTimeWindow(rule, epochMs) !== null;
 }
 
-function scopeSpecificity(rule: BillingRule): number {
-  return (rule.providerResourceId !== null ? 2 : 0) + (rule.upstreamModel !== null ? 1 : 0);
-}
+function scopeSpecificity(rule: BillingRule): number {}
 
 /**
killedBy: matchMultiplierRule 倍率匹配 特异性：资源专属 > 企业默认
statusReason: expected '2' to be '5' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:146:56
 }
 
 function scopeSpecificity(rule: BillingRule): number {
-  return (rule.providerResourceId !== null ? 2 : 0) + (rule.upstreamModel !== null ? 1 : 0);
+  return (rule.providerResourceId !== null ? 2 : 0) + (rule.upstreamModel === null ? 1 : 0);
 }
 
killedBy: matchMultiplierRule 倍率匹配 特异性：模型专属 + 资源&模型双专属 > 仅资源 > 企业默认
statusReason: expected 'res' to be 'both' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:146:11
 }
 
 function scopeSpecificity(rule: BillingRule): number {
-  return (rule.providerResourceId !== null ? 2 : 0) + (rule.upstreamModel !== null ? 1 : 0);
+  return (false ? 2 : 0) + (rule.upstreamModel !== null ? 1 : 0);
 }
 
killedBy: matchMultiplierRule 倍率匹配 特异性：资源专属 > 企业默认
statusReason: expected '2' to be '5' // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:155:72
  *
  * 最后以 id 兜底，保证即使管理员配置了完全重叠的同优先级规则，同一输入仍唯一命中。
  */
-function compareRulePrecedence(a: BillingRule, b: BillingRule): number {
-  if (a.priority !== b.priority) return a.priority - b.priority;
-  const scope = scopeSpecificity(b) - scopeSpecificity(a);
-  if (scope !== 0) return scope;
-  const timeWindow = Number(configuredTimeWindows(b).length > 0)
-    - Number(configuredTimeWindows(a).length > 0);
-  if (timeWindow !== 0) return timeWindow;
-  if (a.effectiveFrom !== b.effectiveFrom) return b.effectiveFrom - a.effectiveFrom;
-  return a.id.localeCompare(b.id);
-}
+function compareRulePrecedence(a: BillingRule, b: BillingRule): number {}
 
 /**
killedBy: matchMultiplierRule 倍率匹配 智谱高峰 3 倍：高峰内命中 3，高峰外命中非高峰 2
statusReason: expected '2' to be '3' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:156:7
  * 最后以 id 兜底，保证即使管理员配置了完全重叠的同优先级规则，同一输入仍唯一命中。
  */
 function compareRulePrecedence(a: BillingRule, b: BillingRule): number {
-  if (a.priority !== b.priority) return a.priority - b.priority;
+  if (true) return a.priority - b.priority;
   const scope = scopeSpecificity(b) - scopeSpecificity(a);
   if (scope !== 0) return scope;
killedBy: matchMultiplierRule 倍率匹配 特异性：资源专属 > 企业默认
statusReason: expected '2' to be '5' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:156:7
  * 最后以 id 兜底，保证即使管理员配置了完全重叠的同优先级规则，同一输入仍唯一命中。
  */
 function compareRulePrecedence(a: BillingRule, b: BillingRule): number {
-  if (a.priority !== b.priority) return a.priority - b.priority;
+  if (a.priority === b.priority) return a.priority - b.priority;
   const scope = scopeSpecificity(b) - scopeSpecificity(a);
   if (scope !== 0) return scope;
killedBy: matchMultiplierRule 倍率匹配 智谱高峰 3 倍：高峰内命中 3，高峰外命中非高峰 2
statusReason: expected '2' to be '3' // Object.is equality

[Killed] ArithmeticOperator
src/billing-rule.ts:157:17
  */
 function compareRulePrecedence(a: BillingRule, b: BillingRule): number {
   if (a.priority !== b.priority) return a.priority - b.priority;
-  const scope = scopeSpecificity(b) - scopeSpecificity(a);
+  const scope = scopeSpecificity(b) + scopeSpecificity(a);
   if (scope !== 0) return scope;
   const timeWindow = Number(configuredTimeWindows(b).length > 0)
killedBy: matchMultiplierRule 倍率匹配 特异性：资源专属 > 企业默认
statusReason: expected '2' to be '5' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:158:7
 function compareRulePrecedence(a: BillingRule, b: BillingRule): number {
   if (a.priority !== b.priority) return a.priority - b.priority;
   const scope = scopeSpecificity(b) - scopeSpecificity(a);
-  if (scope !== 0) return scope;
+  if (true) return scope;
   const timeWindow = Number(configuredTimeWindows(b).length > 0)
     - Number(configuredTimeWindows(a).length > 0);
killedBy: matchPriceRule 价格规则 完全重叠规则仍确定性命中：较新生效版本优先，最终按 id 兜底
statusReason: expected 'rule-z' to be 'rule-a' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:158:7
 function compareRulePrecedence(a: BillingRule, b: BillingRule): number {
   if (a.priority !== b.priority) return a.priority - b.priority;
   const scope = scopeSpecificity(b) - scopeSpecificity(a);
-  if (scope !== 0) return scope;
+  if (false) return scope;
   const timeWindow = Number(configuredTimeWindows(b).length > 0)
     - Number(configuredTimeWindows(a).length > 0);
killedBy: matchMultiplierRule 倍率匹配 特异性：资源专属 > 企业默认
statusReason: expected '2' to be '5' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:159:29
   if (a.priority !== b.priority) return a.priority - b.priority;
   const scope = scopeSpecificity(b) - scopeSpecificity(a);
   if (scope !== 0) return scope;
-  const timeWindow = Number(configuredTimeWindows(b).length > 0)
+  const timeWindow = Number(configuredTimeWindows(b).length >= 0)
     - Number(configuredTimeWindows(a).length > 0);
   if (timeWindow !== 0) return timeWindow;
killedBy: matchPriceRule 价格规则 完全重叠规则仍确定性命中：较新生效版本优先，最终按 id 兜底
statusReason: expected 'rule-z' to be 'rule-a' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:159:29
   if (a.priority !== b.priority) return a.priority - b.priority;
   const scope = scopeSpecificity(b) - scopeSpecificity(a);
   if (scope !== 0) return scope;
-  const timeWindow = Number(configuredTimeWindows(b).length > 0)
+  const timeWindow = Number(configuredTimeWindows(b).length <= 0)
     - Number(configuredTimeWindows(a).length > 0);
   if (timeWindow !== 0) return timeWindow;
killedBy: matchPriceRule 价格规则 完全重叠规则仍确定性命中：较新生效版本优先，最终按 id 兜底
statusReason: expected 'rule-z' to be 'rule-a' // Object.is equality
