[Survived] ConditionalExpression
src/billing-rule.ts:160:14
   const scope = scopeSpecificity(b) - scopeSpecificity(a);
   if (scope !== 0) return scope;
   const timeWindow = Number(configuredTimeWindows(b).length > 0)
-    - Number(configuredTimeWindows(a).length > 0);
+    - Number(true);
   if (timeWindow !== 0) return timeWindow;
   if (a.effectiveFrom !== b.effectiveFrom) return b.effectiveFrom - a.effectiveFrom;

[Survived] EqualityOperator
src/billing-rule.ts:160:14
   const scope = scopeSpecificity(b) - scopeSpecificity(a);
   if (scope !== 0) return scope;
   const timeWindow = Number(configuredTimeWindows(b).length > 0)
-    - Number(configuredTimeWindows(a).length > 0);
+    - Number(configuredTimeWindows(a).length <= 0);
   if (timeWindow !== 0) return timeWindow;
   if (a.effectiveFrom !== b.effectiveFrom) return b.effectiveFrom - a.effectiveFrom;

[Killed] ConditionalExpression
src/billing-rule.ts:161:7
   if (scope !== 0) return scope;
   const timeWindow = Number(configuredTimeWindows(b).length > 0)
     - Number(configuredTimeWindows(a).length > 0);
-  if (timeWindow !== 0) return timeWindow;
+  if (true) return timeWindow;
   if (a.effectiveFrom !== b.effectiveFrom) return b.effectiveFrom - a.effectiveFrom;
   return a.id.localeCompare(b.id);
killedBy: matchPriceRule 价格规则 完全重叠规则仍确定性命中：较新生效版本优先，最终按 id 兜底
statusReason: expected 'rule-z' to be 'rule-a' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:161:7
   if (scope !== 0) return scope;
   const timeWindow = Number(configuredTimeWindows(b).length > 0)
     - Number(configuredTimeWindows(a).length > 0);
-  if (timeWindow !== 0) return timeWindow;
+  if (timeWindow === 0) return timeWindow;
   if (a.effectiveFrom !== b.effectiveFrom) return b.effectiveFrom - a.effectiveFrom;
   return a.id.localeCompare(b.id);
killedBy: matchPriceRule 价格规则 完全重叠规则仍确定性命中：较新生效版本优先，最终按 id 兜底
statusReason: expected 'rule-z' to be 'rule-a' // Object.is equality

[Killed] ArithmeticOperator
src/billing-rule.ts:162:51
   const timeWindow = Number(configuredTimeWindows(b).length > 0)
     - Number(configuredTimeWindows(a).length > 0);
   if (timeWindow !== 0) return timeWindow;
-  if (a.effectiveFrom !== b.effectiveFrom) return b.effectiveFrom - a.effectiveFrom;
+  if (a.effectiveFrom !== b.effectiveFrom) return b.effectiveFrom + a.effectiveFrom;
   return a.id.localeCompare(b.id);
 }
killedBy: matchPriceRule 价格规则 完全重叠规则仍确定性命中：较新生效版本优先，最终按 id 兜底
statusReason: expected 'rule-z' to be 'rule-a' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:162:7
   const timeWindow = Number(configuredTimeWindows(b).length > 0)
     - Number(configuredTimeWindows(a).length > 0);
   if (timeWindow !== 0) return timeWindow;
-  if (a.effectiveFrom !== b.effectiveFrom) return b.effectiveFrom - a.effectiveFrom;
+  if (true) return b.effectiveFrom - a.effectiveFrom;
   return a.id.localeCompare(b.id);
 }
killedBy: matchPriceRule 价格规则 完全重叠规则仍确定性命中：较新生效版本优先，最终按 id 兜底
statusReason: expected 'rule-b' to be 'rule-a' // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:176:21
   resourceId: string,
   upstreamModel: string,
   attemptStartedAt: number,
-): RuleMatch | null {
-  const candidates = rules
-    .filter((r) => {
-      if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
-      return true; // MODEL_TIER 只按模型匹配
-    })
-    .sort(compareRulePrecedence);
-  const hit = candidates[0];
-  if (!hit || hit.multiplier === null) return null;
-  return {
-    ruleId: hit.id,
-    ruleVersion: hit.ruleVersion,
-    multiplier: hit.multiplier,
-    rule: hit,
-    matchedWindow: hit.ruleType === "TIME_WINDOW"
-      ? findMatchedTimeWindow(hit, attemptStartedAt)
-      : null,
-  };
-}
+): RuleMatch | null {}
 
 // ===== 计算 =====
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] MethodExpression
src/billing-rule.ts:177:22
   upstreamModel: string,
   attemptStartedAt: number,
 ): RuleMatch | null {
-  const candidates = rules
-    .filter((r) => {
-      if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
-      return true; // MODEL_TIER 只按模型匹配
-    })
+  const candidates = rules
     .sort(compareRulePrecedence);
   const hit = candidates[0];
killedBy: matchMultiplierRule 倍率匹配 智谱高峰 3 倍：高峰内命中 3，高峰外命中非高峰 2
statusReason: expected '3' to be '2' // Object.is equality

[Killed] MethodExpression
src/billing-rule.ts:177:22
   upstreamModel: string,
   attemptStartedAt: number,
 ): RuleMatch | null {
-  const candidates = rules
-    .filter((r) => {
-      if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
-      return true; // MODEL_TIER 只按模型匹配
-    })
-    .sort(compareRulePrecedence);
+  const candidates = rules.filter(r => {
+  if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
+  if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
+  if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
+  if (attemptStartedAt < r.effectiveFrom) return false;
+  if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
+  if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
+  return true; // MODEL_TIER 只按模型匹配
+});
   const hit = candidates[0];
   if (!hit || hit.multiplier === null) return null;
killedBy: matchMultiplierRule 倍率匹配 智谱高峰 3 倍：高峰内命中 3，高峰外命中非高峰 2
statusReason: expected '2' to be '3' // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:178:20
   attemptStartedAt: number,
 ): RuleMatch | null {
   const candidates = rules
-    .filter((r) => {
-      if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
-      return true; // MODEL_TIER 只按模型匹配
-    })
+    .filter((r) => {})
     .sort(compareRulePrecedence);
   const hit = candidates[0];
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:179:11
 ): RuleMatch | null {
   const candidates = rules
     .filter((r) => {
-      if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
+      if (r.ruleType === "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
killedBy: matchMultiplierRule 倍率匹配 智谱高峰 3 倍：高峰内命中 3，高峰外命中非高峰 2
statusReason: Cannot read properties of null (reading 'multiplier')

[Killed] EqualityOperator
src/billing-rule.ts:179:43
 ): RuleMatch | null {
   const candidates = rules
     .filter((r) => {
-      if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
+      if (r.ruleType !== "TIME_WINDOW" && r.ruleType === "MODEL_TIER") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:180:11
   const candidates = rules
     .filter((r) => {
       if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
+      if (false) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
killedBy: matchMultiplierRule 倍率匹配 特异性：资源专属 > 企业默认
statusReason: expected '5' to be '2' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:180:44
   const candidates = rules
     .filter((r) => {
       if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
+      if (r.providerResourceId !== null && r.providerResourceId === resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:181:11
     .filter((r) => {
       if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
+      if (r.upstreamModel === null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
killedBy: matchMultiplierRule 倍率匹配 智谱高峰 3 倍：高峰内命中 3，高峰外命中非高峰 2
statusReason: Cannot read properties of null (reading 'multiplier')

[Killed] EqualityOperator
src/billing-rule.ts:181:39
     .filter((r) => {
       if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
+      if (r.upstreamModel !== null && r.upstreamModel === upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:182:11
       if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
+      if (false) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
       if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
killedBy: matchMultiplierRule 倍率匹配 生效区间：历史 attempt 匹配旧版本，不被新规则改写
statusReason: expected 'v2' to be 'v1' // Object.is equality

[Killed] BooleanLiteral
src/billing-rule.ts:182:54
       if (r.ruleType !== "TIME_WINDOW" && r.ruleType !== "MODEL_TIER") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
+      if (attemptStartedAt < r.effectiveFrom) return true;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
       if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
killedBy: matchMultiplierRule 倍率匹配 生效区间：历史 attempt 匹配旧版本，不被新规则改写
statusReason: expected 'v2' to be 'v1' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:183:37
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
+      if (r.effectiveTo !== null && true) return false;
       if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
       return true; // MODEL_TIER 只按模型匹配
killedBy: matchMultiplierRule 倍率匹配 生效区间：历史 attempt 匹配旧版本，不被新规则改写
statusReason: Cannot read properties of null (reading 'ruleVersion')

[Killed] LogicalOperator
src/billing-rule.ts:183:11
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
+      if (r.effectiveTo !== null || attemptStartedAt >= r.effectiveTo) return false;
       if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
       return true; // MODEL_TIER 只按模型匹配
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:184:11
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
+      if (r.ruleType !== "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
       return true; // MODEL_TIER 只按模型匹配
     })
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:184:11
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
+      if (false) return matchesTimeWindow(r, attemptStartedAt);
       return true; // MODEL_TIER 只按模型匹配
     })
killedBy: matchMultiplierRule 倍率匹配 智谱高峰 3 倍：高峰内命中 3，高峰外命中非高峰 2
statusReason: expected '3' to be '2' // Object.is equality

[Killed] BooleanLiteral
src/billing-rule.ts:185:14
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
       if (r.ruleType === "TIME_WINDOW") return matchesTimeWindow(r, attemptStartedAt);
-      return true; // MODEL_TIER 只按模型匹配
+      return false; // MODEL_TIER 只按模型匹配
     })
     .sort(compareRulePrecedence);
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] BooleanLiteral
src/billing-rule.ts:189:7
     })
     .sort(compareRulePrecedence);
   const hit = candidates[0];
-  if (!hit || hit.multiplier === null) return null;
+  if (hit || hit.multiplier === null) return null;
   return {
     ruleId: hit.id,
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: Cannot read properties of undefined (reading 'multiplier')

[Killed] EqualityOperator
src/billing-rule.ts:189:15
     })
     .sort(compareRulePrecedence);
   const hit = candidates[0];
-  if (!hit || hit.multiplier === null) return null;
+  if (!hit || hit.multiplier !== null) return null;
   return {
     ruleId: hit.id,
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Survived] ConditionalExpression
src/billing-rule.ts:195:20
     ruleVersion: hit.ruleVersion,
     multiplier: hit.multiplier,
     rule: hit,
-    matchedWindow: hit.ruleType === "TIME_WINDOW"
+    matchedWindow: true
       ? findMatchedTimeWindow(hit, attemptStartedAt)
       : null,

[Survived] EqualityOperator
src/billing-rule.ts:195:20
     ruleVersion: hit.ruleVersion,
     multiplier: hit.multiplier,
     rule: hit,
-    matchedWindow: hit.ruleType === "TIME_WINDOW"
+    matchedWindow: hit.ruleType !== "TIME_WINDOW"
       ? findMatchedTimeWindow(hit, attemptStartedAt)
       : null,

[Killed] BlockStatement
src/billing-rule.ts:204:84
 // ===== 计算 =====
 
 /** 套餐扣减：raw_usage × multiplier（decimal 精度，整数 token）。 */
-export function computeDeductedQuota(rawUsage: number, multiplier: string): string {
-  return new Decimal(rawUsage).times(new Decimal(multiplier)).toFixed(0);
-}
+export function computeDeductedQuota(rawUsage: number, multiplier: string): string {}
 
 /**
killedBy: computeDeductedQuota 套餐扣减 raw × multiplier，decimal 整数
statusReason: expected undefined to be '3000' // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:219:11
   input: number,
   output: number,
   cache: number,
-): string {
-  const hit = new Decimal(cache);
-  const miss = new Decimal(input).minus(hit);
-  const cost = hit
-    .times(new Decimal(rule.cacheHitPrice ?? "0"))
-    .plus(miss.times(new Decimal(rule.cacheMissPrice ?? "0")))
-    .plus(new Decimal(output).times(new Decimal(rule.outputPrice ?? "0")));
-  return cost.toFixed(8);
-}
+): string {}
 
 /** 匹配套餐/API 价格规则（API_PRICE 类型，按生效版本）。 */
killedBy: computeApiCostFromRule API 计价（TRD §10.1） cache 命中/未命中/输出分项 × 单价
statusReason: expected undefined to be '0.00180000' // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:223:24
   const hit = new Decimal(cache);
   const miss = new Decimal(input).minus(hit);
   const cost = hit
-    .times(new Decimal(rule.cacheHitPrice ?? "0"))
+    .times(new Decimal(rule.cacheHitPrice && "0"))
     .plus(miss.times(new Decimal(rule.cacheMissPrice ?? "0")))
     .plus(new Decimal(output).times(new Decimal(rule.outputPrice ?? "0")));
killedBy: computeApiCostFromRule API 计价（TRD §10.1） cache 命中/未命中/输出分项 × 单价
statusReason: expected '0.00160000' to be '0.00180000' // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:224:34
   const miss = new Decimal(input).minus(hit);
   const cost = hit
     .times(new Decimal(rule.cacheHitPrice ?? "0"))
-    .plus(miss.times(new Decimal(rule.cacheMissPrice ?? "0")))
+    .plus(miss.times(new Decimal(rule.cacheMissPrice && "0")))
     .plus(new Decimal(output).times(new Decimal(rule.outputPrice ?? "0")));
   return cost.toFixed(8);
killedBy: computeApiCostFromRule API 计价（TRD §10.1） cache 命中/未命中/输出分项 × 单价
statusReason: expected '0.00120000' to be '0.00180000' // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:225:49
   const cost = hit
     .times(new Decimal(rule.cacheHitPrice ?? "0"))
     .plus(miss.times(new Decimal(rule.cacheMissPrice ?? "0")))
-    .plus(new Decimal(output).times(new Decimal(rule.outputPrice ?? "0")));
+    .plus(new Decimal(output).times(new Decimal(rule.outputPrice && "0")));
   return cost.toFixed(8);
 }
killedBy: computeApiCostFromRule API 计价（TRD §10.1） cache 命中/未命中/输出分项 × 单价
statusReason: expected '0.00080000' to be '0.00180000' // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:235:23
   resourceId: string,
   upstreamModel: string,
   attemptStartedAt: number,
-): BillingRule | null {
-  const candidates = rules
-    .filter((r) => {
-      if (r.ruleType !== "API_PRICE") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      const hasWindow = configuredTimeWindows(r).length > 0;
-      if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
-      return true;
-    })
-    .sort(compareRulePrecedence);
-  return candidates[0] ?? null;
-}
+): BillingRule | null {}
 
 export type BillingResourceMode = "API" | "CODING_PLAN";
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be null

[Killed] MethodExpression
src/billing-rule.ts:236:22
   upstreamModel: string,
   attemptStartedAt: number,
 ): BillingRule | null {
-  const candidates = rules
-    .filter((r) => {
-      if (r.ruleType !== "API_PRICE") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      const hasWindow = configuredTimeWindows(r).length > 0;
-      if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
-      return true;
-    })
+  const candidates = rules
     .sort(compareRulePrecedence);
   return candidates[0] ?? null;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] MethodExpression
src/billing-rule.ts:236:22
   upstreamModel: string,
   attemptStartedAt: number,
 ): BillingRule | null {
-  const candidates = rules
-    .filter((r) => {
-      if (r.ruleType !== "API_PRICE") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      const hasWindow = configuredTimeWindows(r).length > 0;
-      if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
-      return true;
-    })
-    .sort(compareRulePrecedence);
+  const candidates = rules.filter(r => {
+  if (r.ruleType !== "API_PRICE") return false;
+  if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
+  if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
+  if (attemptStartedAt < r.effectiveFrom) return false;
+  if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
+  const hasWindow = configuredTimeWindows(r).length > 0;
+  if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
+  return true;
+});
   return candidates[0] ?? null;
 }
killedBy: matchPriceRule 价格规则 特异性排序：资源专属 + 模型专属 > 仅资源专属 > 企业默认
statusReason: expected 'p-default' to be 'p-res-model' // Object.is equality

[Killed] BlockStatement
src/billing-rule.ts:237:20
   attemptStartedAt: number,
 ): BillingRule | null {
   const candidates = rules
-    .filter((r) => {
-      if (r.ruleType !== "API_PRICE") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      const hasWindow = configuredTimeWindows(r).length > 0;
-      if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
-      return true;
-    })
+    .filter((r) => {})
     .sort(compareRulePrecedence);
   return candidates[0] ?? null;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:238:11
 ): BillingRule | null {
   const candidates = rules
     .filter((r) => {
-      if (r.ruleType !== "API_PRICE") return false;
+      if (r.ruleType === "API_PRICE") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:238:11
 ): BillingRule | null {
   const candidates = rules
     .filter((r) => {
-      if (r.ruleType !== "API_PRICE") return false;
+      if (true) return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:239:11
   const candidates = rules
     .filter((r) => {
       if (r.ruleType !== "API_PRICE") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
+      if (r.providerResourceId !== null || r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:239:44
   const candidates = rules
     .filter((r) => {
       if (r.ruleType !== "API_PRICE") return false;
-      if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
+      if (r.providerResourceId !== null && r.providerResourceId === resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'api-valid', …(17) } to be null

[Killed] ConditionalExpression
src/billing-rule.ts:240:11
     .filter((r) => {
       if (r.ruleType !== "API_PRICE") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
+      if (false) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
killedBy: matchPriceRule 价格规则 模型专属规则：upstreamModel 不匹配 → 不命中
statusReason: expected { id: 'p-model', …(17) } to be null

[Killed] BooleanLiteral
src/billing-rule.ts:240:81
     .filter((r) => {
       if (r.ruleType !== "API_PRICE") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
-      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
+      if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return true;
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
killedBy: matchPriceRule 价格规则 模型专属规则：upstreamModel 不匹配 → 不命中
statusReason: expected { id: 'p-model', …(17) } to be null

[Killed] EqualityOperator
src/billing-rule.ts:241:11
       if (r.ruleType !== "API_PRICE") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
+      if (attemptStartedAt >= r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
       const hasWindow = configuredTimeWindows(r).length > 0;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality
