[Killed] EqualityOperator
src/billing-rule.ts:241:11
       if (r.ruleType !== "API_PRICE") return false;
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
-      if (attemptStartedAt < r.effectiveFrom) return false;
+      if (attemptStartedAt <= r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
       const hasWindow = configuredTimeWindows(r).length > 0;
killedBy: matchPriceRule 价格规则 effectiveFrom 边界：恰好等于 effectiveFrom → 命中（< 才排除）
statusReason: Cannot read properties of null (reading 'id')

[Killed] BooleanLiteral
src/billing-rule.ts:242:79
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
+      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return true;
       const hasWindow = configuredTimeWindows(r).length > 0;
       if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
killedBy: matchPriceRule 价格规则 effectiveTo 过滤：attemptStartedAt >= effectiveTo → 不命中
statusReason: expected { id: 'p-to', …(17) } to be null

[Killed] EqualityOperator
src/billing-rule.ts:242:11
       if (r.providerResourceId !== null && r.providerResourceId !== resourceId) return false;
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
-      if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
+      if (r.effectiveTo === null && attemptStartedAt >= r.effectiveTo) return false;
       const hasWindow = configuredTimeWindows(r).length > 0;
       if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:243:25
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      const hasWindow = configuredTimeWindows(r).length > 0;
+      const hasWindow = configuredTimeWindows(r).length <= 0;
       if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
       return true;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] EqualityOperator
src/billing-rule.ts:243:25
       if (r.upstreamModel !== null && r.upstreamModel !== upstreamModel) return false;
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
-      const hasWindow = configuredTimeWindows(r).length > 0;
+      const hasWindow = configuredTimeWindows(r).length >= 0;
       if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
       return true;
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] BooleanLiteral
src/billing-rule.ts:244:72
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
       const hasWindow = configuredTimeWindows(r).length > 0;
-      if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
+      if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return true;
       return true;
     })
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] BooleanLiteral
src/billing-rule.ts:244:24
       if (attemptStartedAt < r.effectiveFrom) return false;
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
       const hasWindow = configuredTimeWindows(r).length > 0;
-      if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
+      if (hasWindow && matchesTimeWindow(r, attemptStartedAt)) return false;
       return true;
     })
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] BooleanLiteral
src/billing-rule.ts:245:14
       if (r.effectiveTo !== null && attemptStartedAt >= r.effectiveTo) return false;
       const hasWindow = configuredTimeWindows(r).length > 0;
       if (hasWindow && !matchesTimeWindow(r, attemptStartedAt)) return false;
-      return true;
+      return false;
     })
     .sort(compareRulePrecedence);
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] LogicalOperator
src/billing-rule.ts:248:10
       return true;
     })
     .sort(compareRulePrecedence);
-  return candidates[0] ?? null;
+  return candidates[0] && null;
 }
 
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be null

[Killed] BlockStatement
src/billing-rule.ts:266:23
   upstreamModel: string,
   resourceMode: BillingResourceMode,
   at: number,
-): BillingRule | null {
-  if (resourceMode === "API") {
-    return matchPriceRule(
-      rules.filter((rule) => rule.cacheHitPrice !== null
-        || rule.cacheMissPrice !== null
-        || rule.outputPrice !== null),
-      resourceId,
-      upstreamModel,
-      at,
-    );
-  }
-  return matchMultiplierRule(
-    rules.filter((rule) => rule.multiplier !== null),
-    resourceId,
-    upstreamModel,
-    at,
-  )?.rule ?? null;
-}
+): BillingRule | null {}
 
 /** 套餐模式费用字段语义（TRD §10.2：PACKAGE_INCLUDED，不写数值 0）。 */
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be null

[Killed] BlockStatement
src/billing-rule.ts:267:31
   resourceMode: BillingResourceMode,
   at: number,
 ): BillingRule | null {
-  if (resourceMode === "API") {
-    return matchPriceRule(
-      rules.filter((rule) => rule.cacheHitPrice !== null
-        || rule.cacheMissPrice !== null
-        || rule.outputPrice !== null),
-      resourceId,
-      upstreamModel,
-      at,
-    );
-  }
+  if (resourceMode === "API") {}
   return matchMultiplierRule(
     rules.filter((rule) => rule.multiplier !== null),
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected { id: 'rule-1', …(17) } to be null

[Killed] ConditionalExpression
src/billing-rule.ts:267:7
   resourceMode: BillingResourceMode,
   at: number,
 ): BillingRule | null {
-  if (resourceMode === "API") {
+  if (true) {
     return matchPriceRule(
       rules.filter((rule) => rule.cacheHitPrice !== null
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] MethodExpression
src/billing-rule.ts:269:7
 ): BillingRule | null {
   if (resourceMode === "API") {
     return matchPriceRule(
-      rules.filter((rule) => rule.cacheHitPrice !== null
-        || rule.cacheMissPrice !== null
-        || rule.outputPrice !== null),
+      rules,
       resourceId,
       upstreamModel,
killedBy: 统一计费适用性合同 API 拒绝无价格规则，并分别接受任一 Token 单价字段
statusReason: expected { id: 'no-price', …(17) } to be null

[Killed] LogicalOperator
src/billing-rule.ts:269:30
 ): BillingRule | null {
   if (resourceMode === "API") {
     return matchPriceRule(
-      rules.filter((rule) => rule.cacheHitPrice !== null
-        || rule.cacheMissPrice !== null
-        || rule.outputPrice !== null),
+      rules.filter((rule) => (rule.cacheHitPrice !== null || rule.cacheMissPrice !== null) && rule.outputPrice !== null),
       resourceId,
       upstreamModel,
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] ConditionalExpression
src/billing-rule.ts:270:12
   if (resourceMode === "API") {
     return matchPriceRule(
       rules.filter((rule) => rule.cacheHitPrice !== null
-        || rule.cacheMissPrice !== null
+        || false
         || rule.outputPrice !== null),
       resourceId,
killedBy: 统一计费适用性合同 API 拒绝无价格规则，并分别接受任一 Token 单价字段
statusReason: expected undefined to be 'cache-miss' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:270:12
   if (resourceMode === "API") {
     return matchPriceRule(
       rules.filter((rule) => rule.cacheHitPrice !== null
-        || rule.cacheMissPrice !== null
+        || rule.cacheMissPrice === null
         || rule.outputPrice !== null),
       resourceId,
killedBy: 统一计费适用性合同 API 拒绝无价格规则，并分别接受任一 Token 单价字段
statusReason: expected { id: 'no-price', …(17) } to be null

[Killed] ConditionalExpression
src/billing-rule.ts:271:12
     return matchPriceRule(
       rules.filter((rule) => rule.cacheHitPrice !== null
         || rule.cacheMissPrice !== null
-        || rule.outputPrice !== null),
+        || false),
       resourceId,
       upstreamModel,
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:271:12
     return matchPriceRule(
       rules.filter((rule) => rule.cacheHitPrice !== null
         || rule.cacheMissPrice !== null
-        || rule.outputPrice !== null),
+        || rule.outputPrice === null),
       resourceId,
       upstreamModel,
killedBy: 统一计费适用性合同 API 只接受至少一个价格字段的当前 API_PRICE，并校验资源、型号与时间窗
statusReason: expected undefined to be 'api-valid' // Object.is equality

[Killed] OptionalChaining
src/billing-rule.ts:277:10
       at,
     );
   }
-  return matchMultiplierRule(
-    rules.filter((rule) => rule.multiplier !== null),
-    resourceId,
-    upstreamModel,
-    at,
-  )?.rule ?? null;
+  return matchMultiplierRule(rules.filter(rule => rule.multiplier !== null), resourceId, upstreamModel, at).rule ?? null;
 }
 
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: Cannot read properties of null (reading 'rule')

[Killed] LogicalOperator
src/billing-rule.ts:277:10
       at,
     );
   }
-  return matchMultiplierRule(
-    rules.filter((rule) => rule.multiplier !== null),
-    resourceId,
-    upstreamModel,
-    at,
-  )?.rule ?? null;
+  return matchMultiplierRule(rules.filter(rule => rule.multiplier !== null), resourceId, upstreamModel, at)?.rule && null;
 }
 
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/billing-rule.ts:278:28
     );
   }
   return matchMultiplierRule(
-    rules.filter((rule) => rule.multiplier !== null),
+    rules.filter((rule) => false),
     resourceId,
     upstreamModel,
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality

[Killed] EqualityOperator
src/billing-rule.ts:278:28
     );
   }
   return matchMultiplierRule(
-    rules.filter((rule) => rule.multiplier !== null),
+    rules.filter((rule) => rule.multiplier === null),
     resourceId,
     upstreamModel,
killedBy: 统一计费适用性合同 CODING_PLAN 只接受带倍率的当前 TIME_WINDOW／MODEL_TIER
statusReason: expected undefined to be 'tier-valid' // Object.is equality
