[Killed] EqualityOperator
src/dispatch-policy.ts:116:7
  * 任一匹配条件不满足即不匹配；nullable 条件 = 不限。
  */
 export function matchPolicy(policy: DispatchPolicy, input: DispatchInput): boolean {
-  if (policy.status !== "PUBLISHED") return false; // 只有 PUBLISHED 进热路径（§5.6 行 320）
+  if (policy.status === "PUBLISHED") return false; // 只有 PUBLISHED 进热路径（§5.6 行 320）
 
   // 统一模型
killedBy: matchPolicy 匹配条件 非 PUBLISHED 状态不匹配（只有 PUBLISHED 进热路径）
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:116:7
  * 任一匹配条件不满足即不匹配；nullable 条件 = 不限。
  */
 export function matchPolicy(policy: DispatchPolicy, input: DispatchInput): boolean {
-  if (policy.status !== "PUBLISHED") return false; // 只有 PUBLISHED 进热路径（§5.6 行 320）
+  if (false) return false; // 只有 PUBLISHED 进热路径（§5.6 行 320）
 
   // 统一模型
killedBy: matchPolicy 匹配条件 非 PUBLISHED 状态不匹配（只有 PUBLISHED 进热路径）
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/dispatch-policy.ts:119:100
   if (policy.status !== "PUBLISHED") return false; // 只有 PUBLISHED 进热路径（§5.6 行 320）
 
   // 统一模型
-  if (policy.matchUnifiedModel !== null && policy.matchUnifiedModel !== input.unifiedModel) return false;
+  if (policy.matchUnifiedModel !== null && policy.matchUnifiedModel !== input.unifiedModel) return true;
   // 资源模式
   if (policy.matchResourceMode !== null && policy.matchResourceMode !== input.resourceMode) return false;
killedBy: matchPolicy 匹配条件 统一模型不匹配 → false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:119:7
   if (policy.status !== "PUBLISHED") return false; // 只有 PUBLISHED 进热路径（§5.6 行 320）
 
   // 统一模型
-  if (policy.matchUnifiedModel !== null && policy.matchUnifiedModel !== input.unifiedModel) return false;
+  if (false) return false;
   // 资源模式
   if (policy.matchResourceMode !== null && policy.matchResourceMode !== input.resourceMode) return false;
killedBy: matchPolicy 匹配条件 统一模型不匹配 → false
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/dispatch-policy.ts:121:7
   // 统一模型
   if (policy.matchUnifiedModel !== null && policy.matchUnifiedModel !== input.unifiedModel) return false;
   // 资源模式
-  if (policy.matchResourceMode !== null && policy.matchResourceMode !== input.resourceMode) return false;
+  if (policy.matchResourceMode !== null || policy.matchResourceMode !== input.resourceMode) return false;
   // 指定资源
   if (policy.matchProviderResourceId !== null && policy.matchProviderResourceId !== input.selectedResourceId) return false;
killedBy: matchPolicy 匹配条件 PUBLISHED 且无条件 → 匹配（通配策略）
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:121:7
   // 统一模型
   if (policy.matchUnifiedModel !== null && policy.matchUnifiedModel !== input.unifiedModel) return false;
   // 资源模式
-  if (policy.matchResourceMode !== null && policy.matchResourceMode !== input.resourceMode) return false;
+  if (false) return false;
   // 指定资源
   if (policy.matchProviderResourceId !== null && policy.matchProviderResourceId !== input.selectedResourceId) return false;
killedBy: matchPolicy 匹配条件 资源模式不匹配 → false
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/dispatch-policy.ts:123:118
   // 资源模式
   if (policy.matchResourceMode !== null && policy.matchResourceMode !== input.resourceMode) return false;
   // 指定资源
-  if (policy.matchProviderResourceId !== null && policy.matchProviderResourceId !== input.selectedResourceId) return false;
+  if (policy.matchProviderResourceId !== null && policy.matchProviderResourceId !== input.selectedResourceId) return true;
   // 主体范围
   if (
killedBy: matchPolicy 匹配条件 指定资源不匹配 → false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:123:7
   // 资源模式
   if (policy.matchResourceMode !== null && policy.matchResourceMode !== input.resourceMode) return false;
   // 指定资源
-  if (policy.matchProviderResourceId !== null && policy.matchProviderResourceId !== input.selectedResourceId) return false;
+  if (true) return false;
   // 主体范围
   if (
killedBy: matchPolicy 匹配条件 PUBLISHED 且无条件 → 匹配（通配策略）
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/dispatch-policy.ts:126:5
   if (policy.matchProviderResourceId !== null && policy.matchProviderResourceId !== input.selectedResourceId) return false;
   // 主体范围
   if (
-    policy.matchPrincipalScope !== null &&
-    policy.matchPrincipalScope.length > 0 &&
+    policy.matchPrincipalScope !== null || policy.matchPrincipalScope.length > 0 &&
     !policy.matchPrincipalScope.includes(input.principalId)
   ) {
killedBy: matchPolicy 匹配条件 PUBLISHED 且无条件 → 匹配（通配策略）
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/dispatch-policy.ts:126:5
   if (policy.matchProviderResourceId !== null && policy.matchProviderResourceId !== input.selectedResourceId) return false;
   // 主体范围
   if (
-    policy.matchPrincipalScope !== null &&
-    policy.matchPrincipalScope.length > 0 &&
-    !policy.matchPrincipalScope.includes(input.principalId)
+    true
   ) {
     return false;
killedBy: matchPolicy 匹配条件 PUBLISHED 且无条件 → 匹配（通配策略）
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:127:5
   // 主体范围
   if (
     policy.matchPrincipalScope !== null &&
-    policy.matchPrincipalScope.length > 0 &&
+    policy.matchPrincipalScope.length >= 0 &&
     !policy.matchPrincipalScope.includes(input.principalId)
   ) {
killedBy: matchPolicy 匹配条件 主体范围不匹配 → false（null/空=任意）
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:127:5
   // 主体范围
   if (
     policy.matchPrincipalScope !== null &&
-    policy.matchPrincipalScope.length > 0 &&
+    true &&
     !policy.matchPrincipalScope.includes(input.principalId)
   ) {
killedBy: matchPolicy 匹配条件 主体范围不匹配 → false（null/空=任意）
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/dispatch-policy.ts:128:5
   if (
     policy.matchPrincipalScope !== null &&
     policy.matchPrincipalScope.length > 0 &&
-    !policy.matchPrincipalScope.includes(input.principalId)
+    policy.matchPrincipalScope.includes(input.principalId)
   ) {
     return false;
killedBy: matchPolicy 匹配条件 主体范围不匹配 → false（null/空=任意）
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/dispatch-policy.ts:129:5
     policy.matchPrincipalScope !== null &&
     policy.matchPrincipalScope.length > 0 &&
     !policy.matchPrincipalScope.includes(input.principalId)
-  ) {
-    return false;
-  }
+  ) {}
   // 时间窗（星期 + 起止时间，复用 W13 时区逻辑）
   if (policy.matchTimezone && policy.matchStartTime && policy.matchEndTime) {
killedBy: matchPolicy 匹配条件 主体范围不匹配 → false（null/空=任意）
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:133:7
     return false;
   }
   // 时间窗（星期 + 起止时间，复用 W13 时区逻辑）
-  if (policy.matchTimezone && policy.matchStartTime && policy.matchEndTime) {
+  if (false) {
     if (!matchTimeWindowInternal(policy, input.now)) return false;
   }
killedBy: matchPolicy 匹配条件 时间窗：高峰 14:00-18:00（Asia/Shanghai）命中（WT-16 峰谷）
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:133:7
     return false;
   }
   // 时间窗（星期 + 起止时间，复用 W13 时区逻辑）
-  if (policy.matchTimezone && policy.matchStartTime && policy.matchEndTime) {
+  if (true) {
     if (!matchTimeWindowInternal(policy, input.now)) return false;
   }
killedBy: matchPolicy 匹配条件 PUBLISHED 且无条件 → 匹配（通配策略）
statusReason: Invalid time zone specified: null

[Killed] BooleanLiteral
src/dispatch-policy.ts:134:61
   }
   // 时间窗（星期 + 起止时间，复用 W13 时区逻辑）
   if (policy.matchTimezone && policy.matchStartTime && policy.matchEndTime) {
-    if (!matchTimeWindowInternal(policy, input.now)) return false;
+    if (!matchTimeWindowInternal(policy, input.now)) return true;
   }
   // 价格倍率下限（≥）
killedBy: matchPolicy 匹配条件 时间窗：高峰 14:00-18:00（Asia/Shanghai）命中（WT-16 峰谷）
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/dispatch-policy.ts:134:9
   }
   // 时间窗（星期 + 起止时间，复用 W13 时区逻辑）
   if (policy.matchTimezone && policy.matchStartTime && policy.matchEndTime) {
-    if (!matchTimeWindowInternal(policy, input.now)) return false;
+    if (matchTimeWindowInternal(policy, input.now)) return false;
   }
   // 价格倍率下限（≥）
killedBy: matchPolicy 匹配条件 时间窗：高峰 14:00-18:00（Asia/Shanghai）命中（WT-16 峰谷）
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:137:7
     if (!matchTimeWindowInternal(policy, input.now)) return false;
   }
   // 价格倍率下限（≥）
-  if (policy.matchPriceMultiplierMin !== null) {
+  if (false) {
     if (compareDecimal(input.priceMultiplier, policy.matchPriceMultiplierMin) < 0) return false;
   }
killedBy: matchPolicy 匹配条件 价格倍率下限（≥）：高峰 ×3 命中
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:137:7
     if (!matchTimeWindowInternal(policy, input.now)) return false;
   }
   // 价格倍率下限（≥）
-  if (policy.matchPriceMultiplierMin !== null) {
+  if (policy.matchPriceMultiplierMin === null) {
     if (compareDecimal(input.priceMultiplier, policy.matchPriceMultiplierMin) < 0) return false;
   }
killedBy: matchPolicy 匹配条件 价格倍率下限（≥）：高峰 ×3 命中
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:138:9
   }
   // 价格倍率下限（≥）
   if (policy.matchPriceMultiplierMin !== null) {
-    if (compareDecimal(input.priceMultiplier, policy.matchPriceMultiplierMin) < 0) return false;
+    if (compareDecimal(input.priceMultiplier, policy.matchPriceMultiplierMin) <= 0) return false;
   }
   // 剩余额度比例上限（≤）
killedBy: matchPolicy 匹配条件 价格倍率下限（≥）：高峰 ×3 命中
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:138:9
   }
   // 价格倍率下限（≥）
   if (policy.matchPriceMultiplierMin !== null) {
-    if (compareDecimal(input.priceMultiplier, policy.matchPriceMultiplierMin) < 0) return false;
+    if (false) return false;
   }
   // 剩余额度比例上限（≤）
killedBy: matchPolicy 匹配条件 价格倍率下限（≥）：高峰 ×3 命中
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:141:7
     if (compareDecimal(input.priceMultiplier, policy.matchPriceMultiplierMin) < 0) return false;
   }
   // 剩余额度比例上限（≤）
-  if (policy.matchRemainingQuotaRatioMax !== null) {
+  if (policy.matchRemainingQuotaRatioMax === null) {
     if (input.remainingQuotaRatio === null) return false; // 未知额度不命中耗尽风险类策略（不伪精确）
     if (input.remainingQuotaRatio > Number(policy.matchRemainingQuotaRatioMax)) return false;
killedBy: matchPolicy 匹配条件 PUBLISHED 且无条件 → 匹配（通配策略）
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:141:7
     if (compareDecimal(input.priceMultiplier, policy.matchPriceMultiplierMin) < 0) return false;
   }
   // 剩余额度比例上限（≤）
-  if (policy.matchRemainingQuotaRatioMax !== null) {
+  if (false) {
     if (input.remainingQuotaRatio === null) return false; // 未知额度不命中耗尽风险类策略（不伪精确）
     if (input.remainingQuotaRatio > Number(policy.matchRemainingQuotaRatioMax)) return false;
killedBy: matchPolicy 匹配条件 剩余额度比例上限（≤）：耗尽风险（WT-16 额度策略）
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:142:9
   }
   // 剩余额度比例上限（≤）
   if (policy.matchRemainingQuotaRatioMax !== null) {
-    if (input.remainingQuotaRatio === null) return false; // 未知额度不命中耗尽风险类策略（不伪精确）
+    if (true) return false; // 未知额度不命中耗尽风险类策略（不伪精确）
     if (input.remainingQuotaRatio > Number(policy.matchRemainingQuotaRatioMax)) return false;
   }
killedBy: matchPolicy 匹配条件 剩余额度比例上限（≤）：耗尽风险（WT-16 额度策略）
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:142:9
   }
   // 剩余额度比例上限（≤）
   if (policy.matchRemainingQuotaRatioMax !== null) {
-    if (input.remainingQuotaRatio === null) return false; // 未知额度不命中耗尽风险类策略（不伪精确）
+    if (input.remainingQuotaRatio !== null) return false; // 未知额度不命中耗尽风险类策略（不伪精确）
     if (input.remainingQuotaRatio > Number(policy.matchRemainingQuotaRatioMax)) return false;
   }
killedBy: matchPolicy 匹配条件 剩余额度比例上限（≤）：耗尽风险（WT-16 额度策略）
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:143:9
   // 剩余额度比例上限（≤）
   if (policy.matchRemainingQuotaRatioMax !== null) {
     if (input.remainingQuotaRatio === null) return false; // 未知额度不命中耗尽风险类策略（不伪精确）
-    if (input.remainingQuotaRatio > Number(policy.matchRemainingQuotaRatioMax)) return false;
+    if (false) return false;
   }
   // 预计耗尽风险（仅当 input 标记有风险时匹配）
killedBy: matchPolicy 匹配条件 剩余额度比例上限（≤）：耗尽风险（WT-16 额度策略）
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:143:9
   // 剩余额度比例上限（≤）
   if (policy.matchRemainingQuotaRatioMax !== null) {
     if (input.remainingQuotaRatio === null) return false; // 未知额度不命中耗尽风险类策略（不伪精确）
-    if (input.remainingQuotaRatio > Number(policy.matchRemainingQuotaRatioMax)) return false;
+    if (true) return false;
   }
   // 预计耗尽风险（仅当 input 标记有风险时匹配）
killedBy: matchPolicy 匹配条件 剩余额度比例上限（≤）：耗尽风险（WT-16 额度策略）
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/dispatch-policy.ts:146:51
     if (input.remainingQuotaRatio > Number(policy.matchRemainingQuotaRatioMax)) return false;
   }
   // 预计耗尽风险（仅当 input 标记有风险时匹配）
-  if (policy.matchForecastExhaustRisk === true && !input.forecastExhaustRisk) return false;
+  if (policy.matchForecastExhaustRisk === true && input.forecastExhaustRisk) return false;
 
   return true;
killedBy: matchPolicy 匹配条件 预计耗尽风险：仅当 input 标记有风险时匹配
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/dispatch-policy.ts:146:86
     if (input.remainingQuotaRatio > Number(policy.matchRemainingQuotaRatioMax)) return false;
   }
   // 预计耗尽风险（仅当 input 标记有风险时匹配）
-  if (policy.matchForecastExhaustRisk === true && !input.forecastExhaustRisk) return false;
+  if (policy.matchForecastExhaustRisk === true && !input.forecastExhaustRisk) return true;
 
   return true;
killedBy: matchPolicy 匹配条件 预计耗尽风险：仅当 input 标记有风险时匹配
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/dispatch-policy.ts:152:84
 }
 
 /** 时间窗匹配（内部复用 billing-rule.toZonedTime，支持跨午夜）。 */
-function matchTimeWindowInternal(policy: DispatchPolicy, epochMs: number): boolean {
-  const { dayOfWeek, secondsOfDay } = toZonedTime(epochMs, policy.matchTimezone!);
-  if (policy.matchDaysOfWeek && policy.matchDaysOfWeek.length > 0 && !policy.matchDaysOfWeek.includes(dayOfWeek)) {
-    return false;
-  }
-  const start = parseTimeSeconds(policy.matchStartTime!);
-  const end = parseTimeSeconds(policy.matchEndTime!);
-  if (start < end) return secondsOfDay >= start && secondsOfDay < end;
-  return secondsOfDay >= start || secondsOfDay < end; // 跨午夜
-}
+function matchTimeWindowInternal(policy: DispatchPolicy, epochMs: number): boolean {}
 
 function parseTimeSeconds(s: string): number {
killedBy: matchPolicy 匹配条件 时间窗：高峰 14:00-18:00（Asia/Shanghai）命中（WT-16 峰谷）
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/dispatch-policy.ts:154:7
 /** 时间窗匹配（内部复用 billing-rule.toZonedTime，支持跨午夜）。 */
 function matchTimeWindowInternal(policy: DispatchPolicy, epochMs: number): boolean {
   const { dayOfWeek, secondsOfDay } = toZonedTime(epochMs, policy.matchTimezone!);
-  if (policy.matchDaysOfWeek && policy.matchDaysOfWeek.length > 0 && !policy.matchDaysOfWeek.includes(dayOfWeek)) {
+  if (policy.matchDaysOfWeek || policy.matchDaysOfWeek.length > 0 && !policy.matchDaysOfWeek.includes(dayOfWeek)) {
     return false;
   }
killedBy: matchPolicy 匹配条件 时间窗：高峰 14:00-18:00（Asia/Shanghai）命中（WT-16 峰谷）
statusReason: Cannot read properties of null (reading 'length')

[Killed] ConditionalExpression
src/dispatch-policy.ts:154:7
 /** 时间窗匹配（内部复用 billing-rule.toZonedTime，支持跨午夜）。 */
 function matchTimeWindowInternal(policy: DispatchPolicy, epochMs: number): boolean {
   const { dayOfWeek, secondsOfDay } = toZonedTime(epochMs, policy.matchTimezone!);
-  if (policy.matchDaysOfWeek && policy.matchDaysOfWeek.length > 0 && !policy.matchDaysOfWeek.includes(dayOfWeek)) {
+  if (false) {
     return false;
   }
killedBy: matchPolicy 匹配条件 时间窗：星期限定（仅周一）
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/dispatch-policy.ts:155:12
 function matchTimeWindowInternal(policy: DispatchPolicy, epochMs: number): boolean {
   const { dayOfWeek, secondsOfDay } = toZonedTime(epochMs, policy.matchTimezone!);
   if (policy.matchDaysOfWeek && policy.matchDaysOfWeek.length > 0 && !policy.matchDaysOfWeek.includes(dayOfWeek)) {
-    return false;
+    return true;
   }
   const start = parseTimeSeconds(policy.matchStartTime!);
killedBy: matchPolicy 匹配条件 时间窗：星期限定（仅周一）
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:159:52
   }
   const start = parseTimeSeconds(policy.matchStartTime!);
   const end = parseTimeSeconds(policy.matchEndTime!);
-  if (start < end) return secondsOfDay >= start && secondsOfDay < end;
+  if (start < end) return secondsOfDay >= start && secondsOfDay >= end;
   return secondsOfDay >= start || secondsOfDay < end; // 跨午夜
 }
killedBy: matchPolicy 匹配条件 时间窗：高峰 14:00-18:00（Asia/Shanghai）命中（WT-16 峰谷）
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:159:7
   }
   const start = parseTimeSeconds(policy.matchStartTime!);
   const end = parseTimeSeconds(policy.matchEndTime!);
-  if (start < end) return secondsOfDay >= start && secondsOfDay < end;
+  if (false) return secondsOfDay >= start && secondsOfDay < end;
   return secondsOfDay >= start || secondsOfDay < end; // 跨午夜
 }
killedBy: matchPolicy 匹配条件 时间窗：高峰 14:00-18:00（Asia/Shanghai）命中（WT-16 峰谷）
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/dispatch-policy.ts:160:10
   const start = parseTimeSeconds(policy.matchStartTime!);
   const end = parseTimeSeconds(policy.matchEndTime!);
   if (start < end) return secondsOfDay >= start && secondsOfDay < end;
-  return secondsOfDay >= start || secondsOfDay < end; // 跨午夜
+  return secondsOfDay >= start && secondsOfDay < end; // 跨午夜
 }
 
killedBy: matchPolicy 匹配条件 跨午夜时间窗：23:00:30–02:00:15 正确命中两侧
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:160:35
   const start = parseTimeSeconds(policy.matchStartTime!);
   const end = parseTimeSeconds(policy.matchEndTime!);
   if (start < end) return secondsOfDay >= start && secondsOfDay < end;
-  return secondsOfDay >= start || secondsOfDay < end; // 跨午夜
+  return secondsOfDay >= start || secondsOfDay <= end; // 跨午夜
 }
 
killedBy: matchPolicy 匹配条件 跨午夜时间窗：23:00:30–02:00:15 正确命中两侧
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/dispatch-policy.ts:169:55
 }
 
 /** decimal 字符串比较（>0 表示 a>b；避免 number 精度）。 */
-function compareDecimal(a: string, b: string): number {
-  const da = Number(a);
-  const db = Number(b);
-  if (Number.isNaN(da) || Number.isNaN(db)) return 0;
-  return da < db ? -1 : da > db ? 1 : 0;
-}
+function compareDecimal(a: string, b: string): number {}
 
 /**
killedBy: matchPolicy 匹配条件 价格倍率下限（≥）：高峰 ×3 命中
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:172:7
 function compareDecimal(a: string, b: string): number {
   const da = Number(a);
   const db = Number(b);
-  if (Number.isNaN(da) || Number.isNaN(db)) return 0;
+  if (true) return 0;
   return da < db ? -1 : da > db ? 1 : 0;
 }
killedBy: matchPolicy 匹配条件 价格倍率下限（≥）：高峰 ×3 命中
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/dispatch-policy.ts:172:7
 function compareDecimal(a: string, b: string): number {
   const da = Number(a);
   const db = Number(b);
-  if (Number.isNaN(da) || Number.isNaN(db)) return 0;
+  if (false) return 0;
   return da < db ? -1 : da > db ? 1 : 0;
 }

[Killed] ConditionalExpression
src/dispatch-policy.ts:173:10
   const da = Number(a);
   const db = Number(b);
   if (Number.isNaN(da) || Number.isNaN(db)) return 0;
-  return da < db ? -1 : da > db ? 1 : 0;
+  return true ? -1 : da > db ? 1 : 0;
 }
 
killedBy: matchPolicy 匹配条件 价格倍率下限（≥）：高峰 ×3 命中
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:173:10
   const da = Number(a);
   const db = Number(b);
   if (Number.isNaN(da) || Number.isNaN(db)) return 0;
-  return da < db ? -1 : da > db ? 1 : 0;
+  return da <= db ? -1 : da > db ? 1 : 0;
 }
 
killedBy: matchPolicy 匹配条件 价格倍率下限（≥）：高峰 ×3 命中
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/dispatch-policy.ts:196:19
   input: DispatchInput,
   availableResourceIds: ReadonlySet<string>,
 ): DispatchDecision {
-  const matched = policies
-    .filter((p) => matchPolicy(p, input))
-    .sort((a, b) => a.priority - b.priority || a.id.localeCompare(b.id));
+  const matched = policies.filter(p => matchPolicy(p, input));
 
   if (matched.length === 0) {
killedBy: decideDispatch 动作判定 多策略命中 → 取最高优先级（priority 数值最小）
statusReason: expected 'ALLOW' to be 'REJECT' // Object.is equality

[Survived] MethodExpression
src/dispatch-policy.ts:196:19
   input: DispatchInput,
   availableResourceIds: ReadonlySet<string>,
 ): DispatchDecision {
-  const matched = policies
-    .filter((p) => matchPolicy(p, input))
+  const matched = policies
     .sort((a, b) => a.priority - b.priority || a.id.localeCompare(b.id));
 

[Killed] ArrowFunction
src/dispatch-policy.ts:197:13
   availableResourceIds: ReadonlySet<string>,
 ): DispatchDecision {
   const matched = policies
-    .filter((p) => matchPolicy(p, input))
+    .filter(() => undefined)
     .sort((a, b) => a.priority - b.priority || a.id.localeCompare(b.id));
 
killedBy: decideDispatch 动作判定 命中 ALLOW → ALLOW_MATCHED
statusReason: expected 'ALLOW_NO_POLICY' to be 'ALLOW_MATCHED' // Object.is equality

[Killed] LogicalOperator
src/dispatch-policy.ts:198:21
 ): DispatchDecision {
   const matched = policies
     .filter((p) => matchPolicy(p, input))
-    .sort((a, b) => a.priority - b.priority || a.id.localeCompare(b.id));
+    .sort((a, b) => a.priority - b.priority && a.id.localeCompare(b.id));
 
   if (matched.length === 0) {
killedBy: decideDispatch 动作判定 多策略命中 → 取最高优先级（priority 数值最小）
statusReason: expected 'ALLOW' to be 'REJECT' // Object.is equality

[Killed] ArithmeticOperator
src/dispatch-policy.ts:198:21
 ): DispatchDecision {
   const matched = policies
     .filter((p) => matchPolicy(p, input))
-    .sort((a, b) => a.priority - b.priority || a.id.localeCompare(b.id));
+    .sort((a, b) => a.priority + b.priority || a.id.localeCompare(b.id));
 
   if (matched.length === 0) {
killedBy: decideDispatch 动作判定 多策略命中 → 取最高优先级（priority 数值最小）
statusReason: expected 'ALLOW' to be 'REJECT' // Object.is equality

[Killed] BlockStatement
src/dispatch-policy.ts:200:29
     .filter((p) => matchPolicy(p, input))
     .sort((a, b) => a.priority - b.priority || a.id.localeCompare(b.id));
 
-  if (matched.length === 0) {
-    return {
-      matchedPolicy: null,
-      finalAction: "ALLOW",
-      reasonCode: DISPATCH_REASON.ALLOW_NO_POLICY,
-      switchTargetResourceId: null,
-    };
-  }
+  if (matched.length === 0) {}
 
   const policy = matched[0]!;
killedBy: decideDispatch 动作判定 无匹配策略 → 默认 ALLOW_NO_POLICY
statusReason: Cannot read properties of undefined (reading 'action')

[Killed] ConditionalExpression
src/dispatch-policy.ts:200:7
     .filter((p) => matchPolicy(p, input))
     .sort((a, b) => a.priority - b.priority || a.id.localeCompare(b.id));
 
-  if (matched.length === 0) {
+  if (true) {
     return {
       matchedPolicy: null,
killedBy: decideDispatch 动作判定 命中 ALLOW → ALLOW_MATCHED
statusReason: expected 'ALLOW_NO_POLICY' to be 'ALLOW_MATCHED' // Object.is equality

[Killed] StringLiteral
src/dispatch-policy.ts:212:10
   const policy = matched[0]!;
 
   switch (policy.action) {
-    case "SWITCH": {
+    case "": {
       // 目标 = 等价组内 ∩ 可用候选，排除当前选中资源
       const targets = policy.switchEquivalentGroup.filter(
killedBy: decideDispatch 动作判定 命中 SWITCH 且目标在等价组∩可用 → SWITCH_WITHIN_GROUP（WT-16 等价切换）
statusReason: expected 'ALLOW' to be 'SWITCH' // Object.is equality

[Killed] MethodExpression
src/dispatch-policy.ts:214:23
   switch (policy.action) {
     case "SWITCH": {
       // 目标 = 等价组内 ∩ 可用候选，排除当前选中资源
-      const targets = policy.switchEquivalentGroup.filter(
-        (rid) => rid !== input.selectedResourceId && availableResourceIds.has(rid),
-      );
+      const targets = policy.switchEquivalentGroup;
       if (targets.length === 0) {
         // 等价组无可用目标 → 降级 ALLOW（不无账放行）
killedBy: decideDispatch 动作判定 命中 SWITCH 且目标在等价组∩可用 → SWITCH_WITHIN_GROUP（WT-16 等价切换）
statusReason: expected 'res-a' to be 'res-b' // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:215:18
     case "SWITCH": {
       // 目标 = 等价组内 ∩ 可用候选，排除当前选中资源
       const targets = policy.switchEquivalentGroup.filter(
-        (rid) => rid !== input.selectedResourceId && availableResourceIds.has(rid),
+        (rid) => true,
       );
       if (targets.length === 0) {
killedBy: decideDispatch 动作判定 命中 SWITCH 且目标在等价组∩可用 → SWITCH_WITHIN_GROUP（WT-16 等价切换）
statusReason: expected 'res-a' to be 'res-b' // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:215:18
     case "SWITCH": {
       // 目标 = 等价组内 ∩ 可用候选，排除当前选中资源
       const targets = policy.switchEquivalentGroup.filter(
-        (rid) => rid !== input.selectedResourceId && availableResourceIds.has(rid),
+        (rid) => true && availableResourceIds.has(rid),
       );
       if (targets.length === 0) {
killedBy: decideDispatch 动作判定 命中 SWITCH 且目标在等价组∩可用 → SWITCH_WITHIN_GROUP（WT-16 等价切换）
statusReason: expected 'res-a' to be 'res-b' // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:217:11
       const targets = policy.switchEquivalentGroup.filter(
         (rid) => rid !== input.selectedResourceId && availableResourceIds.has(rid),
       );
-      if (targets.length === 0) {
+      if (targets.length !== 0) {
         // 等价组无可用目标 → 降级 ALLOW（不无账放行）
         return {
killedBy: decideDispatch 动作判定 命中 SWITCH 且目标在等价组∩可用 → SWITCH_WITHIN_GROUP（WT-16 等价切换）
statusReason: expected 'ALLOW' to be 'SWITCH' // Object.is equality

[Killed] BlockStatement
src/dispatch-policy.ts:217:33
       const targets = policy.switchEquivalentGroup.filter(
         (rid) => rid !== input.selectedResourceId && availableResourceIds.has(rid),
       );
-      if (targets.length === 0) {
-        // 等价组无可用目标 → 降级 ALLOW（不无账放行）
-        return {
-          matchedPolicy: policy,
-          finalAction: "ALLOW",
-          reasonCode: DISPATCH_REASON.SWITCH_NO_TARGET,
-          switchTargetResourceId: null,
-        };
-      }
+      if (targets.length === 0) {}
       const target = targets[0]!;
       // 目标必须在等价组内（防御：availableResourceIds 已过滤，此处再确认）
killedBy: decideDispatch 动作判定 SWITCH：等价组内其他资源都不可用 → 降级 ALLOW_NO_TARGET（不无账放行）
statusReason: expected 'SWITCH_TARGET_NOT_IN_GROUP' to be 'SWITCH_NO_TARGET' // Object.is equality

[Killed] StringLiteral
src/dispatch-policy.ts:221:24
         // 等价组无可用目标 → 降级 ALLOW（不无账放行）
         return {
           matchedPolicy: policy,
-          finalAction: "ALLOW",
+          finalAction: "",
           reasonCode: DISPATCH_REASON.SWITCH_NO_TARGET,
           switchTargetResourceId: null,
killedBy: decideDispatch 动作判定 SWITCH：等价组内其他资源都不可用 → 降级 ALLOW_NO_TARGET（不无账放行）
statusReason: expected '' to be 'ALLOW' // Object.is equality

[Killed] BooleanLiteral
src/dispatch-policy.ts:228:11
       }
       const target = targets[0]!;
       // 目标必须在等价组内（防御：availableResourceIds 已过滤，此处再确认）
-      if (!policy.switchEquivalentGroup.includes(target)) {
+      if (policy.switchEquivalentGroup.includes(target)) {
         return {
           matchedPolicy: policy,
killedBy: decideDispatch 动作判定 命中 SWITCH 且目标在等价组∩可用 → SWITCH_WITHIN_GROUP（WT-16 等价切换）
statusReason: expected 'ALLOW' to be 'SWITCH' // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:228:11
       }
       const target = targets[0]!;
       // 目标必须在等价组内（防御：availableResourceIds 已过滤，此处再确认）
-      if (!policy.switchEquivalentGroup.includes(target)) {
+      if (true) {
         return {
           matchedPolicy: policy,
killedBy: decideDispatch 动作判定 命中 SWITCH 且目标在等价组∩可用 → SWITCH_WITHIN_GROUP（WT-16 等价切换）
statusReason: expected 'ALLOW' to be 'SWITCH' // Object.is equality

[Killed] ObjectLiteral
src/dispatch-policy.ts:236:14
           switchTargetResourceId: null,
         };
       }
-      return {
-        matchedPolicy: policy,
-        finalAction: "SWITCH",
-        reasonCode: DISPATCH_REASON.SWITCH_WITHIN_GROUP,
-        switchTargetResourceId: target,
-      };
+      return {};
     }
     case "RATE_LIMIT":
killedBy: decideDispatch 动作判定 命中 SWITCH 且目标在等价组∩可用 → SWITCH_WITHIN_GROUP（WT-16 等价切换）
statusReason: expected undefined to be 'SWITCH' // Object.is equality
