[Killed] ConditionalExpression
src/dispatch-policy.ts:243:5
         switchTargetResourceId: target,
       };
     }
-    case "RATE_LIMIT":
-      return { matchedPolicy: policy, finalAction: "RATE_LIMIT", reasonCode: DISPATCH_REASON.RATE_LIMITED, switchTargetResourceId: null };
+    case "RATE_LIMIT":
     case "REJECT":
       return { matchedPolicy: policy, finalAction: "REJECT", reasonCode: DISPATCH_REASON.REJECTED, switchTargetResourceId: null };
killedBy: decideDispatch 动作判定 命中 RATE_LIMIT → RATE_LIMITED
statusReason: expected 'REJECT' to be 'RATE_LIMIT' // Object.is equality

[Killed] StringLiteral
src/dispatch-policy.ts:244:52
       };
     }
     case "RATE_LIMIT":
-      return { matchedPolicy: policy, finalAction: "RATE_LIMIT", reasonCode: DISPATCH_REASON.RATE_LIMITED, switchTargetResourceId: null };
+      return { matchedPolicy: policy, finalAction: "", reasonCode: DISPATCH_REASON.RATE_LIMITED, switchTargetResourceId: null };
     case "REJECT":
       return { matchedPolicy: policy, finalAction: "REJECT", reasonCode: DISPATCH_REASON.REJECTED, switchTargetResourceId: null };
killedBy: decideDispatch 动作判定 命中 RATE_LIMIT → RATE_LIMITED
statusReason: expected '' to be 'RATE_LIMIT' // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:245:5
     }
     case "RATE_LIMIT":
       return { matchedPolicy: policy, finalAction: "RATE_LIMIT", reasonCode: DISPATCH_REASON.RATE_LIMITED, switchTargetResourceId: null };
-    case "REJECT":
-      return { matchedPolicy: policy, finalAction: "REJECT", reasonCode: DISPATCH_REASON.REJECTED, switchTargetResourceId: null };
+    case "REJECT":
     case "ALLOW_OVERAGE":
       return { matchedPolicy: policy, finalAction: "ALLOW_OVERAGE", reasonCode: DISPATCH_REASON.ALLOW_OVERAGE_MATCHED, switchTargetResourceId: null };
killedBy: decideDispatch 动作判定 命中 REJECT → REJECTED
statusReason: expected 'ALLOW_OVERAGE' to be 'REJECT' // Object.is equality

[Killed] StringLiteral
src/dispatch-policy.ts:245:10
     }
     case "RATE_LIMIT":
       return { matchedPolicy: policy, finalAction: "RATE_LIMIT", reasonCode: DISPATCH_REASON.RATE_LIMITED, switchTargetResourceId: null };
-    case "REJECT":
+    case "":
       return { matchedPolicy: policy, finalAction: "REJECT", reasonCode: DISPATCH_REASON.REJECTED, switchTargetResourceId: null };
     case "ALLOW_OVERAGE":
killedBy: decideDispatch 动作判定 命中 REJECT → REJECTED
statusReason: expected 'ALLOW' to be 'REJECT' // Object.is equality

[Killed] ObjectLiteral
src/dispatch-policy.ts:246:14
     case "RATE_LIMIT":
       return { matchedPolicy: policy, finalAction: "RATE_LIMIT", reasonCode: DISPATCH_REASON.RATE_LIMITED, switchTargetResourceId: null };
     case "REJECT":
-      return { matchedPolicy: policy, finalAction: "REJECT", reasonCode: DISPATCH_REASON.REJECTED, switchTargetResourceId: null };
+      return {};
     case "ALLOW_OVERAGE":
       return { matchedPolicy: policy, finalAction: "ALLOW_OVERAGE", reasonCode: DISPATCH_REASON.ALLOW_OVERAGE_MATCHED, switchTargetResourceId: null };
killedBy: decideDispatch 动作判定 命中 REJECT → REJECTED
statusReason: expected undefined to be 'REJECT' // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:247:5
       return { matchedPolicy: policy, finalAction: "RATE_LIMIT", reasonCode: DISPATCH_REASON.RATE_LIMITED, switchTargetResourceId: null };
     case "REJECT":
       return { matchedPolicy: policy, finalAction: "REJECT", reasonCode: DISPATCH_REASON.REJECTED, switchTargetResourceId: null };
-    case "ALLOW_OVERAGE":
-      return { matchedPolicy: policy, finalAction: "ALLOW_OVERAGE", reasonCode: DISPATCH_REASON.ALLOW_OVERAGE_MATCHED, switchTargetResourceId: null };
+    case "ALLOW_OVERAGE":
     case "ALLOW":
     default:
killedBy: decideDispatch 动作判定 命中 ALLOW_OVERAGE
statusReason: expected 'ALLOW' to be 'ALLOW_OVERAGE' // Object.is equality

[Killed] StringLiteral
src/dispatch-policy.ts:247:10
       return { matchedPolicy: policy, finalAction: "RATE_LIMIT", reasonCode: DISPATCH_REASON.RATE_LIMITED, switchTargetResourceId: null };
     case "REJECT":
       return { matchedPolicy: policy, finalAction: "REJECT", reasonCode: DISPATCH_REASON.REJECTED, switchTargetResourceId: null };
-    case "ALLOW_OVERAGE":
+    case "":
       return { matchedPolicy: policy, finalAction: "ALLOW_OVERAGE", reasonCode: DISPATCH_REASON.ALLOW_OVERAGE_MATCHED, switchTargetResourceId: null };
     case "ALLOW":
killedBy: decideDispatch 动作判定 命中 ALLOW_OVERAGE
statusReason: expected 'ALLOW' to be 'ALLOW_OVERAGE' // Object.is equality

[Survived] StringLiteral
src/dispatch-policy.ts:249:10
       return { matchedPolicy: policy, finalAction: "REJECT", reasonCode: DISPATCH_REASON.REJECTED, switchTargetResourceId: null };
     case "ALLOW_OVERAGE":
       return { matchedPolicy: policy, finalAction: "ALLOW_OVERAGE", reasonCode: DISPATCH_REASON.ALLOW_OVERAGE_MATCHED, switchTargetResourceId: null };
-    case "ALLOW":
+    case "":
     default:
       return { matchedPolicy: policy, finalAction: "ALLOW", reasonCode: DISPATCH_REASON.ALLOW_MATCHED, switchTargetResourceId: null };

[Killed] ConditionalExpression
src/dispatch-policy.ts:250:5
     case "ALLOW_OVERAGE":
       return { matchedPolicy: policy, finalAction: "ALLOW_OVERAGE", reasonCode: DISPATCH_REASON.ALLOW_OVERAGE_MATCHED, switchTargetResourceId: null };
     case "ALLOW":
-    default:
-      return { matchedPolicy: policy, finalAction: "ALLOW", reasonCode: DISPATCH_REASON.ALLOW_MATCHED, switchTargetResourceId: null };
+    default:
   }
 }
killedBy: decideDispatch 动作判定 命中 ALLOW → ALLOW_MATCHED
statusReason: Cannot read properties of undefined (reading 'finalAction')

[Killed] BlockStatement
src/dispatch-policy.ts:275:66
   actualCost: string | null;
   /** 动作是否实际执行并改变了资源/行为（SWITCH 实际切换=true；仅提示=false）。 */
   actionExecuted: boolean;
-}): { saving: string | "NOT_CALCULABLE"; reason: string | null } {
-  // 仅提示、用户没有改变行为 → NOT_CALCULABLE（行 631）
-  if (!input.actionExecuted) {
-    return { saving: "NOT_CALCULABLE", reason: "no_action_executed" };
-  }
-  // 基线不可比 → NOT_CALCULABLE（行 628, 631）
-  if (input.counterfactualCost === null || input.actualCost === null) {
-    return { saving: "NOT_CALCULABLE", reason: "baseline_not_comparable" };
-  }
-  const cf = decimalToScaled(input.counterfactualCost, 8);
-  const actual = decimalToScaled(input.actualCost, 8);
-  if (cf === null || actual === null) {
-    return { saving: "NOT_CALCULABLE", reason: "invalid_cost_value" };
-  }
-  // 节省 = 反事实 − 实际（可正可负；可负表示实际更贵）
-  return { saving: scaledToDecimal(cf - actual, 8), reason: null };
-}
+}): { saving: string | "NOT_CALCULABLE"; reason: string | null } {}
 
 function decimalToScaled(value: string, scale: number): bigint | null {
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: Cannot read properties of undefined (reading 'saving')

[Killed] BooleanLiteral
src/dispatch-policy.ts:277:7
   actionExecuted: boolean;
 }): { saving: string | "NOT_CALCULABLE"; reason: string | null } {
   // 仅提示、用户没有改变行为 → NOT_CALCULABLE（行 631）
-  if (!input.actionExecuted) {
+  if (input.actionExecuted) {
     return { saving: "NOT_CALCULABLE", reason: "no_action_executed" };
   }
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected 'NOT_CALCULABLE' to be '0.04000000' // Object.is equality

[Killed] BlockStatement
src/dispatch-policy.ts:277:30
   actionExecuted: boolean;
 }): { saving: string | "NOT_CALCULABLE"; reason: string | null } {
   // 仅提示、用户没有改变行为 → NOT_CALCULABLE（行 631）
-  if (!input.actionExecuted) {
-    return { saving: "NOT_CALCULABLE", reason: "no_action_executed" };
-  }
+  if (!input.actionExecuted) {}
   // 基线不可比 → NOT_CALCULABLE（行 628, 631）
   if (input.counterfactualCost === null || input.actualCost === null) {
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 仅提示（actionExecuted=false）→ NOT_CALCULABLE（行 631：仅提示/未改变行为）
statusReason: expected '0.00000000' to be 'NOT_CALCULABLE' // Object.is equality

[Killed] StringLiteral
src/dispatch-policy.ts:278:48
 }): { saving: string | "NOT_CALCULABLE"; reason: string | null } {
   // 仅提示、用户没有改变行为 → NOT_CALCULABLE（行 631）
   if (!input.actionExecuted) {
-    return { saving: "NOT_CALCULABLE", reason: "no_action_executed" };
+    return { saving: "NOT_CALCULABLE", reason: "" };
   }
   // 基线不可比 → NOT_CALCULABLE（行 628, 631）
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 仅提示（actionExecuted=false）→ NOT_CALCULABLE（行 631：仅提示/未改变行为）
statusReason: expected '' to be 'no_action_executed' // Object.is equality

[Killed] StringLiteral
src/dispatch-policy.ts:278:22
 }): { saving: string | "NOT_CALCULABLE"; reason: string | null } {
   // 仅提示、用户没有改变行为 → NOT_CALCULABLE（行 631）
   if (!input.actionExecuted) {
-    return { saving: "NOT_CALCULABLE", reason: "no_action_executed" };
+    return { saving: "", reason: "no_action_executed" };
   }
   // 基线不可比 → NOT_CALCULABLE（行 628, 631）
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 仅提示（actionExecuted=false）→ NOT_CALCULABLE（行 631：仅提示/未改变行为）
statusReason: expected '' to be 'NOT_CALCULABLE' // Object.is equality

[Killed] LogicalOperator
src/dispatch-policy.ts:281:7
     return { saving: "NOT_CALCULABLE", reason: "no_action_executed" };
   }
   // 基线不可比 → NOT_CALCULABLE（行 628, 631）
-  if (input.counterfactualCost === null || input.actualCost === null) {
+  if (input.counterfactualCost === null && input.actualCost === null) {
     return { saving: "NOT_CALCULABLE", reason: "baseline_not_comparable" };
   }
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 反事实基线不可比（counterfactualCost=null）→ NOT_CALCULABLE（行 628, 631）
statusReason: Cannot read properties of null (reading 'trim')

[Killed] ConditionalExpression
src/dispatch-policy.ts:281:44
     return { saving: "NOT_CALCULABLE", reason: "no_action_executed" };
   }
   // 基线不可比 → NOT_CALCULABLE（行 628, 631）
-  if (input.counterfactualCost === null || input.actualCost === null) {
+  if (input.counterfactualCost === null || false) {
     return { saving: "NOT_CALCULABLE", reason: "baseline_not_comparable" };
   }
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 无实际成本证据（actualCost=null）→ NOT_CALCULABLE（行 630：无价格证据）
statusReason: Cannot read properties of null (reading 'trim')

[Killed] LogicalOperator
src/dispatch-policy.ts:286:7
   }
   const cf = decimalToScaled(input.counterfactualCost, 8);
   const actual = decimalToScaled(input.actualCost, 8);
-  if (cf === null || actual === null) {
+  if (cf === null && actual === null) {
     return { saving: "NOT_CALCULABLE", reason: "invalid_cost_value" };
   }
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 成本值无效 → NOT_CALCULABLE
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ConditionalExpression
src/dispatch-policy.ts:286:22
   }
   const cf = decimalToScaled(input.counterfactualCost, 8);
   const actual = decimalToScaled(input.actualCost, 8);
-  if (cf === null || actual === null) {
+  if (cf === null || false) {
     return { saving: "NOT_CALCULABLE", reason: "invalid_cost_value" };
   }
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 实际成本格式错误同样不可计算
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] ArithmeticOperator
src/dispatch-policy.ts:290:36
     return { saving: "NOT_CALCULABLE", reason: "invalid_cost_value" };
   }
   // 节省 = 反事实 − 实际（可正可负；可负表示实际更贵）
-  return { saving: scaledToDecimal(cf - actual, 8), reason: null };
+  return { saving: scaledToDecimal(cf + actual, 8), reason: null };
 }
 
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected '0.16000000' to be '0.04000000' // Object.is equality

[Killed] BlockStatement
src/dispatch-policy.ts:293:71
   return { saving: scaledToDecimal(cf - actual, 8), reason: null };
 }
 
-function decimalToScaled(value: string, scale: number): bigint | null {
-  const match = /^(-?)(\d+)(?:\.(\d+))?$/.exec(value.trim());
-  if (!match) return null;
-  const fraction = match[3] ?? "";
-  if (fraction.length > scale) return null;
-  const scaled = BigInt(match[2]!) * 10n ** BigInt(scale) + BigInt(fraction.padEnd(scale, "0"));
-  return match[1] === "-" ? -scaled : scaled;
-}
+function decimalToScaled(value: string, scale: number): bigint | null {}
 
 function scaledToDecimal(value: bigint, scale: number): string {
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: Cannot mix BigInt and other types, use explicit conversions

[Killed] MethodExpression
src/dispatch-policy.ts:294:48
 }
 
 function decimalToScaled(value: string, scale: number): bigint | null {
-  const match = /^(-?)(\d+)(?:\.(\d+))?$/.exec(value.trim());
+  const match = /^(-?)(\d+)(?:\.(\d+))?$/.exec(value);
   if (!match) return null;
   const fraction = match[3] ?? "";
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 整数、首尾空白与零节省按 8 位小数稳定归一
statusReason: expected { saving: 'NOT_CALCULABLE', …(1) } to deeply equal { saving: '1.00000000', reason: null }

[Killed] Regex
src/dispatch-policy.ts:294:17
 }
 
 function decimalToScaled(value: string, scale: number): bigint | null {
-  const match = /^(-?)(\d+)(?:\.(\d+))?$/.exec(value.trim());
+  const match = /^(-?)(\d+)(?:\.(\d+))$/.exec(value.trim());
   if (!match) return null;
   const fraction = match[3] ?? "";
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 整数、首尾空白与零节省按 8 位小数稳定归一
statusReason: expected { saving: 'NOT_CALCULABLE', …(1) } to deeply equal { saving: '1.00000000', reason: null }

[Killed] ConditionalExpression
src/dispatch-policy.ts:295:7
 
 function decimalToScaled(value: string, scale: number): bigint | null {
   const match = /^(-?)(\d+)(?:\.(\d+))?$/.exec(value.trim());
-  if (!match) return null;
+  if (false) return null;
   const fraction = match[3] ?? "";
   if (fraction.length > scale) return null;
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 成本值无效 → NOT_CALCULABLE
statusReason: Cannot read properties of null (reading '3')

[Killed] ConditionalExpression
src/dispatch-policy.ts:295:7
 
 function decimalToScaled(value: string, scale: number): bigint | null {
   const match = /^(-?)(\d+)(?:\.(\d+))?$/.exec(value.trim());
-  if (!match) return null;
+  if (true) return null;
   const fraction = match[3] ?? "";
   if (fraction.length > scale) return null;
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected 'NOT_CALCULABLE' to be '0.04000000' // Object.is equality

[Killed] LogicalOperator
src/dispatch-policy.ts:296:20
 function decimalToScaled(value: string, scale: number): bigint | null {
   const match = /^(-?)(\d+)(?:\.(\d+))?$/.exec(value.trim());
   if (!match) return null;
-  const fraction = match[3] ?? "";
+  const fraction = match[3] && "";
   if (fraction.length > scale) return null;
   const scaled = BigInt(match[2]!) * 10n ** BigInt(scale) + BigInt(fraction.padEnd(scale, "0"));
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected '0.00000000' to be '0.04000000' // Object.is equality

[Killed] EqualityOperator
src/dispatch-policy.ts:297:7
   const match = /^(-?)(\d+)(?:\.(\d+))?$/.exec(value.trim());
   if (!match) return null;
   const fraction = match[3] ?? "";
-  if (fraction.length > scale) return null;
+  if (fraction.length >= scale) return null;
   const scaled = BigInt(match[2]!) * 10n ** BigInt(scale) + BigInt(fraction.padEnd(scale, "0"));
   return match[1] === "-" ? -scaled : scaled;
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 大额小数仍按 decimal 精确相减，不经过浮点数
statusReason: expected 'NOT_CALCULABLE' to be '0.01000000' // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:297:7
   const match = /^(-?)(\d+)(?:\.(\d+))?$/.exec(value.trim());
   if (!match) return null;
   const fraction = match[3] ?? "";
-  if (fraction.length > scale) return null;
+  if (false) return null;
   const scaled = BigInt(match[2]!) * 10n ** BigInt(scale) + BigInt(fraction.padEnd(scale, "0"));
   return match[1] === "-" ? -scaled : scaled;
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 拒绝非规范成本 1.000000000
statusReason: expected { saving: '1.00000000', reason: null } to deeply equal { saving: 'NOT_CALCULABLE', …(1) }

[Killed] ArithmeticOperator
src/dispatch-policy.ts:298:18
   if (!match) return null;
   const fraction = match[3] ?? "";
   if (fraction.length > scale) return null;
-  const scaled = BigInt(match[2]!) * 10n ** BigInt(scale) + BigInt(fraction.padEnd(scale, "0"));
+  const scaled = BigInt(match[2]!) * 10n ** BigInt(scale) - BigInt(fraction.padEnd(scale, "0"));
   return match[1] === "-" ? -scaled : scaled;
 }
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected '-0.04000000' to be '0.04000000' // Object.is equality

[Killed] ArithmeticOperator
src/dispatch-policy.ts:298:18
   if (!match) return null;
   const fraction = match[3] ?? "";
   if (fraction.length > scale) return null;
-  const scaled = BigInt(match[2]!) * 10n ** BigInt(scale) + BigInt(fraction.padEnd(scale, "0"));
+  const scaled = BigInt(match[2]!) / 10n ** BigInt(scale) + BigInt(fraction.padEnd(scale, "0"));
   return match[1] === "-" ? -scaled : scaled;
 }
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 整数、首尾空白与零节省按 8 位小数稳定归一
statusReason: expected { saving: '0.00000000', reason: null } to deeply equal { saving: '1.00000000', reason: null }

[Killed] EqualityOperator
src/dispatch-policy.ts:299:10
   const fraction = match[3] ?? "";
   if (fraction.length > scale) return null;
   const scaled = BigInt(match[2]!) * 10n ** BigInt(scale) + BigInt(fraction.padEnd(scale, "0"));
-  return match[1] === "-" ? -scaled : scaled;
+  return match[1] !== "-" ? -scaled : scaled;
 }
 
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected '-0.04000000' to be '0.04000000' // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:299:10
   const fraction = match[3] ?? "";
   if (fraction.length > scale) return null;
   const scaled = BigInt(match[2]!) * 10n ** BigInt(scale) + BigInt(fraction.padEnd(scale, "0"));
-  return match[1] === "-" ? -scaled : scaled;
+  return false ? -scaled : scaled;
 }
 
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 负成本输入仍按符号和小数位精确换算
statusReason: expected '-1.25000000' to be '1.25000000' // Object.is equality

[Killed] BlockStatement
src/dispatch-policy.ts:302:64
   return match[1] === "-" ? -scaled : scaled;
 }
 
-function scaledToDecimal(value: bigint, scale: number): string {
-  const negative = value < 0n;
-  const absolute = negative ? -value : value;
-  const factor = 10n ** BigInt(scale);
-  const integer = absolute / factor;
-  const fraction = (absolute % factor).toString().padStart(scale, "0");
-  return `${negative ? "-" : ""}${integer}.${fraction}`;
-}
+function scaledToDecimal(value: bigint, scale: number): string {}
 
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected undefined to be '0.04000000' // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:303:20
 }
 
 function scaledToDecimal(value: bigint, scale: number): string {
-  const negative = value < 0n;
+  const negative = true;
   const absolute = negative ? -value : value;
   const factor = 10n ** BigInt(scale);
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected '-0.-4000000' to be '0.04000000' // Object.is equality

[Killed] ConditionalExpression
src/dispatch-policy.ts:303:20
 }
 
 function scaledToDecimal(value: bigint, scale: number): string {
-  const negative = value < 0n;
+  const negative = false;
   const absolute = negative ? -value : value;
   const factor = 10n ** BigInt(scale);
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：负节省（实际更贵，允许为负）
statusReason: expected '0.-3000000' to be '-0.03000000' // Object.is equality

[Killed] UnaryOperator
src/dispatch-policy.ts:304:31
 
 function scaledToDecimal(value: bigint, scale: number): string {
   const negative = value < 0n;
-  const absolute = negative ? -value : value;
+  const absolute = negative ? +value : value;
   const factor = 10n ** BigInt(scale);
   const integer = absolute / factor;
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：负节省（实际更贵，允许为负）
statusReason: Cannot convert a BigInt value to a number

[Killed] ArithmeticOperator
src/dispatch-policy.ts:306:19
   const negative = value < 0n;
   const absolute = negative ? -value : value;
   const factor = 10n ** BigInt(scale);
-  const integer = absolute / factor;
+  const integer = absolute * factor;
   const fraction = (absolute % factor).toString().padStart(scale, "0");
   return `${negative ? "-" : ""}${integer}.${fraction}`;
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected '400000000000000.04000000' to be '0.04000000' // Object.is equality

[Killed] ArithmeticOperator
src/dispatch-policy.ts:307:21
   const absolute = negative ? -value : value;
   const factor = 10n ** BigInt(scale);
   const integer = absolute / factor;
-  const fraction = (absolute % factor).toString().padStart(scale, "0");
+  const fraction = (absolute * factor).toString().padStart(scale, "0");
   return `${negative ? "-" : ""}${integer}.${fraction}`;
 }
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected '0.400000000000000' to be '0.04000000' // Object.is equality

[Killed] StringLiteral
src/dispatch-policy.ts:307:67
   const absolute = negative ? -value : value;
   const factor = 10n ** BigInt(scale);
   const integer = absolute / factor;
-  const fraction = (absolute % factor).toString().padStart(scale, "0");
+  const fraction = (absolute % factor).toString().padStart(scale, "");
   return `${negative ? "-" : ""}${integer}.${fraction}`;
 }
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected '0.4000000' to be '0.04000000' // Object.is equality

[Killed] StringLiteral
src/dispatch-policy.ts:308:30
   const factor = 10n ** BigInt(scale);
   const integer = absolute / factor;
   const fraction = (absolute % factor).toString().padStart(scale, "0");
-  return `${negative ? "-" : ""}${integer}.${fraction}`;
+  return `${negative ? "-" : "Stryker was here!"}${integer}.${fraction}`;
 }
 
killedBy: computeDispatchSaving 反事实节省（WT-17，§9.1 行 620-632） 可计算：反事实 − 实际 = 正节省（切换到更便宜资源）
statusReason: expected 'Stryker was here!0.04000000' to be '0.04000000' // Object.is equality
