[Killed] MethodExpression
src/reconciliation.ts:107:26
  * @returns 判定 + 分级差异（重复/丢失=HIGH，汇总不一致=MEDIUM）
  */
 export function evaluateReconciliation(scan: ReconciliationScan): ReconciliationVerdict {
-  const duplicateCount = scan.discrepancies.filter(
-    (d) => d.type === DISCREPANCY_TYPE.DUPLICATE_USAGE,
-  ).length;
+  const duplicateCount = scan.discrepancies.length;
   const missingCount = scan.discrepancies.filter(
     (d) =>
killedBy: evaluateReconciliation 对账判定 PASS 边界：丢失率 <0.1%（如 9999 个 usage，1 个丢失 ≈ 0.0001）
statusReason: expected 'FAIL' to be 'PASS' // Object.is equality

[Killed] ArrowFunction
src/reconciliation.ts:108:5
  */
 export function evaluateReconciliation(scan: ReconciliationScan): ReconciliationVerdict {
   const duplicateCount = scan.discrepancies.filter(
-    (d) => d.type === DISCREPANCY_TYPE.DUPLICATE_USAGE,
+    () => undefined,
   ).length;
   const missingCount = scan.discrepancies.filter(
killedBy: evaluateReconciliation 对账判定 FAIL：重复 >0（重复率必须 0，TRD 行 870）
statusReason: expected 'PASS' to be 'FAIL' // Object.is equality

[Killed] ConditionalExpression
src/reconciliation.ts:108:12
  */
 export function evaluateReconciliation(scan: ReconciliationScan): ReconciliationVerdict {
   const duplicateCount = scan.discrepancies.filter(
-    (d) => d.type === DISCREPANCY_TYPE.DUPLICATE_USAGE,
+    (d) => false,
   ).length;
   const missingCount = scan.discrepancies.filter(
killedBy: evaluateReconciliation 对账判定 FAIL：重复 >0（重复率必须 0，TRD 行 870）
statusReason: expected 'PASS' to be 'FAIL' // Object.is equality

[Killed] MethodExpression
src/reconciliation.ts:110:24
   const duplicateCount = scan.discrepancies.filter(
     (d) => d.type === DISCREPANCY_TYPE.DUPLICATE_USAGE,
   ).length;
-  const missingCount = scan.discrepancies.filter(
-    (d) =>
-      d.type === DISCREPANCY_TYPE.MISSING_LEDGER_LINE ||
-      d.type === DISCREPANCY_TYPE.MISSING_USAGE ||
-      d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
-  ).length;
+  const missingCount = scan.discrepancies.length;
   const mismatchCount = scan.discrepancies.filter(
     (d) => d.type === DISCREPANCY_TYPE.SETTLEMENT_MISMATCH,
killedBy: evaluateReconciliation 对账判定 REVIEW：仅汇总不一致（无重复/丢失）
statusReason: expected 'FAIL' to be 'REVIEW' // Object.is equality

[Killed] ArrowFunction
src/reconciliation.ts:111:5
     (d) => d.type === DISCREPANCY_TYPE.DUPLICATE_USAGE,
   ).length;
   const missingCount = scan.discrepancies.filter(
-    (d) =>
-      d.type === DISCREPANCY_TYPE.MISSING_LEDGER_LINE ||
-      d.type === DISCREPANCY_TYPE.MISSING_USAGE ||
-      d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
+    () => undefined,
   ).length;
   const mismatchCount = scan.discrepancies.filter(
killedBy: evaluateReconciliation 对账判定 FAIL：丢失率 ≥0.1%（TRD 行 871，阈值 0.001）
statusReason: expected 'PASS' to be 'FAIL' // Object.is equality

[Killed] LogicalOperator
src/reconciliation.ts:112:7
   ).length;
   const missingCount = scan.discrepancies.filter(
     (d) =>
-      d.type === DISCREPANCY_TYPE.MISSING_LEDGER_LINE ||
-      d.type === DISCREPANCY_TYPE.MISSING_USAGE ||
-      d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
+      (d.type === DISCREPANCY_TYPE.MISSING_LEDGER_LINE || d.type === DISCREPANCY_TYPE.MISSING_USAGE) && d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
   ).length;
   const mismatchCount = scan.discrepancies.filter(
killedBy: evaluateReconciliation 对账判定 FAIL：丢失率 ≥0.1%（TRD 行 871，阈值 0.001）
statusReason: expected 'PASS' to be 'FAIL' // Object.is equality

[Killed] ConditionalExpression
src/reconciliation.ts:112:7
   ).length;
   const missingCount = scan.discrepancies.filter(
     (d) =>
-      d.type === DISCREPANCY_TYPE.MISSING_LEDGER_LINE ||
-      d.type === DISCREPANCY_TYPE.MISSING_USAGE ||
-      d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
+      false,
   ).length;
   const mismatchCount = scan.discrepancies.filter(
killedBy: evaluateReconciliation 对账判定 FAIL：丢失率 ≥0.1%（TRD 行 871，阈值 0.001）
statusReason: expected 'PASS' to be 'FAIL' // Object.is equality

[Killed] EqualityOperator
src/reconciliation.ts:113:7
   const missingCount = scan.discrepancies.filter(
     (d) =>
       d.type === DISCREPANCY_TYPE.MISSING_LEDGER_LINE ||
-      d.type === DISCREPANCY_TYPE.MISSING_USAGE ||
+      d.type !== DISCREPANCY_TYPE.MISSING_USAGE ||
       d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
   ).length;
killedBy: evaluateReconciliation 对账判定 REVIEW：仅汇总不一致（无重复/丢失）
statusReason: expected 'FAIL' to be 'REVIEW' // Object.is equality

[Survived] ConditionalExpression
src/reconciliation.ts:113:7
   const missingCount = scan.discrepancies.filter(
     (d) =>
       d.type === DISCREPANCY_TYPE.MISSING_LEDGER_LINE ||
-      d.type === DISCREPANCY_TYPE.MISSING_USAGE ||
+      false ||
       d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
   ).length;

[Killed] EqualityOperator
src/reconciliation.ts:114:7
     (d) =>
       d.type === DISCREPANCY_TYPE.MISSING_LEDGER_LINE ||
       d.type === DISCREPANCY_TYPE.MISSING_USAGE ||
-      d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
+      d.type !== DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
   ).length;
   const mismatchCount = scan.discrepancies.filter(
killedBy: evaluateReconciliation 对账判定 REVIEW：仅汇总不一致（无重复/丢失）
statusReason: expected 'FAIL' to be 'REVIEW' // Object.is equality

[Survived] ConditionalExpression
src/reconciliation.ts:114:7
     (d) =>
       d.type === DISCREPANCY_TYPE.MISSING_LEDGER_LINE ||
       d.type === DISCREPANCY_TYPE.MISSING_USAGE ||
-      d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
+      false,
   ).length;
   const mismatchCount = scan.discrepancies.filter(

[Killed] MethodExpression
src/reconciliation.ts:116:25
       d.type === DISCREPANCY_TYPE.MISSING_USAGE ||
       d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
   ).length;
-  const mismatchCount = scan.discrepancies.filter(
-    (d) => d.type === DISCREPANCY_TYPE.SETTLEMENT_MISMATCH,
-  ).length;
+  const mismatchCount = scan.discrepancies.length;
 
   // 比率（decimal 字符串，避免 number 精度；分母为 0 时比率为 "0"）
killedBy: evaluateReconciliation 对账判定 PASS 边界：丢失率 <0.1%（如 9999 个 usage，1 个丢失 ≈ 0.0001）
statusReason: expected 'REVIEW' to be 'PASS' // Object.is equality

[Killed] ConditionalExpression
src/reconciliation.ts:117:12
       d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
   ).length;
   const mismatchCount = scan.discrepancies.filter(
-    (d) => d.type === DISCREPANCY_TYPE.SETTLEMENT_MISMATCH,
+    (d) => false,
   ).length;
 
killedBy: evaluateReconciliation 对账判定 REVIEW：仅汇总不一致（无重复/丢失）
statusReason: expected 'PASS' to be 'REVIEW' // Object.is equality

[Killed] ArrowFunction
src/reconciliation.ts:117:5
       d.type === DISCREPANCY_TYPE.ORPHAN_LEDGER_LINE,
   ).length;
   const mismatchCount = scan.discrepancies.filter(
-    (d) => d.type === DISCREPANCY_TYPE.SETTLEMENT_MISMATCH,
+    () => undefined,
   ).length;
 
killedBy: evaluateReconciliation 对账判定 REVIEW：仅汇总不一致（无重复/丢失）
statusReason: expected 'PASS' to be 'REVIEW' // Object.is equality

[Killed] ConditionalExpression
src/reconciliation.ts:121:17
   ).length;
 
   // 比率（decimal 字符串，避免 number 精度；分母为 0 时比率为 "0"）
-  const denom = scan.usageEventsScanned > 0 ? scan.usageEventsScanned : 1;
+  const denom = false ? scan.usageEventsScanned : 1;
   const duplicateRate = (duplicateCount / denom).toFixed(8);
   const missingRate = (missingCount / denom).toFixed(8);
killedBy: evaluateReconciliation 对账判定 FAIL：重复 >0（重复率必须 0，TRD 行 870）
statusReason: expected '1.00000000' to be '0.01000000' // Object.is equality

[Killed] EqualityOperator
src/reconciliation.ts:121:17
   ).length;
 
   // 比率（decimal 字符串，避免 number 精度；分母为 0 时比率为 "0"）
-  const denom = scan.usageEventsScanned > 0 ? scan.usageEventsScanned : 1;
+  const denom = scan.usageEventsScanned >= 0 ? scan.usageEventsScanned : 1;
   const duplicateRate = (duplicateCount / denom).toFixed(8);
   const missingRate = (missingCount / denom).toFixed(8);
killedBy: evaluateReconciliation 对账判定 usageEventsScanned=0 时不除零（比率 0，PASS）
statusReason: expected 'NaN' to be '0.00000000' // Object.is equality

[Killed] ArithmeticOperator
src/reconciliation.ts:122:26
 
   // 比率（decimal 字符串，避免 number 精度；分母为 0 时比率为 "0"）
   const denom = scan.usageEventsScanned > 0 ? scan.usageEventsScanned : 1;
-  const duplicateRate = (duplicateCount / denom).toFixed(8);
+  const duplicateRate = (duplicateCount * denom).toFixed(8);
   const missingRate = (missingCount / denom).toFixed(8);
 
killedBy: evaluateReconciliation 对账判定 FAIL：重复 >0（重复率必须 0，TRD 行 870）
statusReason: expected '100.00000000' to be '0.01000000' // Object.is equality

[Killed] ArithmeticOperator
src/reconciliation.ts:123:24
   // 比率（decimal 字符串，避免 number 精度；分母为 0 时比率为 "0"）
   const denom = scan.usageEventsScanned > 0 ? scan.usageEventsScanned : 1;
   const duplicateRate = (duplicateCount / denom).toFixed(8);
-  const missingRate = (missingCount / denom).toFixed(8);
+  const missingRate = (missingCount * denom).toFixed(8);
 
   // 判定（行 870-871）
killedBy: evaluateReconciliation 对账判定 FAIL：丢失率 ≥0.1%（TRD 行 871，阈值 0.001）
statusReason: expected '100.00000000' to be '0.01000000' // Object.is equality

[Killed] ConditionalExpression
src/reconciliation.ts:127:7
 
   // 判定（行 870-871）
   let result: ReconciliationResultVerdict;
-  if (duplicateCount > 0 || missingCount / denom >= MISSING_RATE_THRESHOLD) {
+  if (true) {
     result = RECONCILIATION_RESULT.FAIL;
   } else if (mismatchCount > 0) {
killedBy: evaluateReconciliation 对账判定 PASS：无任何差异（重复 0 + 丢失 0 + 无汇总不一致）
statusReason: expected 'FAIL' to be 'PASS' // Object.is equality

[Killed] EqualityOperator
src/reconciliation.ts:127:7
 
   // 判定（行 870-871）
   let result: ReconciliationResultVerdict;
-  if (duplicateCount > 0 || missingCount / denom >= MISSING_RATE_THRESHOLD) {
+  if (duplicateCount >= 0 || missingCount / denom >= MISSING_RATE_THRESHOLD) {
     result = RECONCILIATION_RESULT.FAIL;
   } else if (mismatchCount > 0) {
killedBy: evaluateReconciliation 对账判定 PASS：无任何差异（重复 0 + 丢失 0 + 无汇总不一致）
statusReason: expected 'FAIL' to be 'PASS' // Object.is equality

[Killed] EqualityOperator
src/reconciliation.ts:129:14
   let result: ReconciliationResultVerdict;
   if (duplicateCount > 0 || missingCount / denom >= MISSING_RATE_THRESHOLD) {
     result = RECONCILIATION_RESULT.FAIL;
-  } else if (mismatchCount > 0) {
+  } else if (mismatchCount <= 0) {
     result = RECONCILIATION_RESULT.REVIEW;
   } else {
killedBy: evaluateReconciliation 对账判定 PASS：无任何差异（重复 0 + 丢失 0 + 无汇总不一致）
statusReason: expected 'REVIEW' to be 'PASS' // Object.is equality

[Killed] EqualityOperator
src/reconciliation.ts:129:14
   let result: ReconciliationResultVerdict;
   if (duplicateCount > 0 || missingCount / denom >= MISSING_RATE_THRESHOLD) {
     result = RECONCILIATION_RESULT.FAIL;
-  } else if (mismatchCount > 0) {
+  } else if (mismatchCount >= 0) {
     result = RECONCILIATION_RESULT.REVIEW;
   } else {
killedBy: evaluateReconciliation 对账判定 PASS：无任何差异（重复 0 + 丢失 0 + 无汇总不一致）
statusReason: expected 'REVIEW' to be 'PASS' // Object.is equality

[Killed] BlockStatement
src/reconciliation.ts:131:10
     result = RECONCILIATION_RESULT.FAIL;
   } else if (mismatchCount > 0) {
     result = RECONCILIATION_RESULT.REVIEW;
-  } else {
-    result = RECONCILIATION_RESULT.PASS;
-  }
+  } else {}
 
   // 分级 severity（重复/丢失 = HIGH；汇总不一致 = MEDIUM）
killedBy: evaluateReconciliation 对账判定 PASS：无任何差异（重复 0 + 丢失 0 + 无汇总不一致）
statusReason: expected undefined to be 'PASS' // Object.is equality

[Killed] ArrowFunction
src/reconciliation.ts:136:48
   }
 
   // 分级 severity（重复/丢失 = HIGH；汇总不一致 = MEDIUM）
-  const discrepancies = scan.discrepancies.map((d) => ({
-    ...d,
-    severity:
-      d.type === DISCREPANCY_TYPE.SETTLEMENT_MISMATCH
-        ? DISCREPANCY_SEVERITY.MEDIUM
-        : DISCREPANCY_SEVERITY.HIGH,
-  }));
+  const discrepancies = scan.discrepancies.map(() => undefined);
 
   return {
killedBy: evaluateReconciliation 对账判定 severity 分级：重复/丢失 = HIGH，汇总不一致 = MEDIUM
statusReason: Cannot read properties of undefined (reading 'severity')

[Killed] EqualityOperator
src/reconciliation.ts:139:7
   const discrepancies = scan.discrepancies.map((d) => ({
     ...d,
     severity:
-      d.type === DISCREPANCY_TYPE.SETTLEMENT_MISMATCH
+      d.type !== DISCREPANCY_TYPE.SETTLEMENT_MISMATCH
         ? DISCREPANCY_SEVERITY.MEDIUM
         : DISCREPANCY_SEVERITY.HIGH,
killedBy: evaluateReconciliation 对账判定 severity 分级：重复/丢失 = HIGH，汇总不一致 = MEDIUM
statusReason: expected 'HIGH' to be 'MEDIUM' // Object.is equality

[Killed] ConditionalExpression
src/reconciliation.ts:139:7
   const discrepancies = scan.discrepancies.map((d) => ({
     ...d,
     severity:
-      d.type === DISCREPANCY_TYPE.SETTLEMENT_MISMATCH
+      true
         ? DISCREPANCY_SEVERITY.MEDIUM
         : DISCREPANCY_SEVERITY.HIGH,
killedBy: evaluateReconciliation 对账判定 severity 分级：重复/丢失 = HIGH，汇总不一致 = MEDIUM
statusReason: expected [ 'MEDIUM', 'MEDIUM', 'MEDIUM', …(1) ] to include 'HIGH'
