[Killed] BlockStatement
src/routing-policy.ts:99:77
  * 计算候选的健康因子分。
  * ACTIVE=1；DEGRADED=degradedHealthScore；半开 probe=probeHealthScore。
  */
-export function healthScore(status: ResourceStatus, probe: boolean): number {
-  if (probe) return ROUTING_POLICY.probeHealthScore;
-  if (status === "DEGRADED") return ROUTING_POLICY.degradedHealthScore;
-  return 1;
-}
+export function healthScore(status: ResourceStatus, probe: boolean): number {}
 
 /**
killedBy: healthScore 健康因子 ACTIVE=1 / DEGRADED=0.6 / probe=0.3
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:100:7
  * ACTIVE=1；DEGRADED=degradedHealthScore；半开 probe=probeHealthScore。
  */
 export function healthScore(status: ResourceStatus, probe: boolean): number {
-  if (probe) return ROUTING_POLICY.probeHealthScore;
+  if (false) return ROUTING_POLICY.probeHealthScore;
   if (status === "DEGRADED") return ROUTING_POLICY.degradedHealthScore;
   return 1;
killedBy: healthScore 健康因子 ACTIVE=1 / DEGRADED=0.6 / probe=0.3
statusReason: expected 1 to be 0.3 // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:100:7
  * ACTIVE=1；DEGRADED=degradedHealthScore；半开 probe=probeHealthScore。
  */
 export function healthScore(status: ResourceStatus, probe: boolean): number {
-  if (probe) return ROUTING_POLICY.probeHealthScore;
+  if (true) return ROUTING_POLICY.probeHealthScore;
   if (status === "DEGRADED") return ROUTING_POLICY.degradedHealthScore;
   return 1;
killedBy: healthScore 健康因子 ACTIVE=1 / DEGRADED=0.6 / probe=0.3
statusReason: expected 0.3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:101:7
  */
 export function healthScore(status: ResourceStatus, probe: boolean): number {
   if (probe) return ROUTING_POLICY.probeHealthScore;
-  if (status === "DEGRADED") return ROUTING_POLICY.degradedHealthScore;
+  if (false) return ROUTING_POLICY.degradedHealthScore;
   return 1;
 }
killedBy: healthScore 健康因子 ACTIVE=1 / DEGRADED=0.6 / probe=0.3
statusReason: expected 1 to be 0.6 // Object.is equality

[Killed] EqualityOperator
src/routing-policy.ts:101:7
  */
 export function healthScore(status: ResourceStatus, probe: boolean): number {
   if (probe) return ROUTING_POLICY.probeHealthScore;
-  if (status === "DEGRADED") return ROUTING_POLICY.degradedHealthScore;
+  if (status !== "DEGRADED") return ROUTING_POLICY.degradedHealthScore;
   return 1;
 }
killedBy: healthScore 健康因子 ACTIVE=1 / DEGRADED=0.6 / probe=0.3
statusReason: expected 0.6 to be 1 // Object.is equality

[Killed] ArrowFunction
src/routing-policy.ts:125:38
   excludeResourceIds: ReadonlySet<string> = new Set(),
 ): ScoredCandidate[] {
   // 1. 标记已尝试（不参与竞争，但仍出现在快照中供解释）
-  const eligible = candidates.filter((c) => !excludeResourceIds.has(c.resourceId));
+  const eligible = candidates.filter(() => undefined);
 
   // 2. 最高优先级组（最小 priority 数值）
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'input')

[Killed] BooleanLiteral
src/routing-policy.ts:125:45
   excludeResourceIds: ReadonlySet<string> = new Set(),
 ): ScoredCandidate[] {
   // 1. 标记已尝试（不参与竞争，但仍出现在快照中供解释）
-  const eligible = candidates.filter((c) => !excludeResourceIds.has(c.resourceId));
+  const eligible = candidates.filter((c) => excludeResourceIds.has(c.resourceId));
 
   // 2. 最高优先级组（最小 priority 数值）
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'input')

[Killed] ArrowFunction
src/routing-policy.ts:128:70
   const eligible = candidates.filter((c) => !excludeResourceIds.has(c.resourceId));
 
   // 2. 最高优先级组（最小 priority 数值）
-  const topPriority = eligible.length > 0 ? Math.min(...eligible.map((c) => c.priority)) : null;
+  const topPriority = eligible.length > 0 ? Math.min(...eligible.map(() => undefined)) : null;
 
   const results: ScoredCandidate[] = candidates.map((c) => {
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'input')

[Killed] MethodExpression
src/routing-policy.ts:128:45
   const eligible = candidates.filter((c) => !excludeResourceIds.has(c.resourceId));
 
   // 2. 最高优先级组（最小 priority 数值）
-  const topPriority = eligible.length > 0 ? Math.min(...eligible.map((c) => c.priority)) : null;
+  const topPriority = eligible.length > 0 ? Math.max(...eligible.map(c => c.priority)) : null;
 
   const results: ScoredCandidate[] = candidates.map((c) => {
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: expected 'b-lo' to be 'a-hi' // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:132:24
 
   const results: ScoredCandidate[] = candidates.map((c) => {
     const excluded = excludeResourceIds.has(c.resourceId);
-    const inTopGroup = !excluded && c.priority === topPriority;
+    const inTopGroup = false;
 
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
killedBy: scoreAndSelect priority 分组与评分 非同分落选者标记 LOWER_SCORE（区分 TIE_BREAK_LOST 与 LOWER_SCORE）
statusReason: expected 'NOT_TOP_PRIORITY' to be 'LOWER_SCORE' // Object.is equality

[Killed] BooleanLiteral
src/routing-policy.ts:132:24
 
   const results: ScoredCandidate[] = candidates.map((c) => {
     const excluded = excludeResourceIds.has(c.resourceId);
-    const inTopGroup = !excluded && c.priority === topPriority;
+    const inTopGroup = excluded && c.priority === topPriority;
 
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
killedBy: scoreAndSelect priority 分组与评分 非同分落选者标记 LOWER_SCORE（区分 TIE_BREAK_LOST 与 LOWER_SCORE）
statusReason: expected 'NOT_TOP_PRIORITY' to be 'LOWER_SCORE' // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:135:46
     const inTopGroup = !excluded && c.priority === topPriority;
 
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
-    const sameGroup = eligible.filter((x) => x.priority === c.priority);
+    const sameGroup = eligible.filter((x) => false);
     const weightSum = sameGroup.reduce((s, x) => s + x.weight, 0);
     const factors: ScoreFactor[] = [
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: expected +0 to be close to 0.9, received difference is 0.9, but expected 0.0000049999999999999996

[Killed] EqualityOperator
src/routing-policy.ts:135:46
     const inTopGroup = !excluded && c.priority === topPriority;
 
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
-    const sameGroup = eligible.filter((x) => x.priority === c.priority);
+    const sameGroup = eligible.filter((x) => x.priority !== c.priority);
     const weightSum = sameGroup.reduce((s, x) => s + x.weight, 0);
     const factors: ScoreFactor[] = [
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: expected +0 to be close to 0.9, received difference is 0.9, but expected 0.0000049999999999999996

[Killed] ArithmeticOperator
src/routing-policy.ts:136:50
 
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
     const sameGroup = eligible.filter((x) => x.priority === c.priority);
-    const weightSum = sameGroup.reduce((s, x) => s + x.weight, 0);
+    const weightSum = sameGroup.reduce((s, x) => s - x.weight, 0);
     const factors: ScoreFactor[] = [
       {
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: expected +0 to be close to 0.9, received difference is 0.9, but expected 0.0000049999999999999996

[Killed] ArrowFunction
src/routing-policy.ts:136:40
 
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
     const sameGroup = eligible.filter((x) => x.priority === c.priority);
-    const weightSum = sameGroup.reduce((s, x) => s + x.weight, 0);
+    const weightSum = sameGroup.reduce(() => undefined, 0);
     const factors: ScoreFactor[] = [
       {
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: expected +0 to be close to 0.9, received difference is 0.9, but expected 0.0000049999999999999996

[Killed] ArrayDeclaration
src/routing-policy.ts:137:36
     // 3. 因子计算（仅在场因子；W12 四因子：weight 归一化/健康/Affinity）
     const sameGroup = eligible.filter((x) => x.priority === c.priority);
     const weightSum = sameGroup.reduce((s, x) => s + x.weight, 0);
-    const factors: ScoreFactor[] = [
-      {
-        name: "static_weight",
-        value: weightSum > 0 ? c.weight / weightSum : 0,
-        weight: ROUTING_POLICY.weights.staticWeight,
-      },
-      {
-        name: "health",
-        value: healthScore(c.status, c.probe),
-        weight: ROUTING_POLICY.weights.health,
-      },
-      {
-        name: "affinity",
-        value: affinityResourceId !== null && c.resourceId === affinityResourceId ? 1 : 0,
-        weight: ROUTING_POLICY.weights.affinity,
-      },
-    ];
+    const factors: ScoreFactor[] = [];
     const weightTotal = factors.reduce((s, f) => s + f.weight, 0);
     const totalScore = weightTotal > 0 ? factors.reduce((s, f) => s + f.value * f.weight, 0) / weightTotal : 0;
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ObjectLiteral
src/routing-policy.ts:138:7
     const sameGroup = eligible.filter((x) => x.priority === c.priority);
     const weightSum = sameGroup.reduce((s, x) => s + x.weight, 0);
     const factors: ScoreFactor[] = [
-      {
-        name: "static_weight",
-        value: weightSum > 0 ? c.weight / weightSum : 0,
-        weight: ROUTING_POLICY.weights.staticWeight,
-      },
+      {},
       {
         name: "health",
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ArithmeticOperator
src/routing-policy.ts:140:32
     const factors: ScoreFactor[] = [
       {
         name: "static_weight",
-        value: weightSum > 0 ? c.weight / weightSum : 0,
+        value: weightSum > 0 ? c.weight * weightSum : 0,
         weight: ROUTING_POLICY.weights.staticWeight,
       },
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: expected 90 to be close to 0.9, received difference is 89.1, but expected 0.0000049999999999999996

[Killed] ConditionalExpression
src/routing-policy.ts:140:16
     const factors: ScoreFactor[] = [
       {
         name: "static_weight",
-        value: weightSum > 0 ? c.weight / weightSum : 0,
+        value: false ? c.weight / weightSum : 0,
         weight: ROUTING_POLICY.weights.staticWeight,
       },
killedBy: scoreAndSelect priority 分组与评分 同优先级内 weight 归一化影响总分
statusReason: expected +0 to be close to 0.9, received difference is 0.9, but expected 0.0000049999999999999996

[Killed] StringLiteral
src/routing-policy.ts:149:15
         weight: ROUTING_POLICY.weights.health,
       },
       {
-        name: "affinity",
+        name: "",
         value: affinityResourceId !== null && c.resourceId === affinityResourceId ? 1 : 0,
         weight: ROUTING_POLICY.weights.affinity,
killedBy: scoreAndSelect priority 分组与评分 Affinity 命中提升总分（WT-13 会话粘性）
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
src/routing-policy.ts:150:16
       },
       {
         name: "affinity",
-        value: affinityResourceId !== null && c.resourceId === affinityResourceId ? 1 : 0,
+        value: true ? 1 : 0,
         weight: ROUTING_POLICY.weights.affinity,
       },
killedBy: scoreAndSelect priority 分组与评分 Affinity 命中提升总分（WT-13 会话粘性）
statusReason: expected 'a-first' to be 'b-second' // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:150:47
       },
       {
         name: "affinity",
-        value: affinityResourceId !== null && c.resourceId === affinityResourceId ? 1 : 0,
+        value: affinityResourceId !== null && true ? 1 : 0,
         weight: ROUTING_POLICY.weights.affinity,
       },
killedBy: scoreAndSelect priority 分组与评分 Affinity 命中提升总分（WT-13 会话粘性）
statusReason: expected 'a-first' to be 'b-second' // Object.is equality

[Killed] ArrowFunction
src/routing-policy.ts:154:40
         weight: ROUTING_POLICY.weights.affinity,
       },
     ];
-    const weightTotal = factors.reduce((s, f) => s + f.weight, 0);
+    const weightTotal = factors.reduce(() => undefined, 0);
     const totalScore = weightTotal > 0 ? factors.reduce((s, f) => s + f.value * f.weight, 0) / weightTotal : 0;
 
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Killed] ArithmeticOperator
src/routing-policy.ts:154:50
         weight: ROUTING_POLICY.weights.affinity,
       },
     ];
-    const weightTotal = factors.reduce((s, f) => s + f.weight, 0);
+    const weightTotal = factors.reduce((s, f) => s - f.weight, 0);
     const totalScore = weightTotal > 0 ? factors.reduce((s, f) => s + f.value * f.weight, 0) / weightTotal : 0;
 
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Killed] EqualityOperator
src/routing-policy.ts:155:24
       },
     ];
     const weightTotal = factors.reduce((s, f) => s + f.weight, 0);
-    const totalScore = weightTotal > 0 ? factors.reduce((s, f) => s + f.value * f.weight, 0) / weightTotal : 0;
+    const totalScore = weightTotal <= 0 ? factors.reduce((s, f) => s + f.value * f.weight, 0) / weightTotal : 0;
 
     return {
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Killed] ArrowFunction
src/routing-policy.ts:155:57
       },
     ];
     const weightTotal = factors.reduce((s, f) => s + f.weight, 0);
-    const totalScore = weightTotal > 0 ? factors.reduce((s, f) => s + f.value * f.weight, 0) / weightTotal : 0;
+    const totalScore = weightTotal > 0 ? factors.reduce(() => undefined, 0) / weightTotal : 0;
 
     return {
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Killed] BooleanLiteral
src/routing-policy.ts:161:17
       input: c,
       factors,
       totalScore,
-      selected: false,
+      selected: true,
       reasonCode: excluded
         ? ROUTE_REASON.EXCLUDED_ALREADY_TRIED
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Killed] MethodExpression
src/routing-policy.ts:171:23
   });
 
   // 4. 选中：最高优先级组内总分最高；同分按 resourceId 字典序（稳定 tie-break）
-  const competitors = results
-    .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
+  const competitors = results
     .sort((a, b) => {
       if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: expected 'TIE_BREAK_LOST' to be 'NOT_TOP_PRIORITY' // Object.is equality

[Killed] MethodExpression
src/routing-policy.ts:171:23
   });
 
   // 4. 选中：最高优先级组内总分最高；同分按 resourceId 字典序（稳定 tie-break）
-  const competitors = results
-    .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
-    .sort((a, b) => {
-      if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
-      return a.input.resourceId.localeCompare(b.input.resourceId); // 稳定 tie-break
-    });
+  const competitors = results.filter(r => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority);
 
   if (competitors.length > 0) {
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Killed] EqualityOperator
src/routing-policy.ts:172:67
 
   // 4. 选中：最高优先级组内总分最高；同分按 resourceId 字典序（稳定 tie-break）
   const competitors = results
-    .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
+    .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority !== topPriority)
     .sort((a, b) => {
       if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: expected 'b-lo' to be 'a-hi' // Object.is equality

[Killed] BooleanLiteral
src/routing-policy.ts:172:20
 
   // 4. 选中：最高优先级组内总分最高；同分按 resourceId 字典序（稳定 tie-break）
   const competitors = results
-    .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
+    .filter((r) => excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
     .sort((a, b) => {
       if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'input')

[Killed] BlockStatement
src/routing-policy.ts:173:21
   // 4. 选中：最高优先级组内总分最高；同分按 resourceId 字典序（稳定 tie-break）
   const competitors = results
     .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
-    .sort((a, b) => {
-      if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
-      return a.input.resourceId.localeCompare(b.input.resourceId); // 稳定 tie-break
-    });
+    .sort((a, b) => {});
 
   if (competitors.length > 0) {
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:174:11
   const competitors = results
     .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
     .sort((a, b) => {
-      if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
+      if (false) return b.totalScore - a.totalScore;
       return a.input.resourceId.localeCompare(b.input.resourceId); // 稳定 tie-break
     });
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Killed] ArithmeticOperator
src/routing-policy.ts:174:49
   const competitors = results
     .filter((r) => !excludeResourceIds.has(r.input.resourceId) && r.input.priority === topPriority)
     .sort((a, b) => {
-      if (b.totalScore !== a.totalScore) return b.totalScore - a.totalScore;
+      if (b.totalScore !== a.totalScore) return b.totalScore + a.totalScore;
       return a.input.resourceId.localeCompare(b.input.resourceId); // 稳定 tie-break
     });
killedBy: scoreAndSelect priority 分组与评分 DEGRADED 健康降权：weight 差距小时健康者胜，差距大时 weight 优势盖过健康
statusReason: expected 'a-deg' to be 'b-ok' // Object.is equality

[Killed] EqualityOperator
src/routing-policy.ts:178:7
       return a.input.resourceId.localeCompare(b.input.resourceId); // 稳定 tie-break
     });
 
-  if (competitors.length > 0) {
+  if (competitors.length >= 0) {
     const winner = competitors[0]!;
     winner.selected = true;
killedBy: failover 排除（提交前切换） 全部已尝试 → 无选中者（不无账放行）
statusReason: Cannot set properties of undefined (setting 'selected')

[Killed] ConditionalExpression
src/routing-policy.ts:178:7
       return a.input.resourceId.localeCompare(b.input.resourceId); // 稳定 tie-break
     });
 
-  if (competitors.length > 0) {
+  if (true) {
     const winner = competitors[0]!;
     winner.selected = true;
killedBy: failover 排除（提交前切换） 全部已尝试 → 无选中者（不无账放行）
statusReason: Cannot set properties of undefined (setting 'selected')

[Killed] BooleanLiteral
src/routing-policy.ts:180:23
 
   if (competitors.length > 0) {
     const winner = competitors[0]!;
-    winner.selected = true;
+    winner.selected = false;
     const tied = competitors.length > 1 && competitors[1]!.totalScore === winner.totalScore;
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'input')

[Killed] ConditionalExpression
src/routing-policy.ts:181:18
   if (competitors.length > 0) {
     const winner = competitors[0]!;
     winner.selected = true;
-    const tied = competitors.length > 1 && competitors[1]!.totalScore === winner.totalScore;
+    const tied = false;
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
     // 同分落选者标记
killedBy: scoreAndSelect priority 分组与评分 稳定 tie-break：同分按 resourceId 字典序，与输入顺序无关
statusReason: expected 'SELECTED_TOP_SCORE' to be 'SELECTED_TIE_BREAK' // Object.is equality

[Killed] EqualityOperator
src/routing-policy.ts:181:44
   if (competitors.length > 0) {
     const winner = competitors[0]!;
     winner.selected = true;
-    const tied = competitors.length > 1 && competitors[1]!.totalScore === winner.totalScore;
+    const tied = competitors.length > 1 && competitors[1]!.totalScore !== winner.totalScore;
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
     // 同分落选者标记
killedBy: scoreAndSelect priority 分组与评分 稳定 tie-break：同分按 resourceId 字典序，与输入顺序无关
statusReason: expected 'SELECTED_TOP_SCORE' to be 'SELECTED_TIE_BREAK' // Object.is equality

[Killed] MethodExpression
src/routing-policy.ts:184:25
     const tied = competitors.length > 1 && competitors[1]!.totalScore === winner.totalScore;
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
     // 同分落选者标记
-    for (const loser of competitors.slice(1)) {
+    for (const loser of competitors) {
       if (loser.totalScore === winner.totalScore) loser.reasonCode = ROUTE_REASON.TIE_BREAK_LOST;
     }
killedBy: scoreAndSelect priority 分组与评分 稳定 tie-break：同分按 resourceId 字典序，与输入顺序无关
statusReason: expected 'TIE_BREAK_LOST' to be 'SELECTED_TIE_BREAK' // Object.is equality

[Killed] BlockStatement
src/routing-policy.ts:184:47
     const tied = competitors.length > 1 && competitors[1]!.totalScore === winner.totalScore;
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
     // 同分落选者标记
-    for (const loser of competitors.slice(1)) {
-      if (loser.totalScore === winner.totalScore) loser.reasonCode = ROUTE_REASON.TIE_BREAK_LOST;
-    }
+    for (const loser of competitors.slice(1)) {}
   }
 
killedBy: scoreAndSelect priority 分组与评分 稳定 tie-break：同分按 resourceId 字典序，与输入顺序无关
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/routing-policy.ts:185:11
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
     // 同分落选者标记
     for (const loser of competitors.slice(1)) {
-      if (loser.totalScore === winner.totalScore) loser.reasonCode = ROUTE_REASON.TIE_BREAK_LOST;
+      if (loser.totalScore !== winner.totalScore) loser.reasonCode = ROUTE_REASON.TIE_BREAK_LOST;
     }
   }
killedBy: scoreAndSelect priority 分组与评分 稳定 tie-break：同分按 resourceId 字典序，与输入顺序无关
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/routing-policy.ts:185:11
     winner.reasonCode = tied ? ROUTE_REASON.SELECTED_TIE_BREAK : ROUTE_REASON.SELECTED_TOP_SCORE;
     // 同分落选者标记
     for (const loser of competitors.slice(1)) {
-      if (loser.totalScore === winner.totalScore) loser.reasonCode = ROUTE_REASON.TIE_BREAK_LOST;
+      if (false) loser.reasonCode = ROUTE_REASON.TIE_BREAK_LOST;
     }
   }
killedBy: scoreAndSelect priority 分组与评分 稳定 tie-break：同分按 resourceId 字典序，与输入顺序无关
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/routing-policy.ts:193:85
 }
 
 /** 从评分结果取选中者（无可用候选时 undefined —— 不无账放行，返回上游不可用）。 */
-export function pickWinner(results: ScoredCandidate[]): ScoredCandidate | undefined {
-  return results.find((r) => r.selected);
-}
+export function pickWinner(results: ScoredCandidate[]): ScoredCandidate | undefined {}
 
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'input')

[Killed] ArrowFunction
src/routing-policy.ts:194:23
 
 /** 从评分结果取选中者（无可用候选时 undefined —— 不无账放行，返回上游不可用）。 */
 export function pickWinner(results: ScoredCandidate[]): ScoredCandidate | undefined {
-  return results.find((r) => r.selected);
+  return results.find(() => undefined);
 }
 
killedBy: scoreAndSelect priority 分组与评分 只有最小 priority 组参与竞争；低优先级组 NOT_TOP_PRIORITY
statusReason: Cannot read properties of undefined (reading 'input')
